{
    "filmes": [
        {
            "url": "https://www.imdb.com/title/tt0133093/",
            "titulo": "The Matrix",
            "generos": [
                "Action",
                "Sci-Fi"
            ],
            "data de lançamento nos cinemas": "1999-05-21",
            "data de lançamento em streaming": null,
            "classificacao indicativa": "14",
            "sinopse": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
            "duracao": "02:16:00",
            "diretor": "Lana Wachowski, Lilly Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Gloria Foster",
                "Joe Pantoliano",
                "Marcus Chong",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Paul Goddard",
                "Robert Taylor",
                "David Aston",
                "Marc Aden Gray",
                "Ada Nicodemou",
                "Deni Gordon",
                "Rowan Witt"
            ],
            "media_crit": "73",
            "reviews_crit": [
                {
                    "avaliacao": 91,
                    "texto": "The Matrix slams you back in your chair, pops open your eyes and leaves your jaw hanging slack in amazement.",
                    "data": ""
                },
                {
                    "avaliacao": 90,
                    "texto": "The Wachowskis do it so playfully well, keeping The Matrix's potentially confusing plot intelligible, intelligent, and suspenseful, that it doesn't matter.",
                    "data": ""
                },
                {
                    "avaliacao": 90,
                    "texto": "Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong. And even if this isn't \"Blade Runner,\" it is very cool shit.",
                    "data": ""
                },
                {
                    "avaliacao": 88,
                    "texto": "Kinetic, atmospheric, visually stunning, and mind-bending.",
                    "data": ""
                },
                {
                    "avaliacao": 80,
                    "texto": "There's a kind of liberating, almost transforming energy in this film; it lights you up and sends you out all giddy with silliness.",
                    "data": ""
                },
                {
                    "avaliacao": 78,
                    "texto": "Doesn't just raise the bar on sci-fi and action films, it rips that sucker off and sends it spiraling into the sun.",
                    "data": ""
                },
                {
                    "avaliacao": 75,
                    "texto": "The plot switches gears every time it threatens to run out of energy, which keeps the show as lively as it is preposterous.",
                    "data": ""
                },
                {
                    "avaliacao": 70,
                    "texto": "Aerves up so much visual wizardry and thought-provoking ideas that even the inevitable Silver touch -- a finale with more bullets than the opening of \"Saving Private Ryan\" -- can't destroy the magic.",
                    "data": ""
                },
                {
                    "avaliacao": 70,
                    "texto": "It may bore you to death or blow your mind -- and it's long and convoluted enough to do both -- but it holds nothing back.",
                    "data": ""
                },
                {
                    "avaliacao": 50,
                    "texto": "There's not much humor to keep it all life-size, and by the final stretch it's become bloated, mechanical, and tiresome.",
                    "data": ""
                }
            ],
            "media_usr": 8.7,
            "reviews_usr": [
                {
                    "avaliacao": "10",
                    "texto": "When this came out, I was living with a roommate. He went out and saw it, came home and said, \"Dude, you have to go see The Matrix.\" So we left and he sat through it a second time. This movie is splendidly done. The mystery about what the Matrix is, unravels and you see a dystopian future unlike any we as a race would want. I have watched this over and over and never tire of it. Everyone does a great job acting in this, the special effects are above par and the story is engaging.",
                    "data": "Oct 31, 2019"
                },
                {
                    "avaliacao": "10",
                    "texto": "The Matrix - 1999This was a real change in filmmaking. Like watching it again in 2020, i.e. after 21 years and it still feels fresh. Iconic scenes are still having benchmarks setting up.If we say it sci-fi at its best, it won't be wrong. The hype was real, it is still not easy to match the level of Matrix where we experience the connection of humans and science, that too with amazing action fight and chase scenes, not just normal scenes they were, multiple exposures, slow motion 3D moves, Oh My God, and it's understandable as well like what are the characters up to and what storyline they are entering into. The script was very well written and executed otherwise it could have been a mess. A special appreciation in managing the theme with those black color costumes and a scientific zone with unimaginable equipment and props doing unbelievable things in the two worlds created. No spoilers, but the action scenes in the climax where the protagonist goes to save someone from agents are really breathtaking. The technology used at its best.A salute to Wachowski Brothers and the team for creating this masterpiece. It will be a great competition and motivation as well for many films coming in the future.",
                    "data": "Sep 30, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Aug 4, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": "This film doesn't age, it will be contemporary even in 2030 or 2040.\nWachowski's best one, by far.",
                    "data": "Jan 3, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "The story of a reluctant Christ-like protagonist set against a baroque, MTV backdrop, The Matrix is the definitive hybrid of technical wizardry and contextual excellence that should be the benchmark for all sci-fi films to come.Hollywood has had some problems combining form and matter in the sci-fi genre.  There have been a lot of visually stunning works but nobody cared about the hero. (Or nobody simply cared about anything.)  There a few, though, which aroused interest and intellect but nobody 'ooh'-ed or 'aah'-ed at the special effects.  With The Matrix, both elements are perfectly en sync.  Not only did we want to cheer on the heroes to victory, we wanted them to bludgeon the opposition.  Not only did we sit in awe as Neo evaded those bullets in limbo-rock fashion, we salivated.But what makes The Matrix several cuts above the rest of the films in its genre is that there are simply no loopholes.  The script, written by the Wachowski brothers is intelligent but carefully not geeky.  The kung-fu sequences were deftly shot -- something even Bruce Lee would've been proud of.  The photography was breathtaking.  (I bet if you had to cut every frame on the reel and had it developed and printed, every single frame would stand on its own.)  And the acting?  Maybe not the best Keanu Reeves but name me an actor who has box-office appeal but could portray the uneasy and vulnerable protagonist, Neo, to a T the way Reeves did.  But, come to think of it, if you pit any actor beside Laurence Fishburne, you're bound to confuse that actor for bad acting.  As Morpheus, Mr. Fishburne is simply wicked!  Shades of his mentor-role in Higher Learning, nobody exudes that aura of quiet intensity than Mr. Fishburne.  His character, battle-scarred but always composed Morpheus, is given an extra dose of mortality (He loves Neo to a fault.) only Mr. Fishburne can flesh out.People will say what they want to say about how good The Matrix is but the bottomline is this: finally there's a philosophical film that has cut through this generation.  My generation. The Wachowski brothers probably scribbled a little P.S. note when they finished the script saying: THINK FOR A MOMENT ABOUT YOUR EXISTENCE.  What is the Matrix, you ask?  Something that's closer to reality than you think.Either that or it's my personal choice for best film of all-time.",
                    "data": "Sep 18, 2000"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 25, 2014"
                },
                {
                    "avaliacao": "10",
                    "texto": "The film is as well crafted as the matrix itself! On another level entirely to any other science fiction film from the last 20 years . Getting lost in another world, is interly what Cinema is made for. This one takes you into a whole new universe interly .",
                    "data": "Feb 22, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": "What if I told you the Matrix is not a Sci-Fi but a Documentary movie?",
                    "data": "Jan 1, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "Writing a review of The Matrix is a very hard thing for me to do because this film means a lot to me and therefore I want to do the film justice by writing a good review. To tell the truth the first time I saw the film I was enamored by the effects. I remember thinking to myself that this was one of the most visually stunning films I had ever seen in my life. Also having always been a comic book fan and a fan of films that were larger than life, the transitional element of the story was very appealing to me and this probably heightened my enjoyment of the film very much. It wasn't until some time later (and after having seen the film a few times more) that I started to think about the film. I recognized the Christian elements quite quickly but it wasn't until I wrote an actual 15-page essay on the film that I tapped into some of the philosophical and religious elements and that made me appreciate the film even more. I won't say that I have recognized all elements because the film is quite literally packed with them.Acting wise the film works excellently. I won't say that there aren't any issues because there are but overall the acting is pretty flawless. Keanu Reeves plays the main character, Neo, or Thomas A. Anderson and while he is not the perfect actor I think he does a pretty good job in The Matrix (and the sequels). He doesn't have the longest of lines which was probably a deliberate choice from the directors and it works because this gives him a better opportunity to work on posture and facial expressions and I must say that overall his body language is very good. Very clear and well defined. Laurence Fishbourne plays Neo's mentor Morpheus and he does an excellent job of it. His lines flow with a certain confidence and style that makes his character somewhat unique and interesting. Carrie-Anne Moss does a good job as well and succeeds in looking both cool and sexy in her leather outfit. Joe Pantoliano, a critically underrated actor does a brilliant job of bringing his character, Cypher, to life. I can't say much about him because his character is pretty essential to the plot and I certainly don't wan't to spoil it for anyone. Gloria Foster appears in a relatively small role that will have greater significance in the following films and she does a very good job. The best acting is provided by Hugo Weaving, however, in his portrayal of Agent Smith. It is really something to watch him act out the changes in his character. Agent Smith gains some human traits like anger, sense of dread, hate and eventually even a sly sense of humor (mostly in the sequels). Two thumbs way up to Weaving who has created one of the finest screen villains of all time.Effects wise the film is simply stunning and it deservedly was awarded the Oscar for best effects (and was regrettably cheated out of a nomination in the Best Film category) ahead of even Star Wars. The reason that I think The Matrix deserves the Oscar for best effects is simply that the effects in The Matrix are more innovative than the ones in Star Wars. Just take a look at how many times the effects have been spoofed and you'll probably agree. The effects also help in the symbolism of the film and in creating a very dystopian atmosphere not unlike the one seen in Blade Runner and this works brilliantly. The film looks beautiful at all times and today 6 years later (my God has it already been 6 years?) the effects still hold their ground against new science fiction films. Add the effects to the brilliant editing and you have a visual masterpiece on your hands. Very well done.The reason that I think The Matrix is more reviewable than pretty much any other film is the story and the philosophical and religious elements of the story because with every viewing I catch something I didn't see the previous time I watched it. Without spoiling the film I think I can mention a few of the more obvious elements. Obviously the film draws on the Messiah myth as Neo is a clear reference to Jesus with the analogy of his name (Neo = one, as in The One) but also hidden in his other name, Thomas A. Anderson. The first part of his last name, Anderson comes from the Greek Andros meaning \"man\" and combine this with the second part of his last name \"son\" and add a little creativity you will come up with the combination \"son of man\" which was a title Jesus came up with about himself. Also the first time we meet Neo a man calls him (and I quote): \"You're my Saviour man. My own personal Jesus Christ.\" It doesn't get any more obvious than that. Aside from the Christianic elements the film also gets its inspiration from Budhism, Gnosticism (Gnosis = knowledge) but is also inspired by Plato and his analogy of the Cave and Jean Baudrillard's essay, Simulacra and Simulations. Explaining these elements would make this review go on forever so aside from mentioning them I will not comment on them further.To all the people who doubt the profound nature of The Matrix I can only give one advice: Free your mind and watch the film again. You won't regret it. If I had to choose a favorite all time film my choice would probably fall on either The Matrix (obviously I don't expect people to agree but if they do thats great) or The Lord of the Rings: The Return of the King and I recommend it to all fans of sci-fi and people who like philosophy.10/10 - on my top 3 of best films.",
                    "data": "Dec 1, 2005"
                },
                {
                    "avaliacao": "9",
                    "texto": "At first, I wasn't interested in seeing the Matrix. But after hardly hearing any bad reviews for it (and believe me, I hear bad reviews for every movie I enjoy) I decided to give it a try. At first, although I really loved the fights, graphics and characters, the plot confused me. (Anyone confused by the plot at all should go to www.knowthematrix.com and you'll find out everything you could want to know) By the second time I watched it, I really understood it, which made the movie even more enjoyable.I really loved this movie. Just about every character, good or bad, is very interesting and cool. The acting was excellent. Even though I think this was Keanu Reeves at his best, the best acting jobs were done by Laurence Fishburne (Morpheus) and Carrie-Anne Moss (Trinity). Hugo Weaving did an excellent job as Agent Smith and Joe Pantoliano was great as Cypher as well.The plot is one of the best movie plots I've seen in a movie. An accountant by day, computer hacker by night guy suddenly finds out that reality as we know it is fake and that we are actually in a giant computer program run by robots (that we created, of course) in order for them to get power. Not only that, but he finds out that he is one who is, according to prophecy, going to put an end to it. The greatest thing is that you learn things just as Neo does, so you can really relate to his character.My favorite thing about this movie is that no matter how many times you watch it, you will learn more about it. I guarantee this. Some may not like this movie because the plot is too complicated, but I recommend that anyone who enjoys movies should go buy this one right away.",
                    "data": "Feb 1, 2000"
                },
                {
                    "avaliacao": null,
                    "texto": "and this is all. because each explanation sounds wrong. sure, the acting,, the plot, the fight/action scenes are great. maybe unique. but the essence, for me, remains the basic idea . a fake reality against the pure truth. and the magic as clothes of each character. because it is more than a film. it is a revolution in the way to see a film and to discover reality. you are Neo. and the mythological mix of symbols and cultural references and the simple story who seems have more and more levels are more than fascinating - it is real. sure, Matrix has a lot of reviews and around it is very easy to say hypothesis, verdicts, opinions or, maybe, critics. it is enough to say it is a masterpiece. or the perfect fascinating fairy tale.",
                    "data": "Jan 7, 2017"
                },
                {
                    "avaliacao": "7",
                    "texto": "Ok, I'm getting sick of comments saying stuff like \"The Matrix is the greatest film EVER MADE!\"That's complete and utter bullturd. Yes, it had great cinematography and effects, yes it had a great soundtrack but NO WAY was the acting superb and NO WAY was the storyline great.Take that storyline and stick it in any other action movie and you would leave feeling disappointed at the end. It's major selling point was \"What is the Matrix? You have to see it for yourself.\" Come on, the only plot twist was that thing to do with Cypher, and that wasn't greatly unforeseeable, there's things like that in every frigging action movie.The thing that set it apart was the ground-breaking camera effects, gnarly special effects and a funky soundtrack, as well as the costume design bit, with all that leather and expensive sunglasses. Without this stuff, all you would be left with is your average action movie.I'm not saying it was a bad film at all, just not one of the greatest. Highly entertaining, great to watch with your mates, definitely one of the most interesting films in recent years. But give me The Third Man, Memento or the Usual Suspects any day.7/10",
                    "data": "Sep 9, 2001"
                },
                {
                    "avaliacao": "5",
                    "texto": null,
                    "data": "Mar 15, 2017"
                },
                {
                    "avaliacao": "10",
                    "texto": "Without a doubt one of the best and most influential movies of all time, the Matrix is the defining science fiction film of the 1990's and the biggest leap the genre has taken since Stanley Kubrick's 2001: A Space Odyssey and Ridley Scott's Blade Runner. The Matrix is a ground-breaking motion picture that not only raised the bar for all the science-fiction films to come after it but also redefined the action genre with its thrilling action sequences and revolutionary visual effects.The film tells the story of Thomas Anderson a computer hacker that in the world of hacking goes by the alias of Neo. When he is contacted by the mysterious outlaw Morpheus and having always questioned his reality, he is awakened to the truth that the world he's been living in is a simulated reality called the Matrix and that he's nothing more than a slave in this dystopian world, created and controlled by A.I powered machines.The direction and script by the Wachowskis is fantastic, as they drew ideas and inspirations from every other great sci-fi and cyberpunk movie and anime before the film, combining it with stunning action and putting it into one picture that has enough style, substance and subtext that everyone ended up giving their own interpretation of the story. The research that went into the preparation of the screenplay is quite extensive but the manner in which it is presented on the big screen is also very impressive. Every character presented on the film, has a well-defined arc and a purpose, and their motivations are clear.The cinematography is impeccable. It was very innovative in the use of the camera angles and movements, the zooms, the slow-motion captures and the different color palette used to differentiate the Matrix and the real World. The editing is flawless, as it makes sure that every scene is integral to the story and ensures the pace of the film stays ferocious through its entire runtime. Each frame is also packed with so much visual information for the viewer to devour. The visual effects introduced us to the bullet-time effect and their impact can still be felt in today's movies. The performances are also incredible. Each member of the cast gave their best performances and brought the characters they portray to life, but the one that stands out the most is Hugo Weaving's disciplined rendition of his character, Agent Smith; a powerful computer program made to search and destroy the human rebellion, in undoubtedly the greatest performance in his career.In conclusion The Matrix is a masterpiece everyone should see. It is one of the most thought provoking, inventive, pioneering, influential and stylish movies of all time and it's also full of philosophical and religious allegories waiting for interpretation. Immortal for its contribution to cinema and pop culture, its brilliant combination of inventive visual effects, excellent vision and exquisite action easily makes it one of the best, most influential and most entertaining movies ever made.",
                    "data": "Apr 10, 2018"
                },
                {
                    "avaliacao": null,
                    "texto": "The Matrix...when I first heard about it, I expected just another sci-fi action thriller.  Good and filled with insane stunts, but not terribly intelligent.Boy, was I wrong.  Oh, the stunts are there in spades, all right, and yes, they are awesome.  And the special effects are absolutely amazing (even if similar ones have been used in other movies as a result- and not explained as well).But the movie has plot as well.  It has characters that I cared about.  From Keanu Reeves' excellent portrayal of Neo, the man trying to come to grips with his own identity, to Lawrence Fishburne's mysterious Morpheus, and even the creepy Agents, everyone does a stellar job of making their characters more than just the usual action \"hero that kicks butt\" and \"cannon fodder\" roles.  I cared about each and every one of the heroes, and hated the villains with a passion.  It has a plot, and it has a meaning...and lo and behold, a plot does help the fight scenes!  Just try it, if you haven't seen the movie before.  Watch one of the fight scenes.  Then watch the whole movie.  There's a big difference in the feeling and excitement of the scenes- sure, they're great as standalones, but the whole thing put together is an experience unlike just about everything else that's come to the theaters.  Think about it next time you're watching one of the more brainless action flicks...think how much better it COULD be.All I can say is WATCH THIS MOVIE.  If you haven't, you're missing out on one of the best films of all time.  It isn't just special effects, folks.",
                    "data": "Mar 2, 2001"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Mar 13, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "This movie is so well written that you can't even prove this movie is wrong about our world. This movie mades you think that our world can be just a reflection, a fake world. It's not just about the war between AI and humanity. It's more about questioning the reality.And years later the idea is never gets old. This is the movie that you should respect if someone says \"I think this is the greatest movie of all time.\" because it has somethings unique, not special it's just unique.It's beyond all the Science-Fiction movies. Normally Sci-Fi movies mades you think \"Can this subject of the movie be real someday?\" and actually only some of them made you think that way. This one mades you think \"I can't deny, this could be our reality. We can never be sure.\"Besides making one of the greatest Fictional Universes, this movie also achieves so much more.And not only that, this movie is also achieves something great in Action. It has the most iconic action scenes. Action director is so great. Revolutionary VFX and SFX, amazing Set Decoration and more.",
                    "data": "Mar 1, 2023"
                },
                {
                    "avaliacao": "10",
                    "texto": "20 years after its release, and several years since I last saw it, some reflections on the experience of rewatching The Matrix. In no particular order ...1) It still look great. I mean, this is one amazing, stylish looking phone. Very little about the look of the film has dated - the mobile phones, obviously, Neo's computer, and very briefly a couple of visual effects creak. But otherwise, this looks as amazing at it did on release. It's sumptuous.2) I think I was one of the many who misjudged Keanu Reeves all those yeas ago. I made easy jokes about his vacant stare and apparent intelligent. From this vantage point we can see he's been in a good number of successful, intelligent films. It's also become clear that within the industry he as a reputation as decent, hardworking man who is a pleasure to work with.3) It's apparent again how literate and cine-literate the film is. I knew this 20 years ago, but since then I've seen a lot more films and read a lot more books, and this time around I especially loved the way the film nods its head to other film genres and influences. I noticed a lot of Peckinpah, and did I see a nod to Kurosawa there too? And I was reminded that for an English Literature graduate like me, this is a goldmine of quotes, allusions and references.4) Seen 20 years on, its influence on cinema since is clear. There's a lot we could talk about here, but I was especially struck by how indebted a director like Christopher Nolan is (keeper of the flame of intelligent blockbusters), especially with Inception.5) I'd forgotten that the narrative ostensibly maintains uncertainty about Neo's identity until just before the end. I'm not sure this really works - anyone who's read many books or ever done an anagram will not find that the most suspenseful part of the narrative.6) Despite a run time of 2 and a quarter hours, it never flags and attention never wonders. The film fizzes with kinetic energy and the time flies by. It's a lean film, without a wasted moment.7) The film is, of course, packed with religious allusions. When I wrote a chapter on this for my BA Theology dissertation, I said I thought the film was neo-Bhuddist (forgive the pun, please), and I stand by that on rewatching. Of course, there's lots of allusions to Christian and other theology, and The Matrix spawned some really bad reading of film by Christians which has never really stopped. When will some Christians learn to read a film/book etc with integrity and understanding of what the film is trying to do? It's a spiritually confused mish-mash of a film - but still a gloriously entertaining one.8) All these years later, it turns out The Matrix was somewhat prophetic about the role technology would play in our lives. Humans permanently plugged in to networks? Different layers of reality that are somehow more real than what we think of as real? The Wachowskis saw all that and more coming 20 years ago. Artists are the weather vane of society; we really should learn to pay attention to them.9) Bottom line. I still bloody love this film. I'm trying to work out if I have the requisite strength to revisit the sequels....",
                    "data": "Feb 21, 2019"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 29, 2015"
                },
                {
                    "avaliacao": "10",
                    "texto": "The Wachowski brothers really did excel themselves with this movie. It's a brilliant movie on a number of different levels - the directing is excellent, the camera work is great, the visuals are stunning, the kung-fu is A+, acting is executed with style and conviction, and the plot is truly inspired. It's really hard to use enough superlatives on this movie!It'd be a 10/10, except for the ending. Having Neo do what he does at the end really lets it down, in my opinion. However, there's a couple of sequels on the way, so let's see what the Wachowskis can do to make up for it.Other than that, (and like I said above) the movie is operating on so many different levels that each time you watch it, you pick up something new... this isn't by accident, either. The Wachowski brothers had the actors read a number of definitive works (Simulation & Simulcra was one I believe) in modern literature and psychology, and applied liberal dashings of aspects of the major religions to provide the best sci-fi movie of the decade, if not ever.I'm yet to meet somebody who hasn't enjoyed it. It's my favourite movie to watch on a good cinema system, too.",
                    "data": "Apr 22, 2002"
                },
                {
                    "avaliacao": "9",
                    "texto": "'The Matrix' may not be one of the very greatest examples of its genre (like '2001', 'Metropolis', 'Blade Runner', 'Back to the Future', 'Star Wars Original Trilogy', 'Alien' and 'Aliens'), but that it is revolutionary in how its visuals and use of sound broke boundaries like had never been done before cannot be denied.It is not a film to be seen if people want character depth or relationship depth, with the forced and underdeveloped love subplot between Neo and Trinity being 'The Matrix's' sole weak spot. This ended up not being that huge a problem for me because everything else is so well executed.Particularly striking about 'The Matrix' is its production values. Simply put, the film looks amazing in its audacious production design, dazzling special effects that are some of the most ultra-cool and imaginative to exist, super slick editing and often jaw dropping cinematography. So much more than a film with ground-breaking special effects and use of camera work that broke boundaries.Use of sound was also striking, and how the pulsating and hypnotic music score was used. Andy and Larry Wachowski direct adeptly, while the script is an intelligent mix of complex and well-explored themes, mysticism, philosophy and even Lewis Carroll and the story is often invigorating and intensely taut with a smart concept brilliantly done.Action is superbly shot and edited, and the way it is choreographed is relentlessly intense and breathless in its energy, Kung Fu has rarely been more vertigo-inducing (despite how this sounds, this is not a bad thing as it added hugely to the intensity and paranoia of the story's atmosphere) on film.Keanu Reeves is in one of his best and most iconic roles and has never looked cooler, certainly has not looked this comfortable for a while before then. Carrie Anne Moss is strong. Even better are an imposingly charismatic Laurence Fishburne (also in one of his best roles), an amusing Joe Pantoliano and a deliciously wicked Hugo Weaving.Summing up, not one of the best of the genre but a mile-stone nonetheless and a great one. Followed by two sequels, both nowhere near in the same ball-park. 9/10 Bethany Cox",
                    "data": "Feb 19, 2017"
                },
                {
                    "avaliacao": "10",
                    "texto": "Truly a masterpiece in every way! If it wasn't for Fight Club this would my favorite; I've been on the fence about it. The Matrix along with They Live have the best metaphors about life/society, most of which a lot of the population aren't woke to!For example the entire speech Morpheus says \"The Matrix is everywhere. It is all around us. Even now, in this very room. You can see it when you look out your window or when you turn on your television. You can feel it when you go to work... when you go to church... when you pay your taxes. It is the world that has been pulled over your eyes to blind you from the truth. That you are a slave, Like everyone else you were born into bondage. Into a prison that you cannot taste or see or touch. A prison for your mind.\" Among other brilliant quotes like when he talks about what the world has become, then mentions we have become this referring to a battery. So many genius lines I could list that I won't.The effects, stunts, lighting, sounds, and tone are outstandingly spot on! They really did train for the fight sequences for months I've seen all the special features plus more. Yes this is a sci-fi film, but I see it as a documentary as well. We're all slaves that take the blue pill throughout many things it's just hard to realize that. I also love what someone else said, it's a benchmark for sci-fi to come, that is very true and it's the last of its kind; movies aren't made like this anymore!A lot of people worked hard to make this film what it is. I respect that; I've always wanted to work on film just haven't had a way for many reasons. If you've read this far or even at all thanks and sorry! I usually don't leave a review this long, just thought it was worth it for this one. Check out my others if you're interested for now 10 out of 10 phenomenal movie in many ways!",
                    "data": "Mar 30, 2019"
                },
                {
                    "avaliacao": "7",
                    "texto": null,
                    "data": "Jan 31, 2023"
                },
                {
                    "avaliacao": "2",
                    "texto": null,
                    "data": "Aug 7, 2005"
                },
                {
                    "avaliacao": null,
                    "texto": "The first 45 minutes of this film had me very excited. It is so rare that I will go to the theater and be presented with something which is both original and intelligent. It managed to hang in there throughout, though the ending was too formulaic. In addition, the voice-over at the very end reminded me of the final scene in Saving Private Ryan. It almost ruins a fantastic film.The only other objection I can come up with is that the you must know, you must be type philosophy being handed out was just a tad hokey. I must pleasantly admit though, since I don't get to admit this very often, that The Matrix is worth seeing despite these things.The visuals are extremely impressive, particularly the \"white room,\" the baby harvester, the training scene with the \"red woman,\" the Reeves interrogation scene... I have to agree with some of the previous comments that the plot idea won't seem overly original to a fan of Philip K Dick, but then what is original after you've read him? The Matrix has more original things to say than two months worth of standard Hollywood fare. I have a great deal of respect for a film which will have someone say \"they're turning humans into this\" and hold up a battery. A plot which looks at man as machine will get a thumbs up from me just for trying.I feel some hope for the future of movie-making in America to be able to recommend this film.",
                    "data": "Apr 1, 1999"
                }
            ]
        },
        {
            "url": "https://letterboxd.com/film/the-matrix/",
            "titulo": "The Matrix",
            "generos": [
                "Science Fiction",
                "Action"
            ],
            "data de lançamento nos cinemas": "1999-05-21",
            "data de lançamento em streaming": null,
            "classificacao indicativa": null,
            "sinopse": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
            "duracao": "02:16:00",
            "diretor": "Lana Wachowski, Lilly Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Gloria Foster",
                "Joe Pantoliano",
                "Marcus Chong",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Paul Goddard",
                "Robert Taylor",
                "David Aston",
                "Marc Aden Gray",
                "Ada Nicodemou",
                "Deni Gordon",
                "Rowan Witt",
                "Eleanor Witt",
                "Tamara Brown",
                "Janaya Pender",
                "Adryn White",
                "Natalie Tjen",
                "Bill Young",
                "David O'Connor",
                "Jeremy Ball",
                "Fiona Johnson",
                "Harry Lawrence",
                "Steve Dodd",
                "Luke Quinton",
                "Lawrence Woodward",
                "Michael Butcher",
                "Bernard Ledger",
                "Chris Pattinson",
                "Robert Simper",
                "Nigel Harbach"
            ],
            "media_crit": null,
            "reviews_crit": [],
            "media_usr": "8.34",
            "reviews_usr": [
                {
                    "avaliacao": 8.0,
                    "texto": "neo being woken up by a kiss officially makes him a disney princess, right?",
                    "data": "2021-08-19"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "When he jumps out to save Morpheus who isn’t gonna make it, and catches him then they reveal the chain he’s attached to, then the helicopter’s fuselage is shot, then trinity has to land them on the rooftop, then Neo rolls to a stop and realizes the woman he loves is stuck on the crashing helicopter and immediately shores up his strength on the cable, then trinity holds the cable and shoots its bearings, then jumps and the helicopter hits…",
                    "data": "2019-12-22T22:36:32.837Z"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "i can also do a backflip",
                    "data": "2021-12-07"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "funny how the color green didn’t even exist until this masterpiece was released in 1999",
                    "data": "2019-11-06"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Taking the red pill up my ass to shock Morpheus",
                    "data": "2021-09-19"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Me and the boys calling each other by our gamertags in real life",
                    "data": "2020-07-29"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "BITCH I'M 20 YEARS LATE SHOOK",
                    "data": "2019-08-17"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "team blue pill all the way baby, we LOVE living in denial ladies",
                    "data": "2019-03-31"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "trinity: dodge this me, prolapsing: god is a woman",
                    "data": "2017-08-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Holy fuck. Fuck me for not seeing this the day it came out. I mean I was only 2 years old, but that's just not a good enough excuse.",
                    "data": "2016-04-14"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "when i say this film is ahead of its time i mean it was 1 year before linkin park",
                    "data": "2019-07-19"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "thinking about how morpheus’ glasses don’t have arms",
                    "data": "2021-11-05"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/matrix",
            "titulo": "The Matrix",
            "generos": [
                "Sci-Fi",
                "Action",
                "Mystery & Thriller"
            ],
            "data de lançamento nos cinemas": "Mar 31, 1999, Wide",
            "data de lançamento em streaming": "Jan 1, 2009",
            "classificacao indicativa": "R",
            "sinopse": "Neo believes that Morpheus, an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity, a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.",
            "duracao": "2h 16m",
            "diretor": "Lilly Wachowski, Lana Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Joe Pantoliano",
                "Gloria Foster",
                "Marcus Chong",
                "Paul Goddard",
                "Robert Taylor",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Rowan Witt"
            ],
            "media_crit": "83%",
            "reviews_crit": [
                {
                    "avaliacao": "4.5/5",
                    "texto": "Making a great film that's a psychedelic, kung-fu-inspired meditation on the human condition is a tall order. The Matrix delivers on all that & more.",
                    "data": "Sep 27, 2024"
                },
                {
                    "avaliacao": "5/5",
                    "texto": "“The Matrix” is the AI prophecy and wake-up call the human race is in dire need of. Watching the 2024 re-release is highly recommended.",
                    "data": "Sep 25, 2024"
                },
                {
                    "avaliacao": "5/5",
                    "texto": "An amazing cocktail of martial arts, shootouts, philosophy, romance, fantasy, revolutionary visual effects and perfect casting. “The Matrix” surprised us 25 years ago, and it continues to surprise us in the Year of Our Lord 2024. Full review in Spanish.",
                    "data": "Sep 21, 2024"
                },
                {
                    "avaliacao": "",
                    "texto": "The Wachowskis proceed to turn the world as we know it into a virtual reality landscape with a 20th century tech-noir look (lit with a sickly green hue, like the glow of an old IBM computer screen) and the physics of a video game.",
                    "data": "Sep 9, 2023"
                },
                {
                    "avaliacao": "",
                    "texto": "A $60 million, high-tech assault on the senses and a pretentious insult to the mind.",
                    "data": "Jul 15, 2023"
                },
                {
                    "avaliacao": "",
                    "texto": "A cyberpunk thriller that's so much fun to watch, it could single-handedly reboot the genre.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "",
                    "texto": "The Wachowskis seem to be saying that while state-of-the-art effects speak for themselves, loud and clear, there's still room amid all the kicking and shooting and shouting for the carefully observed human emotion.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "2.5/4",
                    "texto": "Though The Matrix ultimately overdoses on gloom-and-doom grunge, over-elaborate cool and especially running time, it's just clever enough to enable [the Wachowskis] to nix the sophomore jinx following 1996's Bound.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "",
                    "texto": "I know almost nothing of the intricate techniques that make The Matrix as eye-filling as it is brain-numbing, but I can tell you that... [its visuals] are wondrous to behold.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "3/5",
                    "texto": "If you're looking for a good spring fix of existentialist sci-fi, look no further than The Matrix -- then do everything you can to look deeper than the skin-tight surface.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "4/5",
                    "texto": "Although it's sometimes too confounding for its own good and a little heavy on the Zen-inspired techno-babble, The Matrix is a consistently absorbing assault on the senses.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "",
                    "texto": "There's more form than content in The Matrix, but Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "3/4",
                    "texto": "Give [the Wachowskis] an A for effort and three A's for those effects. The Matrix is a dazzlingly original visual adventure.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "1/4",
                    "texto": "Casting the robotic Reeves as the hope of humanity may be this oppressively long, self-satisfied movie's funniest gag, but it doesn't really make the game any fun. It means we get stuck with the least interesting player.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "2.5/4",
                    "texto": "The Matrix's pleasures are considerable, but they're all purely visceral, too, lacking the mythology that would have elevated the movie. The movie is best taken as the first entry in a brand-new genre: post-modern sci-fi pulp.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "",
                    "texto": "How could filmmakers who are so skilled and imaginative lose themselves (and us) in what feels like a college stab at Aldous Huxley metaphysics?",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "2/5",
                    "texto": "A futuristic paranoia extravaganza, it would seem to have far more appeal to an artificial intelligence than it would to human beings and other carbon-based life forms.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "2.5/5",
                    "texto": "An interminable, sterile, exercise in cinematographic onanism.  [Full review in Spanish]",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "B",
                    "texto": "Like last year's Dark City, the effects and storyline of The Matrix plow through enough fresh territory to make it worth seeing.",
                    "data": "Jul 13, 2023"
                },
                {
                    "avaliacao": "2.5/4",
                    "texto": "Visually, at least, The Matrix more than lives up to its billing. Writer-directors [the Wachowskis] seem to literally bring the screen to life with action scenes that define the word kinetic.",
                    "data": "Jul 13, 2023"
                }
            ],
            "media_usr": "85%",
            "reviews_usr": [
                {
                    "avaliacao": 5.0,
                    "texto": "amazing acting, action and visuals. It is a must see classic no matter what movies you like",
                    "data": "Nov 8, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "This movie was ahead of its time. A classic master piece with quality actors.",
                    "data": "Nov 8, 2025"
                },
                {
                    "avaliacao": 3.5,
                    "texto": "Cool action movie.... although a bit flawed.....",
                    "data": "Nov 6, 2025"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Fun and clever movie.",
                    "data": "Nov 1, 2025"
                },
                {
                    "avaliacao": 0.5,
                    "texto": "Wish I could give this pretentious pile of crap Zero Stars.",
                    "data": "Oct 31, 2025"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "One of the most iconic movies of my generation\n\nFor a movie made in the late ’90s, The Matrix has absolutely incredible production value. The visual effects and animation techniques were way ahead of their time — the slow-motion “bullet time” shots and slick fight choreography still hold up amazingly well today. It’s one of those films that completely changed the game for action and sci-fi movies.\n\nFrom start to finish, The Matrix keeps you on the edge of your seat. The story is mind-bending, the pacing is perfect, and the atmosphere pulls you deep into its futuristic world. It’s one of those rare movies that makes you think while still delivering nonstop entertainment.\n\nOverall, I’d give The Matrix a solid 4 stars. It’s stylish, thought-provoking, and packed with action — an iconic film that still feels fresh decades later.",
                    "data": "Oct 28, 2025"
                },
                {
                    "avaliacao": 4.5,
                    "texto": "OK, so it's a bit surf dude nonsensical, but it's a great idea and an even greater spectacle. It really doesn't make sense on any level but as long as you don't mind that, you can just enjoy the ride.",
                    "data": "Oct 27, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "This movie was built to mastery. There is so much brilliance that went into asking some very deep questions about life, creation and so many other spiritual mysteries. Extremely well done and highly enjoyable. This movie was so far ahead of its time that no other film series has been able to dig this deep on asking some very important questions. Very nice balance between story and integrating technical action scenes. Very well done. One of my very favorite movies of alll time",
                    "data": "Oct 27, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "One of the greatest movies ever.",
                    "data": "Oct 23, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "Best AI Take Over + Action movie ever created. Just watch it if you haven't. There were so many industry standards set with this movie. If you don't like it, there's probably something wrong with you and you should see a professional about it. :)",
                    "data": "Oct 21, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "One of the best movies ever made.",
                    "data": "Oct 16, 2025"
                },
                {
                    "avaliacao": 4.5,
                    "texto": "The Matrix is a science fiction film about Neo, a hacker who discovers that he is in a simulation, and joins a group a rebels to fight to save humanity. The movie has an interesting story, great acting, amazing visuals, and special effects that still hold up with today's standards. Overall, I would give it a 9.5, definitely one of the best films I've watched.",
                    "data": "Oct 15, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "To be honest, one of the best sci-fi movies I've ever seen because it really go through the question of \"do we really live in the world we live in\", really thought-provoking  and well paced : everything isn't explained and laid out to you : you have to follow the storyline and understand by yourself (more immersive than usual Sci-fi movies).  It aged a bit, yeah, but still have impressive effects and CGI is really specific at this movie, a revolutionnary futuristic style with new ways of editing (at the time it was published). The music is also more original than usual with Rage Against The Machine and electro/grunge music that really goes well with the overall atmosphere. \n And surprisingly, the following movies are as good as this one (maybe less impressive because effects were less surprising) with a well-thought storyline and effects obviously.",
                    "data": "Oct 9, 2025"
                },
                {
                    "avaliacao": 4.5,
                    "texto": "so really good. and it's the best.",
                    "data": "Sep 30, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "It was absolutely incredible on the big screen!!! I didn’t get to see it on its initial run, but I didn’t see the sequels.  This was a full circle moment and I’m so glad I got to experience as the director’s intended it to be.",
                    "data": "Sep 28, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "Greatest movie of my time",
                    "data": "Sep 20, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "The matrix is a Extremely important piece of cinema. It was shot pre 911. It had come just 2 years before star wars rebooted episode 1. Amd, It was badass. The whole comcelt was something I nyself truly thought up once. Completely differe t vision for the film. Bjt i still had this film in my mind. I gill this day in 2025 say its the best film rver. Msde handd down bh a mile. Watch this m ow!!!!!",
                    "data": "Sep 18, 2025"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "The ai predict thing is kinda cool",
                    "data": "Sep 7, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "The Matrix is one of those movies that everyone should probably see. The cultural impact that this movie has had on the world (in both good and bad ways) is completely incomparable. There are people out there that think the undertones of spiritual and world views in this film are actually real. The action in this movie is amazing, and the story in peak. If you haven't seen this yet, now is the time.",
                    "data": "Aug 30, 2025"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "An amazing movie in the year of amazing movies, 1999 was perfect",
                    "data": "Aug 30, 2025"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/replicant",
            "titulo": "Replicant",
            "generos": [
                "Action",
                "Mystery & Thriller",
                "Sci-Fi"
            ],
            "data de lançamento nos cinemas": "",
            "data de lançamento em streaming": "Mar 1, 2007",
            "classificacao indicativa": "R",
            "sinopse": "Detective Jake Riley (Michael Rooker) is on the trail of serial killer Edward \"The Torch\" Garrotte (Jean-Claude Van Damme), who murders mothers and sets them ablaze after they're dead. Nearing retirement, Riley is removed from the case but is soon contacted by a government agency that has created a clone of Garrotte using a secret technology. The replicant (also Van Damme) teams with Riley to help track down the killer, but despite the novel approach, Garrotte will be hard to stop.",
            "duracao": "1h 37m",
            "diretor": "Ringo Lam",
            "cast": [
                "Jean-Claude Van Damme",
                "Michael Rooker",
                "Catherine Dent",
                "Ian Robison",
                "Brandon James Olson",
                "Pam Hyatt",
                "Allan Gray",
                "Jayme Knox"
            ],
            "media_crit": "27%",
            "reviews_crit": [
                {
                    "avaliacao": "4/10",
                    "texto": "The finale, drawn out and exceptionally bloodthirsty, is moderately satisfying – even if terribly unrealistic, which matches the nonsensical parting shots.",
                    "data": "Sep 25, 2025"
                },
                {
                    "avaliacao": "2.5/4",
                    "texto": "The action sequences are well staged and credit where credit is due: The 40-year-old martial artist still has the physical goods, executing 180 splits and gymnastic stunts with the grace and apparent ease of someone much younger.",
                    "data": "Nov 2, 2008"
                },
                {
                    "avaliacao": "2/5",
                    "texto": "",
                    "data": "Oct 9, 2005"
                },
                {
                    "avaliacao": "2/5",
                    "texto": "",
                    "data": "Aug 14, 2005"
                },
                {
                    "avaliacao": "3/5",
                    "texto": "",
                    "data": "May 6, 2005"
                },
                {
                    "avaliacao": "2/5",
                    "texto": "Slightly less awful than most of Van Damme's efforts.",
                    "data": "Apr 3, 2005"
                },
                {
                    "avaliacao": "0/5",
                    "texto": "Low budget and low thought exploration of promising idea",
                    "data": "Sep 16, 2004"
                },
                {
                    "avaliacao": "2/4",
                    "texto": "Replicant doesn't even come close to some of Van Damme's better flicks (Timecop and Sudden Death), but it's certainly an improvement over what he's been up to lately.",
                    "data": "May 7, 2003"
                },
                {
                    "avaliacao": "C+",
                    "texto": "I was surprised to find \"Replicant\" wasn't too bad at all.",
                    "data": "Sep 24, 2002"
                },
                {
                    "avaliacao": "58/100",
                    "texto": "People looking for a movie that offers conversational debate on a controversial dilemma should look beyond this one-dimensional decoy.",
                    "data": "Dec 8, 2001"
                },
                {
                    "avaliacao": "2/4",
                    "texto": "The whole trying affair is irresistibly dopey. Kinetic, too.",
                    "data": "Oct 19, 2001"
                }
            ],
            "media_usr": "37%",
            "reviews_usr": [
                {
                    "avaliacao": 0.5,
                    "texto": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
                    "data": "Jun 15, 2025"
                },
                {
                    "avaliacao": 0.5,
                    "texto": "What’s better than one van damme ? We already know, double impact showed us exactly what…. these toooze can do. Except one is a bingo. The road twitch brought him a coat after, he destroyed her place, and he never said one word to her. Phile.",
                    "data": "Apr 18, 2025"
                },
                {
                    "avaliacao": 1.5,
                    "texto": "Do not waste your time, I can’t believe this got any good reviews at all, premise is pretty stupid, but the acting is worse.",
                    "data": "Mar 8, 2025"
                },
                {
                    "avaliacao": 1.5,
                    "texto": "Not only was he a 'bad boy', it was a very bad film.",
                    "data": "Jul 17, 2023"
                },
                {
                    "avaliacao": 3.5,
                    "texto": "An unusual strong performance for Van Damm, I would say if the premise doesn't at least interest you, watch it for his performance alone.  Recommended for action fans",
                    "data": "Jul 24, 2020"
                },
                {
                    "avaliacao": 3.5,
                    "texto": "The action is cool and JCVD gives one of his best performances.",
                    "data": "Jul 1, 2020"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Van Damme plays two very different roles and it comes together in a great movie.",
                    "data": "Oct 23, 2018"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Another classic Jean Claude entry.",
                    "data": "Jun 17, 2018"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "My 3rd fav Jean-Claude Van Damme film behind Bloodsport & Kickboxer. The tagline to this film is spot on. Michael Rooker's character has to work with a guy who looks practically identical to his own worst enemy, If that's not compelling... I don't know what is. So critics how is this bad? Because this is far more superior to Citizen Kane, The Dark Knight Rises & The Last Jedi combined. Criminally Underrated",
                    "data": "Mar 25, 2018"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Ridiculous premise, but Van Damme is surprisingly convincing in his polar performances, and as always his fight scenes are kinetic and fun.",
                    "data": "Oct 9, 2016"
                },
                {
                    "avaliacao": 3.0,
                    "texto": "Okay, so the story has a hokey premise and failed fully explore some potentially thought-provoking themes. Still, I think Van Damme's performance as both the Torch and the Replicant is vastly underappreciated.",
                    "data": "Oct 6, 2016"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "One of JCVD's better movies",
                    "data": "Jan 13, 2016"
                },
                {
                    "avaliacao": 3.5,
                    "texto": "This movie isn't all that great, but seeing VD fighting himself is always worth your time.",
                    "data": "May 28, 2015"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "I see alot of negative reviews and I scratch my head why? Van Damme delivers an exceptional performance with an original plot, you see a new side to his acting in this one! Wish he made more like this! Michael Rooker also surprised me, very aggressive and gritty in this one!",
                    "data": "Nov 24, 2014"
                },
                {
                    "avaliacao": 2.5,
                    "texto": "A solid but unspectacular JCVD film that features an intriguing premise and a few fun fight scenes.",
                    "data": "Jul 3, 2014"
                },
                {
                    "avaliacao": 2.0,
                    "texto": "Very disappointing, script is awful the fight scenes are just ok. Nothing new and quite pointless. \nVan Damme wasn't too bad though.",
                    "data": "Mar 1, 2014"
                },
                {
                    "avaliacao": 1.5,
                    "texto": "*OFFICIAL BETTER THAN EXTREMELY LOUD AND INCREDIBLY CLOSE SEAL*\n\nDumb.",
                    "data": "Jan 29, 2014"
                },
                {
                    "avaliacao": 2.0,
                    "texto": "Back in the early 2000 JCVD was trying a come back on the big sceen after years of dud and cocaine tabloids scandals. Here he portrays two different characters, the good & the bad one two twins one created to arrest the first one. It's quite ok as an action flick but it's nothing breathtaking. JCVD is pretty ok as usual too bad the film isn't trying to be more than just an honest B Movie...",
                    "data": "Jan 14, 2014"
                },
                {
                    "avaliacao": 2.5,
                    "texto": "1/1/2014: not too bad a movie. Some good action and JCVD did a good job acting.",
                    "data": "Jan 1, 2014"
                },
                {
                    "avaliacao": 3.0,
                    "texto": "(54%)\ndecent entry into Van-Damme's strait-to-video movies, with a genuinely good sci-fi premise, as well as decent action sequences that are solidly done, especially given the quite low budget. It may lack a little big budget sheen, but the two leads (Rooker and Van-Damme) give a \"can be bothered\" performance which is something you don't often see in this end of the film industry.",
                    "data": "Sep 18, 2013"
                }
            ]
        }
    ]
}