{
    "filmes": [
        {
            "url": "https://www.imdb.com/title/tt0133093/",
            "titulo": "The Matrix",
            "generos": [
                "Action",
                "Sci-Fi"
            ],
            "data de lançamento nos cinemas": "1999-05-21",
            "data de lançamento em streaming": "",
            "classificacao indicativa": "14",
            "sinopse": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
            "duracao": "PT2H16M",
            "diretor": "Lana Wachowski, Lilly Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Gloria Foster",
                "Joe Pantoliano",
                "Marcus Chong",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Paul Goddard",
                "Robert Taylor",
                "David Aston",
                "Marc Aden Gray",
                "Ada Nicodemou",
                "Deni Gordon",
                "Rowan Witt"
            ],
            "media_crit": "73",
            "reviews_crit": [
                {
                    "avaliacao": 91,
                    "texto": "The Matrix slams you back in your chair, pops open your eyes and leaves your jaw hanging slack in amazement.",
                    "data": ""
                },
                {
                    "avaliacao": 90,
                    "texto": "The Wachowskis do it so playfully well, keeping The Matrix's potentially confusing plot intelligible, intelligent, and suspenseful, that it doesn't matter.",
                    "data": ""
                },
                {
                    "avaliacao": 90,
                    "texto": "Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong. And even if this isn't \"Blade Runner,\" it is very cool shit.",
                    "data": ""
                },
                {
                    "avaliacao": 88,
                    "texto": "Kinetic, atmospheric, visually stunning, and mind-bending.",
                    "data": ""
                },
                {
                    "avaliacao": 80,
                    "texto": "There's a kind of liberating, almost transforming energy in this film; it lights you up and sends you out all giddy with silliness.",
                    "data": ""
                },
                {
                    "avaliacao": 78,
                    "texto": "Doesn't just raise the bar on sci-fi and action films, it rips that sucker off and sends it spiraling into the sun.",
                    "data": ""
                },
                {
                    "avaliacao": 75,
                    "texto": "The plot switches gears every time it threatens to run out of energy, which keeps the show as lively as it is preposterous.",
                    "data": ""
                },
                {
                    "avaliacao": 70,
                    "texto": "Aerves up so much visual wizardry and thought-provoking ideas that even the inevitable Silver touch -- a finale with more bullets than the opening of \"Saving Private Ryan\" -- can't destroy the magic.",
                    "data": ""
                },
                {
                    "avaliacao": 70,
                    "texto": "It may bore you to death or blow your mind -- and it's long and convoluted enough to do both -- but it holds nothing back.",
                    "data": ""
                },
                {
                    "avaliacao": 50,
                    "texto": "There's not much humor to keep it all life-size, and by the final stretch it's become bloated, mechanical, and tiresome.",
                    "data": ""
                }
            ],
            "media_usr": 8.7,
            "reviews_usr": [
                {
                    "avaliacao": "10",
                    "texto": "When this came out, I was living with a roommate. He went out and saw it, came home and said, \"Dude, you have to go see The Matrix.\" So we left and he sat through it a second time. This movie is splendidly done. The mystery about what the Matrix is, unravels and you see a dystopian future unlike any we as a race would want. I have watched this over and over and never tire of it. Everyone does a great job acting in this, the special effects are above par and the story is engaging.",
                    "data": "Oct 31, 2019"
                },
                {
                    "avaliacao": "10",
                    "texto": "The Matrix - 1999This was a real change in filmmaking. Like watching it again in 2020, i.e. after 21 years and it still feels fresh. Iconic scenes are still having benchmarks setting up.If we say it sci-fi at its best, it won't be wrong. The hype was real, it is still not easy to match the level of Matrix where we experience the connection of humans and science, that too with amazing action fight and chase scenes, not just normal scenes they were, multiple exposures, slow motion 3D moves, Oh My God, and it's understandable as well like what are the characters up to and what storyline they are entering into. The script was very well written and executed otherwise it could have been a mess. A special appreciation in managing the theme with those black color costumes and a scientific zone with unimaginable equipment and props doing unbelievable things in the two worlds created. No spoilers, but the action scenes in the climax where the protagonist goes to save someone from agents are really breathtaking. The technology used at its best.A salute to Wachowski Brothers and the team for creating this masterpiece. It will be a great competition and motivation as well for many films coming in the future.",
                    "data": "Sep 30, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Aug 4, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": "This film doesn't age, it will be contemporary even in 2030 or 2040.\nWachowski's best one, by far.",
                    "data": "Jan 3, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "The story of a reluctant Christ-like protagonist set against a baroque, MTV backdrop, The Matrix is the definitive hybrid of technical wizardry and contextual excellence that should be the benchmark for all sci-fi films to come.Hollywood has had some problems combining form and matter in the sci-fi genre.  There have been a lot of visually stunning works but nobody cared about the hero. (Or nobody simply cared about anything.)  There a few, though, which aroused interest and intellect but nobody 'ooh'-ed or 'aah'-ed at the special effects.  With The Matrix, both elements are perfectly en sync.  Not only did we want to cheer on the heroes to victory, we wanted them to bludgeon the opposition.  Not only did we sit in awe as Neo evaded those bullets in limbo-rock fashion, we salivated.But what makes The Matrix several cuts above the rest of the films in its genre is that there are simply no loopholes.  The script, written by the Wachowski brothers is intelligent but carefully not geeky.  The kung-fu sequences were deftly shot -- something even Bruce Lee would've been proud of.  The photography was breathtaking.  (I bet if you had to cut every frame on the reel and had it developed and printed, every single frame would stand on its own.)  And the acting?  Maybe not the best Keanu Reeves but name me an actor who has box-office appeal but could portray the uneasy and vulnerable protagonist, Neo, to a T the way Reeves did.  But, come to think of it, if you pit any actor beside Laurence Fishburne, you're bound to confuse that actor for bad acting.  As Morpheus, Mr. Fishburne is simply wicked!  Shades of his mentor-role in Higher Learning, nobody exudes that aura of quiet intensity than Mr. Fishburne.  His character, battle-scarred but always composed Morpheus, is given an extra dose of mortality (He loves Neo to a fault.) only Mr. Fishburne can flesh out.People will say what they want to say about how good The Matrix is but the bottomline is this: finally there's a philosophical film that has cut through this generation.  My generation. The Wachowski brothers probably scribbled a little P.S. note when they finished the script saying: THINK FOR A MOMENT ABOUT YOUR EXISTENCE.  What is the Matrix, you ask?  Something that's closer to reality than you think.Either that or it's my personal choice for best film of all-time.",
                    "data": "Sep 18, 2000"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 25, 2014"
                },
                {
                    "avaliacao": "10",
                    "texto": "The film is as well crafted as the matrix itself! On another level entirely to any other science fiction film from the last 20 years . Getting lost in another world, is interly what Cinema is made for. This one takes you into a whole new universe interly .",
                    "data": "Feb 22, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": "What if I told you the Matrix is not a Sci-Fi but a Documentary movie?",
                    "data": "Jan 1, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "Writing a review of The Matrix is a very hard thing for me to do because this film means a lot to me and therefore I want to do the film justice by writing a good review. To tell the truth the first time I saw the film I was enamored by the effects. I remember thinking to myself that this was one of the most visually stunning films I had ever seen in my life. Also having always been a comic book fan and a fan of films that were larger than life, the transitional element of the story was very appealing to me and this probably heightened my enjoyment of the film very much. It wasn't until some time later (and after having seen the film a few times more) that I started to think about the film. I recognized the Christian elements quite quickly but it wasn't until I wrote an actual 15-page essay on the film that I tapped into some of the philosophical and religious elements and that made me appreciate the film even more. I won't say that I have recognized all elements because the film is quite literally packed with them.Acting wise the film works excellently. I won't say that there aren't any issues because there are but overall the acting is pretty flawless. Keanu Reeves plays the main character, Neo, or Thomas A. Anderson and while he is not the perfect actor I think he does a pretty good job in The Matrix (and the sequels). He doesn't have the longest of lines which was probably a deliberate choice from the directors and it works because this gives him a better opportunity to work on posture and facial expressions and I must say that overall his body language is very good. Very clear and well defined. Laurence Fishbourne plays Neo's mentor Morpheus and he does an excellent job of it. His lines flow with a certain confidence and style that makes his character somewhat unique and interesting. Carrie-Anne Moss does a good job as well and succeeds in looking both cool and sexy in her leather outfit. Joe Pantoliano, a critically underrated actor does a brilliant job of bringing his character, Cypher, to life. I can't say much about him because his character is pretty essential to the plot and I certainly don't wan't to spoil it for anyone. Gloria Foster appears in a relatively small role that will have greater significance in the following films and she does a very good job. The best acting is provided by Hugo Weaving, however, in his portrayal of Agent Smith. It is really something to watch him act out the changes in his character. Agent Smith gains some human traits like anger, sense of dread, hate and eventually even a sly sense of humor (mostly in the sequels). Two thumbs way up to Weaving who has created one of the finest screen villains of all time.Effects wise the film is simply stunning and it deservedly was awarded the Oscar for best effects (and was regrettably cheated out of a nomination in the Best Film category) ahead of even Star Wars. The reason that I think The Matrix deserves the Oscar for best effects is simply that the effects in The Matrix are more innovative than the ones in Star Wars. Just take a look at how many times the effects have been spoofed and you'll probably agree. The effects also help in the symbolism of the film and in creating a very dystopian atmosphere not unlike the one seen in Blade Runner and this works brilliantly. The film looks beautiful at all times and today 6 years later (my God has it already been 6 years?) the effects still hold their ground against new science fiction films. Add the effects to the brilliant editing and you have a visual masterpiece on your hands. Very well done.The reason that I think The Matrix is more reviewable than pretty much any other film is the story and the philosophical and religious elements of the story because with every viewing I catch something I didn't see the previous time I watched it. Without spoiling the film I think I can mention a few of the more obvious elements. Obviously the film draws on the Messiah myth as Neo is a clear reference to Jesus with the analogy of his name (Neo = one, as in The One) but also hidden in his other name, Thomas A. Anderson. The first part of his last name, Anderson comes from the Greek Andros meaning \"man\" and combine this with the second part of his last name \"son\" and add a little creativity you will come up with the combination \"son of man\" which was a title Jesus came up with about himself. Also the first time we meet Neo a man calls him (and I quote): \"You're my Saviour man. My own personal Jesus Christ.\" It doesn't get any more obvious than that. Aside from the Christianic elements the film also gets its inspiration from Budhism, Gnosticism (Gnosis = knowledge) but is also inspired by Plato and his analogy of the Cave and Jean Baudrillard's essay, Simulacra and Simulations. Explaining these elements would make this review go on forever so aside from mentioning them I will not comment on them further.To all the people who doubt the profound nature of The Matrix I can only give one advice: Free your mind and watch the film again. You won't regret it. If I had to choose a favorite all time film my choice would probably fall on either The Matrix (obviously I don't expect people to agree but if they do thats great) or The Lord of the Rings: The Return of the King and I recommend it to all fans of sci-fi and people who like philosophy.10/10 - on my top 3 of best films.",
                    "data": "Dec 1, 2005"
                },
                {
                    "avaliacao": "9",
                    "texto": "At first, I wasn't interested in seeing the Matrix. But after hardly hearing any bad reviews for it (and believe me, I hear bad reviews for every movie I enjoy) I decided to give it a try. At first, although I really loved the fights, graphics and characters, the plot confused me. (Anyone confused by the plot at all should go to www.knowthematrix.com and you'll find out everything you could want to know) By the second time I watched it, I really understood it, which made the movie even more enjoyable.I really loved this movie. Just about every character, good or bad, is very interesting and cool. The acting was excellent. Even though I think this was Keanu Reeves at his best, the best acting jobs were done by Laurence Fishburne (Morpheus) and Carrie-Anne Moss (Trinity). Hugo Weaving did an excellent job as Agent Smith and Joe Pantoliano was great as Cypher as well.The plot is one of the best movie plots I've seen in a movie. An accountant by day, computer hacker by night guy suddenly finds out that reality as we know it is fake and that we are actually in a giant computer program run by robots (that we created, of course) in order for them to get power. Not only that, but he finds out that he is one who is, according to prophecy, going to put an end to it. The greatest thing is that you learn things just as Neo does, so you can really relate to his character.My favorite thing about this movie is that no matter how many times you watch it, you will learn more about it. I guarantee this. Some may not like this movie because the plot is too complicated, but I recommend that anyone who enjoys movies should go buy this one right away.",
                    "data": "Feb 1, 2000"
                },
                {
                    "avaliacao": null,
                    "texto": "and this is all. because each explanation sounds wrong. sure, the acting,, the plot, the fight/action scenes are great. maybe unique. but the essence, for me, remains the basic idea . a fake reality against the pure truth. and the magic as clothes of each character. because it is more than a film. it is a revolution in the way to see a film and to discover reality. you are Neo. and the mythological mix of symbols and cultural references and the simple story who seems have more and more levels are more than fascinating - it is real. sure, Matrix has a lot of reviews and around it is very easy to say hypothesis, verdicts, opinions or, maybe, critics. it is enough to say it is a masterpiece. or the perfect fascinating fairy tale.",
                    "data": "Jan 7, 2017"
                },
                {
                    "avaliacao": "7",
                    "texto": "Ok, I'm getting sick of comments saying stuff like \"The Matrix is the greatest film EVER MADE!\"That's complete and utter bullturd. Yes, it had great cinematography and effects, yes it had a great soundtrack but NO WAY was the acting superb and NO WAY was the storyline great.Take that storyline and stick it in any other action movie and you would leave feeling disappointed at the end. It's major selling point was \"What is the Matrix? You have to see it for yourself.\" Come on, the only plot twist was that thing to do with Cypher, and that wasn't greatly unforeseeable, there's things like that in every frigging action movie.The thing that set it apart was the ground-breaking camera effects, gnarly special effects and a funky soundtrack, as well as the costume design bit, with all that leather and expensive sunglasses. Without this stuff, all you would be left with is your average action movie.I'm not saying it was a bad film at all, just not one of the greatest. Highly entertaining, great to watch with your mates, definitely one of the most interesting films in recent years. But give me The Third Man, Memento or the Usual Suspects any day.7/10",
                    "data": "Sep 9, 2001"
                },
                {
                    "avaliacao": "5",
                    "texto": null,
                    "data": "Mar 15, 2017"
                },
                {
                    "avaliacao": "10",
                    "texto": "Without a doubt one of the best and most influential movies of all time, the Matrix is the defining science fiction film of the 1990's and the biggest leap the genre has taken since Stanley Kubrick's 2001: A Space Odyssey and Ridley Scott's Blade Runner. The Matrix is a ground-breaking motion picture that not only raised the bar for all the science-fiction films to come after it but also redefined the action genre with its thrilling action sequences and revolutionary visual effects.The film tells the story of Thomas Anderson a computer hacker that in the world of hacking goes by the alias of Neo. When he is contacted by the mysterious outlaw Morpheus and having always questioned his reality, he is awakened to the truth that the world he's been living in is a simulated reality called the Matrix and that he's nothing more than a slave in this dystopian world, created and controlled by A.I powered machines.The direction and script by the Wachowskis is fantastic, as they drew ideas and inspirations from every other great sci-fi and cyberpunk movie and anime before the film, combining it with stunning action and putting it into one picture that has enough style, substance and subtext that everyone ended up giving their own interpretation of the story. The research that went into the preparation of the screenplay is quite extensive but the manner in which it is presented on the big screen is also very impressive. Every character presented on the film, has a well-defined arc and a purpose, and their motivations are clear.The cinematography is impeccable. It was very innovative in the use of the camera angles and movements, the zooms, the slow-motion captures and the different color palette used to differentiate the Matrix and the real World. The editing is flawless, as it makes sure that every scene is integral to the story and ensures the pace of the film stays ferocious through its entire runtime. Each frame is also packed with so much visual information for the viewer to devour. The visual effects introduced us to the bullet-time effect and their impact can still be felt in today's movies. The performances are also incredible. Each member of the cast gave their best performances and brought the characters they portray to life, but the one that stands out the most is Hugo Weaving's disciplined rendition of his character, Agent Smith; a powerful computer program made to search and destroy the human rebellion, in undoubtedly the greatest performance in his career.In conclusion The Matrix is a masterpiece everyone should see. It is one of the most thought provoking, inventive, pioneering, influential and stylish movies of all time and it's also full of philosophical and religious allegories waiting for interpretation. Immortal for its contribution to cinema and pop culture, its brilliant combination of inventive visual effects, excellent vision and exquisite action easily makes it one of the best, most influential and most entertaining movies ever made.",
                    "data": "Apr 10, 2018"
                },
                {
                    "avaliacao": null,
                    "texto": "The Matrix...when I first heard about it, I expected just another sci-fi action thriller.  Good and filled with insane stunts, but not terribly intelligent.Boy, was I wrong.  Oh, the stunts are there in spades, all right, and yes, they are awesome.  And the special effects are absolutely amazing (even if similar ones have been used in other movies as a result- and not explained as well).But the movie has plot as well.  It has characters that I cared about.  From Keanu Reeves' excellent portrayal of Neo, the man trying to come to grips with his own identity, to Lawrence Fishburne's mysterious Morpheus, and even the creepy Agents, everyone does a stellar job of making their characters more than just the usual action \"hero that kicks butt\" and \"cannon fodder\" roles.  I cared about each and every one of the heroes, and hated the villains with a passion.  It has a plot, and it has a meaning...and lo and behold, a plot does help the fight scenes!  Just try it, if you haven't seen the movie before.  Watch one of the fight scenes.  Then watch the whole movie.  There's a big difference in the feeling and excitement of the scenes- sure, they're great as standalones, but the whole thing put together is an experience unlike just about everything else that's come to the theaters.  Think about it next time you're watching one of the more brainless action flicks...think how much better it COULD be.All I can say is WATCH THIS MOVIE.  If you haven't, you're missing out on one of the best films of all time.  It isn't just special effects, folks.",
                    "data": "Mar 2, 2001"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Mar 13, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "This movie is so well written that you can't even prove this movie is wrong about our world. This movie mades you think that our world can be just a reflection, a fake world. It's not just about the war between AI and humanity. It's more about questioning the reality.And years later the idea is never gets old. This is the movie that you should respect if someone says \"I think this is the greatest movie of all time.\" because it has somethings unique, not special it's just unique.It's beyond all the Science-Fiction movies. Normally Sci-Fi movies mades you think \"Can this subject of the movie be real someday?\" and actually only some of them made you think that way. This one mades you think \"I can't deny, this could be our reality. We can never be sure.\"Besides making one of the greatest Fictional Universes, this movie also achieves so much more.And not only that, this movie is also achieves something great in Action. It has the most iconic action scenes. Action director is so great. Revolutionary VFX and SFX, amazing Set Decoration and more.",
                    "data": "Mar 1, 2023"
                },
                {
                    "avaliacao": "10",
                    "texto": "20 years after its release, and several years since I last saw it, some reflections on the experience of rewatching The Matrix. In no particular order ...1) It still look great. I mean, this is one amazing, stylish looking phone. Very little about the look of the film has dated - the mobile phones, obviously, Neo's computer, and very briefly a couple of visual effects creak. But otherwise, this looks as amazing at it did on release. It's sumptuous.2) I think I was one of the many who misjudged Keanu Reeves all those yeas ago. I made easy jokes about his vacant stare and apparent intelligent. From this vantage point we can see he's been in a good number of successful, intelligent films. It's also become clear that within the industry he as a reputation as decent, hardworking man who is a pleasure to work with.3) It's apparent again how literate and cine-literate the film is. I knew this 20 years ago, but since then I've seen a lot more films and read a lot more books, and this time around I especially loved the way the film nods its head to other film genres and influences. I noticed a lot of Peckinpah, and did I see a nod to Kurosawa there too? And I was reminded that for an English Literature graduate like me, this is a goldmine of quotes, allusions and references.4) Seen 20 years on, its influence on cinema since is clear. There's a lot we could talk about here, but I was especially struck by how indebted a director like Christopher Nolan is (keeper of the flame of intelligent blockbusters), especially with Inception.5) I'd forgotten that the narrative ostensibly maintains uncertainty about Neo's identity until just before the end. I'm not sure this really works - anyone who's read many books or ever done an anagram will not find that the most suspenseful part of the narrative.6) Despite a run time of 2 and a quarter hours, it never flags and attention never wonders. The film fizzes with kinetic energy and the time flies by. It's a lean film, without a wasted moment.7) The film is, of course, packed with religious allusions. When I wrote a chapter on this for my BA Theology dissertation, I said I thought the film was neo-Bhuddist (forgive the pun, please), and I stand by that on rewatching. Of course, there's lots of allusions to Christian and other theology, and The Matrix spawned some really bad reading of film by Christians which has never really stopped. When will some Christians learn to read a film/book etc with integrity and understanding of what the film is trying to do? It's a spiritually confused mish-mash of a film - but still a gloriously entertaining one.8) All these years later, it turns out The Matrix was somewhat prophetic about the role technology would play in our lives. Humans permanently plugged in to networks? Different layers of reality that are somehow more real than what we think of as real? The Wachowskis saw all that and more coming 20 years ago. Artists are the weather vane of society; we really should learn to pay attention to them.9) Bottom line. I still bloody love this film. I'm trying to work out if I have the requisite strength to revisit the sequels....",
                    "data": "Feb 21, 2019"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 29, 2015"
                },
                {
                    "avaliacao": "10",
                    "texto": "The Wachowski brothers really did excel themselves with this movie. It's a brilliant movie on a number of different levels - the directing is excellent, the camera work is great, the visuals are stunning, the kung-fu is A+, acting is executed with style and conviction, and the plot is truly inspired. It's really hard to use enough superlatives on this movie!It'd be a 10/10, except for the ending. Having Neo do what he does at the end really lets it down, in my opinion. However, there's a couple of sequels on the way, so let's see what the Wachowskis can do to make up for it.Other than that, (and like I said above) the movie is operating on so many different levels that each time you watch it, you pick up something new... this isn't by accident, either. The Wachowski brothers had the actors read a number of definitive works (Simulation & Simulcra was one I believe) in modern literature and psychology, and applied liberal dashings of aspects of the major religions to provide the best sci-fi movie of the decade, if not ever.I'm yet to meet somebody who hasn't enjoyed it. It's my favourite movie to watch on a good cinema system, too.",
                    "data": "Apr 22, 2002"
                },
                {
                    "avaliacao": "9",
                    "texto": "'The Matrix' may not be one of the very greatest examples of its genre (like '2001', 'Metropolis', 'Blade Runner', 'Back to the Future', 'Star Wars Original Trilogy', 'Alien' and 'Aliens'), but that it is revolutionary in how its visuals and use of sound broke boundaries like had never been done before cannot be denied.It is not a film to be seen if people want character depth or relationship depth, with the forced and underdeveloped love subplot between Neo and Trinity being 'The Matrix's' sole weak spot. This ended up not being that huge a problem for me because everything else is so well executed.Particularly striking about 'The Matrix' is its production values. Simply put, the film looks amazing in its audacious production design, dazzling special effects that are some of the most ultra-cool and imaginative to exist, super slick editing and often jaw dropping cinematography. So much more than a film with ground-breaking special effects and use of camera work that broke boundaries.Use of sound was also striking, and how the pulsating and hypnotic music score was used. Andy and Larry Wachowski direct adeptly, while the script is an intelligent mix of complex and well-explored themes, mysticism, philosophy and even Lewis Carroll and the story is often invigorating and intensely taut with a smart concept brilliantly done.Action is superbly shot and edited, and the way it is choreographed is relentlessly intense and breathless in its energy, Kung Fu has rarely been more vertigo-inducing (despite how this sounds, this is not a bad thing as it added hugely to the intensity and paranoia of the story's atmosphere) on film.Keanu Reeves is in one of his best and most iconic roles and has never looked cooler, certainly has not looked this comfortable for a while before then. Carrie Anne Moss is strong. Even better are an imposingly charismatic Laurence Fishburne (also in one of his best roles), an amusing Joe Pantoliano and a deliciously wicked Hugo Weaving.Summing up, not one of the best of the genre but a mile-stone nonetheless and a great one. Followed by two sequels, both nowhere near in the same ball-park. 9/10 Bethany Cox",
                    "data": "Feb 19, 2017"
                },
                {
                    "avaliacao": "10",
                    "texto": "Truly a masterpiece in every way! If it wasn't for Fight Club this would my favorite; I've been on the fence about it. The Matrix along with They Live have the best metaphors about life/society, most of which a lot of the population aren't woke to!For example the entire speech Morpheus says \"The Matrix is everywhere. It is all around us. Even now, in this very room. You can see it when you look out your window or when you turn on your television. You can feel it when you go to work... when you go to church... when you pay your taxes. It is the world that has been pulled over your eyes to blind you from the truth. That you are a slave, Like everyone else you were born into bondage. Into a prison that you cannot taste or see or touch. A prison for your mind.\" Among other brilliant quotes like when he talks about what the world has become, then mentions we have become this referring to a battery. So many genius lines I could list that I won't.The effects, stunts, lighting, sounds, and tone are outstandingly spot on! They really did train for the fight sequences for months I've seen all the special features plus more. Yes this is a sci-fi film, but I see it as a documentary as well. We're all slaves that take the blue pill throughout many things it's just hard to realize that. I also love what someone else said, it's a benchmark for sci-fi to come, that is very true and it's the last of its kind; movies aren't made like this anymore!A lot of people worked hard to make this film what it is. I respect that; I've always wanted to work on film just haven't had a way for many reasons. If you've read this far or even at all thanks and sorry! I usually don't leave a review this long, just thought it was worth it for this one. Check out my others if you're interested for now 10 out of 10 phenomenal movie in many ways!",
                    "data": "Mar 30, 2019"
                },
                {
                    "avaliacao": "6",
                    "texto": null,
                    "data": "May 29, 2017"
                },
                {
                    "avaliacao": "4",
                    "texto": "OK- don't get me wrong this was a groundbreaking movie. However I have some serious problems with it.First the good. The action scenes and special effects are awesome. They really did set new standards and knocked that hackneyed load of tripe The Phantom menace into the bin. The ending is also fantastic- there is no way that an ending this perfect was meant to be followed by two mediocre sequelsHowever, The plot is more full of holes than a fishnet stocking. For instance- I know this is nit picking- but how can Cypher be betraying the crew when not only do they have to plug him into the matrix for him to go and meet the agents in the first instance, but are also monitoring said conversation.Secondly- the philosophical parts. The matrix basically asks the question is it better to live the dream. The flaw comes in that in this case it is quite clearly better- great, so mankind is not \"free\" but each person lives a sufficiently realistic existence inside their own head for it not to matter. If the alternative is living in fear and squalor, dodging sentinels whilst eating what looks like congealed semen then I would frankly rather live inside my own dreams dining on fine food etc.Next up, the acting. Could someone please explain to me how Keanu Reeves is a leading man. He single handedly trashes all the good work put in by the supporting cast- especially Laurence Fishburne and Hugo Weaving. Anyway how can I be expected to take a film seriously where Keanu is effectively god?Overall, a reasonable film but not the second coming of Christ so many people think it is.",
                    "data": "Feb 22, 2004"
                },
                {
                    "avaliacao": null,
                    "texto": "The first 45 minutes of this film had me very excited. It is so rare that I will go to the theater and be presented with something which is both original and intelligent. It managed to hang in there throughout, though the ending was too formulaic. In addition, the voice-over at the very end reminded me of the final scene in Saving Private Ryan. It almost ruins a fantastic film.The only other objection I can come up with is that the you must know, you must be type philosophy being handed out was just a tad hokey. I must pleasantly admit though, since I don't get to admit this very often, that The Matrix is worth seeing despite these things.The visuals are extremely impressive, particularly the \"white room,\" the baby harvester, the training scene with the \"red woman,\" the Reeves interrogation scene... I have to agree with some of the previous comments that the plot idea won't seem overly original to a fan of Philip K Dick, but then what is original after you've read him? The Matrix has more original things to say than two months worth of standard Hollywood fare. I have a great deal of respect for a film which will have someone say \"they're turning humans into this\" and hold up a battery. A plot which looks at man as machine will get a thumbs up from me just for trying.I feel some hope for the future of movie-making in America to be able to recommend this film.",
                    "data": "Apr 1, 1999"
                }
            ],
            "plataforms": [
                {
                    "plat_name": "Prime Video",
                    "url": "https://www.primevideo.com/detail/amzn1.dv.gti.dea9f6b7-e0a0-38c9-7467-d6079c6fb4f0"
                },
                {
                    "plat_name": "HBO Max",
                    "url": "https://play.max.com/video/watch/9fb854be-3d3c-44d8-a7c0-d3122b989be8"
                },
                {
                    "plat_name": "Prime Video",
                    "url": "https://www.primevideo.com/detail/amzn1.dv.gti.dea9f6b7-e0a0-38c9-7467-d6079c6fb4f0"
                }
            ]
        },
        {
            "url": "https://www.imdb.com/title/tt1375666/",
            "titulo": "Inception",
            "generos": [
                "Action",
                "Adventure",
                "Sci-Fi"
            ],
            "data de lançamento nos cinemas": "2010-08-06",
            "data de lançamento em streaming": "",
            "classificacao indicativa": "14",
            "sinopse": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.",
            "duracao": "PT2H28M",
            "diretor": "",
            "cast": [
                "Leonardo DiCaprio",
                "Joseph Gordon-Levitt",
                "Elliot Page",
                "Tom Hardy",
                "Ken Watanabe",
                "Dileep Rao",
                "Cillian Murphy",
                "Tom Berenger",
                "Marion Cotillard",
                "Pete Postlethwaite",
                "Michael Caine",
                "Lukas Haas",
                "Tai-Li Lee",
                "Claire Geare",
                "Magnus Nolan",
                "Taylor Geare",
                "Johnathan Geare",
                "Tohoru Masamune"
            ],
            "media_crit": "74",
            "reviews_crit": [
                {
                    "avaliacao": 100,
                    "texto": "In terms of sheer originality, ambition and achievement, Inception is the movie of the summer, the movie of the year and the movie of our dreams.",
                    "data": ""
                },
                {
                    "avaliacao": 100,
                    "texto": "If Inception is a metaphysical puzzle, it's also a metaphorical one: It's hard not to draw connections between Cobb's dream-weaving and Nolan's filmmaking -- an activity devoted to constructing a simulacrum of reality, intended to seduce us, mess with our heads and leave a lasting impression. Mission accomplished.",
                    "data": ""
                },
                {
                    "avaliacao": 100,
                    "texto": "With physics-defying, thunderous action, heart-wringing emotion and an astonishing performance from DiCaprio, Nolan delivers another true original: welcome to an undiscovered country.",
                    "data": ""
                },
                {
                    "avaliacao": 90,
                    "texto": "In a summer of remakes, reboots and sequels comes Inception, easily the most original movie idea in ages.",
                    "data": ""
                },
                {
                    "avaliacao": 88,
                    "texto": "In this wildly ingen­ious chess game, grandmaster Nolan plants ideas in our heads that disturb and dazzle. The result is a knockout. But be warned: Inception dreams big. How cool is that?",
                    "data": ""
                },
                {
                    "avaliacao": 83,
                    "texto": "As engrossing and logic-resistant as the state of dreaming it seeks to replicate, Christopher Nolan's audacious new creation demands further study to fully absorb the multiple, simultaneous stories Nolan finagles into one narrative experience.",
                    "data": ""
                },
                {
                    "avaliacao": 80,
                    "texto": "Inception, though, is no \"Avatar\"--instead, it’s the movie that many wanted \"Avatar\" to be. In a roaringly fast first hour, we’re introduced to a new technology that allows for the bodily invasion of another person’s dreamworld.",
                    "data": ""
                },
                {
                    "avaliacao": 75,
                    "texto": "Inception is an elegant, portentous ride, though I’m not sure Nolan is any closer to visualizing the real (dream) deal than Hitchcock was.",
                    "data": ""
                },
                {
                    "avaliacao": 40,
                    "texto": "Inception manages to be clunky and confusing on four separate levels of reality.",
                    "data": ""
                },
                {
                    "avaliacao": 30,
                    "texto": "It's obvious that Nolan either can't articulate or doesn't believe in a distinction between living feelings and dreams--and his barren Inception doesn't capture much of either.",
                    "data": ""
                }
            ],
            "media_usr": 8.8,
            "reviews_usr": [
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Feb 28, 2019"
                },
                {
                    "avaliacao": "10",
                    "texto": "Few films leave you genuinely questioning whether you truly understood them quite like Inception does. The cast is outstanding, the story itself feels like a puzzle you can't stop trying to solve, and the music subtly pulls you deeper without overpowering the experience. All of this has drawn me back to watch the movie at least five times over the years - and I know I'm not done yet.I've always admired Leonardo DiCaprio, and in this film, it feels like he poured everything he had into the role. All that's left for me now is to keep hoping that someday, we'll get a second part.So, keep dreaming....",
                    "data": "Jun 30, 2025"
                },
                {
                    "avaliacao": "9",
                    "texto": null,
                    "data": "Aug 21, 2010"
                },
                {
                    "avaliacao": "10",
                    "texto": "You only get to watch this for the first time once, so choose your state of mind carefully.\nIt is a film about movies and dreams and reality, and what sort of life it is best to find when you leave the cinema and return to whatever you left to enter.\nIt is spectacular, and brutal, and enigmatic and disturbing.\nIt is beautiful and absorbing.\nIt is about one of my favourite characters ever to grace the screen.\nI don't see it often, in case it's not as good as I like to remember it.\nThat is my secret, that I lock away in my safe in the basement.\nThat somewhere there is a perfect world for us all.\nFor some, perhaps it is in the cinema watching this.",
                    "data": "Dec 21, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": "When you wake up from a good dream, you feel the reality is harsh. When you wake up after a bad dream, you will be sentimentally attached to the beauty of reality. But as long as life is good, reality and dreams don't matter.",
                    "data": "Aug 8, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": "The 20th Century had Casablanca, Star Wars, the Godfather, Blade Runner, and others - this is the first of the 21st Century masterpieces. Truly in awe at how amazing this movie is, an astounding show of all aspects of films. Amazing story and cinematography accompanied with actors worthy of telling the tale. Remarkable and breathtaking.",
                    "data": "Nov 14, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 9, 2010"
                },
                {
                    "avaliacao": "7",
                    "texto": "There is no doubt that Nolan is a very talented director, and I like a lot of his films, but sadly I think like a number of other hugely successful directors before him (Peter Jackson springs to mind) his success has led to a detrimental degree of freedom for him to churn out his own poorly-written scripts unchecked, and make films that are about an hour longer than they need to be.I know I'm swimming against the tide of public opinion here, but while I was hugely excited about seeing Inception back when it came out, I was absolutely crushed on first viewing. I found it terribly written (the film begins with enough exposition scenes to fill a normal film's running time!), incomprehensible (editing was all over the place, action dull and repetitive), visually disappointing (all the best bits were revealed in the trailer and were all contained in the exposition scenes rather than having anything to do with the story) and with a concept that just didn't hold water (the dream sequences seemed to always resemble Matrix out-takes and were held together by a logic that just wasn't very dream-like)!Perhaps if Nolan had a studio breathing down his neck and someone to revise his shaky script this could have turned out well, but after the success of TDK he can effectively write his own ticket and is (sadly) free to churn out this kind of lazy and self-indulgent snooze-fest. The same thing happened with Peter Jackson after LOTR with King Kong (an hour too long, too much freedom etc.)Hans Zimmer's incredible score was about the only positive I took out of Inception (Zimmer's brilliant scores are increasingly the glue that holds Nolan's films together and makes them seem better than they are). Despite his obvious talents and love of film (I love him for shooting Batman stuff in IMAX 70mm!) Nolan has some very bad habits (mainly relying on his and his brother's writing) which I think really hamper his films these days. I loved TDK, but it frustrates me in almost equal measure, and though I haven't seen The Dark Knight Rises yet, I will go in with very low expectations based on his apparently dwindling form.",
                    "data": "Jul 25, 2012"
                },
                {
                    "avaliacao": "4",
                    "texto": null,
                    "data": "Jun 13, 2013"
                },
                {
                    "avaliacao": "10",
                    "texto": "When I first watch this movie, I was just shocked with it's twist. I'm not gonna mention details, because can't share any spoilers.Simply this movie makes a complex story, that makes you question so many things. \"Why he is keeping her in his dreams?\" or whatever your question is answering with some well written line. That scene is the key to the whole movie. That line between Cobb and Mal answers all your questions at once.That's why I like this movie so much. Some movies has that potential. Making a complex story that someone could answer with only one sentence. You're waiting for that line for whole content. But most of the contents (I mean movie or TV Series) are not managing that well.Besides the greatness of the storyline this movie has a really great cast. So Acting Performances are also great. Award Winning Cinematography by Wally Pfister was too great. Original Scores by Hans Zimmer was brilliant. Visual Effects are unique. So not only the Screenplay but nearly all the technical details are great.",
                    "data": "Mar 1, 2023"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Feb 7, 2020"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 14, 2010"
                },
                {
                    "avaliacao": "10",
                    "texto": "Inception is my number one favorite movie off my twelve years on earth! It's absolutely impossible to explain the incredible that Inception has. Inception is Sooooooooo dang exciting, edge of seat, mind blower, and I wish there were more movies like it and more Christopher Nolans out there. Congratulations to the well deserved best director, writer, and producer of films (in my opinion). Also the acting is fabulous, everyone did an amazing job, and Leonardo was fabulous at explaining the dream concept. Also the CGI and effects are amazing. Go watch Inception because it is incredibly amazing in every aspect, and is my number one film of my twelve years on earth. Bravo to the Inception crew and wow at this fabulous movie!",
                    "data": "Jun 3, 2021"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 12, 2010"
                },
                {
                    "avaliacao": "9",
                    "texto": "Inception is a beautiful piece of film that has impacted a large part of the film industry. With everything from the actors to the cinematography to the music, this movie without any elaboration perfected almost everything there is.Inceptions slow start is the only weak point of this movie. It begins intensely to then slows down for the next 20 - 30 minutes. While then finishing off as an impeccable film. Nevertheless, this is what brings the film down for me.The director Christopher Nolan managed to create a masterpiece with little to no mistakes. At no point during this intensely long movie did I feel bored. Instead, I was always excited and on my toes intrigued.The acting in this movie was phenomenal. A small number of great actors that all had their character arc while also doing incredible performances. It is truly beyond me how Dicaprio didn't win an Oscar for his performance.Meanwhile, also employing the greatest composer in history with Hans Zimmer, the music adds significantly. The music adds an extreme amount of excitement and keeps you constantly interested. Few composers can make you notice the music, but Zimmer succeeds per usual.To finish of the film was astonishingly shot. With beautiful eye-catching scenes. While also containing some incredible action scenes that might be some of the best action I've seen. With a thought-provoking storyline that finishes of with an unbelievable ending.I highly recommend Inception to everyone and I promise you won't be disappointed.",
                    "data": "Nov 22, 2021"
                },
                {
                    "avaliacao": "6",
                    "texto": null,
                    "data": "Jul 19, 2010"
                },
                {
                    "avaliacao": "5",
                    "texto": null,
                    "data": "Jun 20, 2012"
                },
                {
                    "avaliacao": "10",
                    "texto": "Inception is truly one of a kind. A concept which has long gestated in Christopher Nolan's mind, his eye for drama mixed with his large scale sensibilities ring true in Blockbuster season making Inception a true original in the sea of reboots, remakes and sequels.To try and explain Inceptions many plot twists and incredibly intelligent arcs, would be a foolish task. As Nolan himself has been reluctant to. The best way to approach the film would be with an open mind, if you are prepared to be taken on a ride of a lifetime, then trust that you 100% will. If Avatar was a seminal film in technology (although coming out as a rather poor film, in my opinion), then Inception is seminal in it's storytelling. With a 148 minute running time, you would expect a lot to take place, but what you wouldn't expect is the pace of it all. I did not think at one time in the film about how long was left. I was simply blown away by the depth in every single part of the film. If my enthusiasm for the storytelling aspect of the film has left you worried about the spectacle, then don't worry. They are, as hinted in the trailer, incredible, looking real and unbelievable simultaneously. The most pleasing thing about the action set pieces, is that they are genuinely used to illustrate the story, rather than to blow stuff up a la Michael Bay.With this complex movie in it's high concept, a stellar cast is needed. And Nolan as always, delivers with just that. This is vintage DiCaprio, perhaps only equalled in The Aviator, which is even more impressive as his role as Cobb in Inception is not a showy one, needing DiCaprio to be the constant at the centre of the film. And he pulls off Cobb's emotional contradictions sublimely. The rest of the cast members all shine in parts of the films, Cillian Murphy shows off his usually non-existent tender side, Gordon-Levitt bottles his usual charm for his confidently reserved turn as the reliable Arthur, Watanabe is devilish as the seemingly ambiguous Saito, Page shows why she's the next big female star and Tom Hardy revels in being the comic relief of the film compared to his recent turns as decidedly psychopathic characters.Overall, Nolan has indeed surpassed himself. He has created a world as expansive as his Gotham, a plot dwarfing the intricacies of Memento and one which blows The Prestige's cinematic reveal out of the water. This is truly unmissable cinema. Revel in it, we've still got to wait a whole two years before Batman 3.",
                    "data": "Jul 12, 2010"
                },
                {
                    "avaliacao": "10",
                    "texto": "I saw Memento very recently, something that turned out to be a great miss.I saw it again, just to make a couple of thins straight-and i'll definitely do the same with Inception.Christopher Nolan keeps improving himself, with even more complex and multilayer script like this.And i thought Memento was hard to reach by most of the viewers, but no.Inception will keep you mesmerized and captivated by the genius, that's hidden behind it.And not just directors and screenwriters (or with other words-Nolan), but with acting and sound-and effects and editing as well.When you have a cast like this-i mean Leonardo DiCaprio, Joseph Gordon-Lewitt, Michael Caine, or Marion Cotillard (a personal favourite), the movie just keeps going flawlessly.Most of the crew is the same the Nolan brothers worked with on TDK and earlier in Batman Begins.So the Oscar noms in those categories are a certainty for me.The only thing one could have against the movie, is the headache one could have.See, most of my friends go to the movies for brainless action, they enjoyed Iron Man 2 and The A-Team, but this movie-you have to see it at least twice, to understand it.The levels and the layers on which thing are happening are so many, that one surely'll miss something vital.This is a reason for not fitting to the mass audience, but i hope that won't happen, because Nolan is one of my favourite directors/writers, and he showed, that the brainless action flicks aren't all of it.There are still movies like Inception out there and still people like the Nolans to make those movies, so it's not all lost.And i hope this movie could show the audience that the story is still important for the experience one could receive, not the endless, constant explosions.Because this is really a one of a lifetime event.Saying that, i must say, that in a world full of remakes, reboots, sequels, prequels and God knows what, this is a unique chance to see something different and unmatched so far-a strong movie, that, surely will be Nolan's latest masterpiece! My Grade won't change-it's the same for all Nolan movies-sheer 10!",
                    "data": "Jul 8, 2010"
                },
                {
                    "avaliacao": "10",
                    "texto": "I had the privilege of seeing this movie before it came out, and, like most of DiCaprio's films, it blew me away.Inception is a well-made movie, filmed in about 6 locations all over the world. The directing was outstanding, there were only about two moments, maybe three seconds in total, where i noticed that visual effects were being used (of course defying gravity is pretty difficult).The plot was very pleasingly intricate, with a twist-and-turn, keep-you-on-the-edge-of-your-seat type feel. I noticed that this film had similarities with DiCaprios thriller Shutter Island (which i also enjoyed very much)seeing as it left you wondering what was real and what was not. It's great to see a movie with a thick and emotional plot and not just grenade-throwing action heroes who achieve greatness in the end.Inception also has a very well-composed score, which to me was the finishing touch to a perfect movie. If you're thinking about seeing Inception, definitely go! Even though i was fortunate enough to see a free show, it is worth every penny you pay.Truly unique, like nothing i've ever seen before. Christopher Nolan certainly covered new ground with this film and wasn't afraid to leave us hanging with a spectacular ending.",
                    "data": "Jul 11, 2010"
                },
                {
                    "avaliacao": "9",
                    "texto": "There are those who seek to dive into your mind, take your secrets and whatever else they find, espionage, conspiracy, infiltration, skulduggery, through worlds that are all conjured, well designed. They've been asked to plant a seed, start an idea, change the course of an industrialists career, but it needs dreams within deep dreams, an architect to build the schemes, and the consequences, could be quite severe.Imaginative beyond words, elegantly crafted and constructed, presented and performed by legends of the screen with a great storyline that keeps the viewer constantly engaged and on the edge of their seat - what more do you want out of movies.",
                    "data": "Mar 30, 2023"
                },
                {
                    "avaliacao": "10",
                    "texto": "Usually I try to be careful with over hyping a film, or setting the expectations too high, as film geeks all are guilty for, however for Christopher Nolan's Inception, this really is not possible.This is possibly one of the only perfect films I have ever seen. It is absolutely confident in every way, something which is extremely refreshing, even more so than Avatar. Christopher Nolan gets some slack for making great to look at but ultimately heartless affairs, which I for one do not agree with, however I do not think anyone can argue that here. The emotional aspect of this film not only ties it all together but is really the centre of this film, it is the focus.I do not want to over simplify the film, by simply calling it Kubrick doing Bond, or Gondry on a huge budget, because I am sure it will be called that but it is far more than that, it is something I do not think Kubrick could have ever made. It is pure Nolan, and pure greatness.I hate writing something which is pure fan-boy gushing, but its really difficult here. I did not find a thing I did not like about it, I am sure if maybe I saw it a second time, maybe I would find something about it I didn't like, but not the first time. The way it is cut, means that there is always action on screen, if not, then the visuals are interesting enough to keep your eyes glued.The final hour of the film, is possibly one of the most complicated action sequences put on film. You have to constantly be paying attention to remember all of the layers of what is happening. Without spoiling anything, all I have to say is that is what this film is about, that is what makes this film so great, layers. Once you have seen this you will now what I am talking about.All of the actors are fantastic too, Di Caprio is the stand out here. Yes, this is probably due to the fact he is the star and given all of the emotional weight, but he handles it perfectly, similarly to his performance in Shutter Island. Ellen Page, whom I usually hate, gives a great performance here. Tom Hardy gives a break out performance here, he is quite the bad ass.I hope audiences are ready for a film like this, a pure auteur driven film which does not sacrifice a single frame for the studio. I would hope this film will change Hollywood, as it is 100 percent the directors vision yet it is definitely a marketable film, much like District 9, yet I do not think it will.I cannot recommend this film anymore than I have, I just have to say everyone and anyone should see it. Sorry about all the gushing, it is just so hard not too.If you liked this review check out my new film blog: http://thedeletedscene.wordpress.com",
                    "data": "Jul 11, 2010"
                },
                {
                    "avaliacao": "10",
                    "texto": null,
                    "data": "Jul 11, 2010"
                },
                {
                    "avaliacao": "8",
                    "texto": "I'm nearly at a loss for words. Just when you thought Christopher Nolan couldn't follow up to \"The Dark Knight\", he does it again, delivering another masterpiece, one with so much power and rich themes that has been lost from the box office for several years. Questioning illusions vs reality usually makes the film weird, but Nolan grips your attention like an iron claw that you just can't help watching and wondering what will happen next. That is a real powerful skill a director has. No wonder Warner Bros. put their trust in him, he is THAT good of a director, and over-hyping a Christopher Nolan film, no matter what the film is about, is always an understatement instead of an overestimate like MANY films before.Not since the eras of Stanley Kubrick, Andrei Tarkovsky and Alfred Hitchcock has there been a more brilliant director than Christopher Nolan. He is, undoubtedly, one of THE most brilliant and gifted Hollywood filmmakers in history. Filmmakers like him come but just once in a lifetime. He has the ability to seduce our eyes, ears and most importantly, mind, and then delivers what he intends to deliver in full blast. Rarely have blockbusters have the gall to deliver such amounts imagination and intelligence at the same time. And yes, it is similar to the excellent anime film \"Paprika\" in the whole \"invading dreams\" plot, but the similarities end there as Nolan brings the film to a whole different level.Visuals and intelligence rarely come together in movies at the same time, it's either all-visuals-no-smarts (\"G.I. Joe\", \"Transformers\") or the exact opposite (\"Doubt\", \"Invictus\"). In this film the excellently directed action sequences combined with immensely groundbreaking and jaw-dropping visual effects are combined smoothly with a heavy dose of intelligence and believability.Although having an ensemble cast and financed by a Hollywood giant studio (Warner Bros), this film is a very personal film for Nolan, he wrote the film as well as directing it, and as you watch the film you get many glimpses of Nolan's perplexing, increasingly imaginative thoughts and dreams in the dialog that he writes and the plot that he sets up. Ideas have never felt more interesting and put to good use than in this film. This film is NOT for the popcorn muncher, rather it is a film for thinkers. Honestly I can't explain the plot for fear of spoiling the movie for you readers. Even the slightest hint will ruin the experience. The viewer will walk out of the cinema feeling dazed, confused and ultimately breathless. It's like a puzzle, both physically and mentally, and you have to pay attention throughout the film for the clues. However Nolan controls the spectacle of the film and is careful not to let it overwhelm the film's humanity, and this is where \"Inception\" shines. It is a very deep film that will have one thinking and asking questions for years to come. That's right, years.Once the film ends, you'll want to watch it again, for there's something new every time. This is a film that requires multiple viewing for someone to truly comprehend the film's ambiguous themes, and will be discussed by many in the future. This is an original film, no adaptation, no sequel/prequel, no remake/reboot, which is extremely refreshing having gone nearly three years of mostly unremarkable visual effects roadshows (\"Avatar\" be damned).Of course, a film is not complete without the actors. Leo DiCaprio delivers an Oscar worthy performance, similar but better than his previous effort \"Shutter Island\". He shows glimpses of a flawed, grim, fragile man, who has knowledge about everything else but yet can't seem to come in grips with himself and his demons. Joseph Gordon-Levitt, Ellen Page, Tom Hardy, Ken Watanabe, Dileep Rao, Cillian Murphy, Tom Berenger, Michael Caine, Marion Cottilard, Pete Postlethwaite, Lukas Haas... Nolan really brings out the best in this unusual yet extremely talented group of supporting actors who make their roles their own.Nolan is of course, a master behind the camera, a real virtuoso when it comes to film. His direction is taut, focused, gripping, and extraordinarily fascinating. The detailed and complex original script is no surprise from Nolan, considering the fact that he turned Batman the superhero into pop-culture art two years ago (\"The Dark Knight\"). The action sequences are unique, exciting and fresh, something absent from the cinema which has since been interested at things popping towards the screen and stuff blowing up every two milliseconds. The visual effects are awesome and imaginative, and best of all they do not bring down the movie's quality one bit, rather it makes the movie more fascinating to watch. The cinematography is absolutely, beautifully shot, so we can see the action and emotion in all their glory. Production design is top notch, with terrific design of sets and locations. Hans Zimmer's complementing music score is simply outstanding, and knowing the man, that's really all I have to say. Together all of these elements combine to deliver a mesmerizing movie experience like no other this year.Christopher Nolan has once again outdone himself. He truly is a gifted filmmaker, arguably the most imaginative in Hollywood today. And \"Inception\" can proudly stand alongside \"Blade Runner\" and \"2001: A Space Odyssey\" as science-fiction masterpieces that push the boundaries for movie making and become a different experience altogether.There are two types of films: the crowd-pleasing blockbuster and the intelligent indie/art film. Nolan has combined two of these tropes together into one exceptionally brilliant package, pulling off that rare, now nearly-extinct Movie Magic that has since been wiped off the planet by sequelitis and reboots. Movie of Summer 2010? Movie of 2010? Heck this is possibly the first masterpiece of the decade! Nolan is a genius and I applaud him for treating his audiences as intelligent people.Missing this film and not getting the film's point is a crime.Overall value: 9/10 (Excellent)",
                    "data": "Jul 14, 2010"
                },
                {
                    "avaliacao": "4",
                    "texto": null,
                    "data": "Jan 25, 2011"
                }
            ],
            "plataforms": [
                {
                    "plat_name": "HBO Max",
                    "url": "https://play.max.com/video/watch/aaf706ec-46a1-4453-bb69-293452009004"
                },
                {
                    "plat_name": "Prime Video",
                    "url": "https://www.primevideo.com/detail/amzn1.dv.gti.a56a434f-4511-4e0a-88b9-72c2194f53cf"
                }
            ]
        }
    ]
}