{
    "filmes": [
        {
            "url": "https://www.imdb.com/title/tt0133093/",
            "titulo": "The Matrix",
            "generos": [
                "Action",
                "Sci-Fi"
            ],
            "data de lançamento nos cinemas": "1999-03-31",
            "classificacao indicativa": "R",
            "sinopse": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
            "duracao": "02:16:00",
            "diretor": "Lana Wachowski, Lilly Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Gloria Foster",
                "Joe Pantoliano",
                "Marcus Chong",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Paul Goddard",
                "Robert Taylor",
                "David Aston",
                "Marc Aden Gray",
                "Ada Nicodemou",
                "Deni Gordon",
                "Rowan Witt"
            ],
            "media_crit": 7.3,
            "reviews_crit": [
                {
                    "avaliacao": 9.1,
                    "texto": "The Matrix slams you back in your chair, pops open your eyes and leaves your jaw hanging slack in amazement.",
                    "data": null
                },
                {
                    "avaliacao": 9.0,
                    "texto": "The Wachowskis do it so playfully well, keeping The Matrix's potentially confusing plot intelligible, intelligent, and suspenseful, that it doesn't matter.",
                    "data": null
                },
                {
                    "avaliacao": 9.0,
                    "texto": "Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong. And even if this isn't \"Blade Runner,\" it is very cool shit.",
                    "data": null
                },
                {
                    "avaliacao": 8.8,
                    "texto": "Kinetic, atmospheric, visually stunning, and mind-bending.",
                    "data": null
                },
                {
                    "avaliacao": 8.0,
                    "texto": "There's a kind of liberating, almost transforming energy in this film; it lights you up and sends you out all giddy with silliness.",
                    "data": null
                },
                {
                    "avaliacao": 7.8,
                    "texto": "Doesn't just raise the bar on sci-fi and action films, it rips that sucker off and sends it spiraling into the sun.",
                    "data": null
                },
                {
                    "avaliacao": 7.5,
                    "texto": "The plot switches gears every time it threatens to run out of energy, which keeps the show as lively as it is preposterous.",
                    "data": null
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Aerves up so much visual wizardry and thought-provoking ideas that even the inevitable Silver touch -- a finale with more bullets than the opening of \"Saving Private Ryan\" -- can't destroy the magic.",
                    "data": null
                },
                {
                    "avaliacao": 7.0,
                    "texto": "It may bore you to death or blow your mind -- and it's long and convoluted enough to do both -- but it holds nothing back.",
                    "data": null
                },
                {
                    "avaliacao": 5.0,
                    "texto": "There's not much humor to keep it all life-size, and by the final stretch it's become bloated, mechanical, and tiresome.",
                    "data": null
                }
            ],
            "media_usr": 8.7,
            "reviews_usr": [
                {
                    "avaliacao": 10.0,
                    "texto": "When this came out, I was living with a roommate. He went out and saw it, came home and said, \"Dude, you have to go see The Matrix.\" So we left and he sat through it a second time. This movie is splendidly done. The mystery about what the Matrix is, unravels and you see a dystopian future unlike any we as a race would want. I have watched this over and over and never tire of it. Everyone does a great job acting in this, the special effects are above par and the story is engaging.",
                    "data": "2019-10-31"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The Matrix - 1999This was a real change in filmmaking. Like watching it again in 2020, i.e. after 21 years and it still feels fresh. Iconic scenes are still having benchmarks setting up.If we say it sci-fi at its best, it won't be wrong. The hype was real, it is still not easy to match the level of Matrix where we experience the connection of humans and science, that too with amazing action fight and chase scenes, not just normal scenes they were, multiple exposures, slow motion 3D moves, Oh My God, and it's understandable as well like what are the characters up to and what storyline they are entering into. The script was very well written and executed otherwise it could have been a mess. A special appreciation in managing the theme with those black color costumes and a scientific zone with unimaginable equipment and props doing unbelievable things in the two worlds created. No spoilers, but the action scenes in the climax where the protagonist goes to save someone from agents are really breathtaking. The technology used at its best.A salute to Wachowski Brothers and the team for creating this masterpiece. It will be a great competition and motivation as well for many films coming in the future.",
                    "data": "2020-09-30"
                },
                {
                    "avaliacao": 10.0,
                    "texto": null,
                    "data": "2020-08-04"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This film doesn't age, it will be contemporary even in 2030 or 2040.\nWachowski's best one, by far.",
                    "data": "2021-01-03"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The story of a reluctant Christ-like protagonist set against a baroque, MTV backdrop, The Matrix is the definitive hybrid of technical wizardry and contextual excellence that should be the benchmark for all sci-fi films to come.Hollywood has had some problems combining form and matter in the sci-fi genre.  There have been a lot of visually stunning works but nobody cared about the hero. (Or nobody simply cared about anything.)  There a few, though, which aroused interest and intellect but nobody 'ooh'-ed or 'aah'-ed at the special effects.  With The Matrix, both elements are perfectly en sync.  Not only did we want to cheer on the heroes to victory, we wanted them to bludgeon the opposition.  Not only did we sit in awe as Neo evaded those bullets in limbo-rock fashion, we salivated.But what makes The Matrix several cuts above the rest of the films in its genre is that there are simply no loopholes.  The script, written by the Wachowski brothers is intelligent but carefully not geeky.  The kung-fu sequences were deftly shot -- something even Bruce Lee would've been proud of.  The photography was breathtaking.  (I bet if you had to cut every frame on the reel and had it developed and printed, every single frame would stand on its own.)  And the acting?  Maybe not the best Keanu Reeves but name me an actor who has box-office appeal but could portray the uneasy and vulnerable protagonist, Neo, to a T the way Reeves did.  But, come to think of it, if you pit any actor beside Laurence Fishburne, you're bound to confuse that actor for bad acting.  As Morpheus, Mr. Fishburne is simply wicked!  Shades of his mentor-role in Higher Learning, nobody exudes that aura of quiet intensity than Mr. Fishburne.  His character, battle-scarred but always composed Morpheus, is given an extra dose of mortality (He loves Neo to a fault.) only Mr. Fishburne can flesh out.People will say what they want to say about how good The Matrix is but the bottomline is this: finally there's a philosophical film that has cut through this generation.  My generation. The Wachowski brothers probably scribbled a little P.S. note when they finished the script saying: THINK FOR A MOMENT ABOUT YOUR EXISTENCE.  What is the Matrix, you ask?  Something that's closer to reality than you think.Either that or it's my personal choice for best film of all-time.",
                    "data": "2000-09-18"
                },
                {
                    "avaliacao": 10.0,
                    "texto": null,
                    "data": "2014-07-25"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The film is as well crafted as the matrix itself! On another level entirely to any other science fiction film from the last 20 years . Getting lost in another world, is interly what Cinema is made for. This one takes you into a whole new universe interly .",
                    "data": "2020-02-22"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "What if I told you the Matrix is not a Sci-Fi but a Documentary movie?",
                    "data": "2021-01-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Writing a review of The Matrix is a very hard thing for me to do because this film means a lot to me and therefore I want to do the film justice by writing a good review. To tell the truth the first time I saw the film I was enamored by the effects. I remember thinking to myself that this was one of the most visually stunning films I had ever seen in my life. Also having always been a comic book fan and a fan of films that were larger than life, the transitional element of the story was very appealing to me and this probably heightened my enjoyment of the film very much. It wasn't until some time later (and after having seen the film a few times more) that I started to think about the film. I recognized the Christian elements quite quickly but it wasn't until I wrote an actual 15-page essay on the film that I tapped into some of the philosophical and religious elements and that made me appreciate the film even more. I won't say that I have recognized all elements because the film is quite literally packed with them.Acting wise the film works excellently. I won't say that there aren't any issues because there are but overall the acting is pretty flawless. Keanu Reeves plays the main character, Neo, or Thomas A. Anderson and while he is not the perfect actor I think he does a pretty good job in The Matrix (and the sequels). He doesn't have the longest of lines which was probably a deliberate choice from the directors and it works because this gives him a better opportunity to work on posture and facial expressions and I must say that overall his body language is very good. Very clear and well defined. Laurence Fishbourne plays Neo's mentor Morpheus and he does an excellent job of it. His lines flow with a certain confidence and style that makes his character somewhat unique and interesting. Carrie-Anne Moss does a good job as well and succeeds in looking both cool and sexy in her leather outfit. Joe Pantoliano, a critically underrated actor does a brilliant job of bringing his character, Cypher, to life. I can't say much about him because his character is pretty essential to the plot and I certainly don't wan't to spoil it for anyone. Gloria Foster appears in a relatively small role that will have greater significance in the following films and she does a very good job. The best acting is provided by Hugo Weaving, however, in his portrayal of Agent Smith. It is really something to watch him act out the changes in his character. Agent Smith gains some human traits like anger, sense of dread, hate and eventually even a sly sense of humor (mostly in the sequels). Two thumbs way up to Weaving who has created one of the finest screen villains of all time.Effects wise the film is simply stunning and it deservedly was awarded the Oscar for best effects (and was regrettably cheated out of a nomination in the Best Film category) ahead of even Star Wars. The reason that I think The Matrix deserves the Oscar for best effects is simply that the effects in The Matrix are more innovative than the ones in Star Wars. Just take a look at how many times the effects have been spoofed and you'll probably agree. The effects also help in the symbolism of the film and in creating a very dystopian atmosphere not unlike the one seen in Blade Runner and this works brilliantly. The film looks beautiful at all times and today 6 years later (my God has it already been 6 years?) the effects still hold their ground against new science fiction films. Add the effects to the brilliant editing and you have a visual masterpiece on your hands. Very well done.The reason that I think The Matrix is more reviewable than pretty much any other film is the story and the philosophical and religious elements of the story because with every viewing I catch something I didn't see the previous time I watched it. Without spoiling the film I think I can mention a few of the more obvious elements. Obviously the film draws on the Messiah myth as Neo is a clear reference to Jesus with the analogy of his name (Neo = one, as in The One) but also hidden in his other name, Thomas A. Anderson. The first part of his last name, Anderson comes from the Greek Andros meaning \"man\" and combine this with the second part of his last name \"son\" and add a little creativity you will come up with the combination \"son of man\" which was a title Jesus came up with about himself. Also the first time we meet Neo a man calls him (and I quote): \"You're my Saviour man. My own personal Jesus Christ.\" It doesn't get any more obvious than that. Aside from the Christianic elements the film also gets its inspiration from Budhism, Gnosticism (Gnosis = knowledge) but is also inspired by Plato and his analogy of the Cave and Jean Baudrillard's essay, Simulacra and Simulations. Explaining these elements would make this review go on forever so aside from mentioning them I will not comment on them further.To all the people who doubt the profound nature of The Matrix I can only give one advice: Free your mind and watch the film again. You won't regret it. If I had to choose a favorite all time film my choice would probably fall on either The Matrix (obviously I don't expect people to agree but if they do thats great) or The Lord of the Rings: The Return of the King and I recommend it to all fans of sci-fi and people who like philosophy.10/10 - on my top 3 of best films.",
                    "data": "2005-12-01"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "At first, I wasn't interested in seeing the Matrix. But after hardly hearing any bad reviews for it (and believe me, I hear bad reviews for every movie I enjoy) I decided to give it a try. At first, although I really loved the fights, graphics and characters, the plot confused me. (Anyone confused by the plot at all should go to www.knowthematrix.com and you'll find out everything you could want to know) By the second time I watched it, I really understood it, which made the movie even more enjoyable.I really loved this movie. Just about every character, good or bad, is very interesting and cool. The acting was excellent. Even though I think this was Keanu Reeves at his best, the best acting jobs were done by Laurence Fishburne (Morpheus) and Carrie-Anne Moss (Trinity). Hugo Weaving did an excellent job as Agent Smith and Joe Pantoliano was great as Cypher as well.The plot is one of the best movie plots I've seen in a movie. An accountant by day, computer hacker by night guy suddenly finds out that reality as we know it is fake and that we are actually in a giant computer program run by robots (that we created, of course) in order for them to get power. Not only that, but he finds out that he is one who is, according to prophecy, going to put an end to it. The greatest thing is that you learn things just as Neo does, so you can really relate to his character.My favorite thing about this movie is that no matter how many times you watch it, you will learn more about it. I guarantee this. Some may not like this movie because the plot is too complicated, but I recommend that anyone who enjoys movies should go buy this one right away.",
                    "data": "2000-02-01"
                },
                {
                    "avaliacao": null,
                    "texto": "and this is all. because each explanation sounds wrong. sure, the acting,, the plot, the fight/action scenes are great. maybe unique. but the essence, for me, remains the basic idea . a fake reality against the pure truth. and the magic as clothes of each character. because it is more than a film. it is a revolution in the way to see a film and to discover reality. you are Neo. and the mythological mix of symbols and cultural references and the simple story who seems have more and more levels are more than fascinating - it is real. sure, Matrix has a lot of reviews and around it is very easy to say hypothesis, verdicts, opinions or, maybe, critics. it is enough to say it is a masterpiece. or the perfect fascinating fairy tale.",
                    "data": "2017-01-07"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Ok, I'm getting sick of comments saying stuff like \"The Matrix is the greatest film EVER MADE!\"That's complete and utter bullturd. Yes, it had great cinematography and effects, yes it had a great soundtrack but NO WAY was the acting superb and NO WAY was the storyline great.Take that storyline and stick it in any other action movie and you would leave feeling disappointed at the end. It's major selling point was \"What is the Matrix? You have to see it for yourself.\" Come on, the only plot twist was that thing to do with Cypher, and that wasn't greatly unforeseeable, there's things like that in every frigging action movie.The thing that set it apart was the ground-breaking camera effects, gnarly special effects and a funky soundtrack, as well as the costume design bit, with all that leather and expensive sunglasses. Without this stuff, all you would be left with is your average action movie.I'm not saying it was a bad film at all, just not one of the greatest. Highly entertaining, great to watch with your mates, definitely one of the most interesting films in recent years. But give me The Third Man, Memento or the Usual Suspects any day.7/10",
                    "data": "2001-09-09"
                },
                {
                    "avaliacao": 5.0,
                    "texto": null,
                    "data": "2017-03-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Without a doubt one of the best and most influential movies of all time, the Matrix is the defining science fiction film of the 1990's and the biggest leap the genre has taken since Stanley Kubrick's 2001: A Space Odyssey and Ridley Scott's Blade Runner. The Matrix is a ground-breaking motion picture that not only raised the bar for all the science-fiction films to come after it but also redefined the action genre with its thrilling action sequences and revolutionary visual effects.The film tells the story of Thomas Anderson a computer hacker that in the world of hacking goes by the alias of Neo. When he is contacted by the mysterious outlaw Morpheus and having always questioned his reality, he is awakened to the truth that the world he's been living in is a simulated reality called the Matrix and that he's nothing more than a slave in this dystopian world, created and controlled by A.I powered machines.The direction and script by the Wachowskis is fantastic, as they drew ideas and inspirations from every other great sci-fi and cyberpunk movie and anime before the film, combining it with stunning action and putting it into one picture that has enough style, substance and subtext that everyone ended up giving their own interpretation of the story. The research that went into the preparation of the screenplay is quite extensive but the manner in which it is presented on the big screen is also very impressive. Every character presented on the film, has a well-defined arc and a purpose, and their motivations are clear.The cinematography is impeccable. It was very innovative in the use of the camera angles and movements, the zooms, the slow-motion captures and the different color palette used to differentiate the Matrix and the real World. The editing is flawless, as it makes sure that every scene is integral to the story and ensures the pace of the film stays ferocious through its entire runtime. Each frame is also packed with so much visual information for the viewer to devour. The visual effects introduced us to the bullet-time effect and their impact can still be felt in today's movies. The performances are also incredible. Each member of the cast gave their best performances and brought the characters they portray to life, but the one that stands out the most is Hugo Weaving's disciplined rendition of his character, Agent Smith; a powerful computer program made to search and destroy the human rebellion, in undoubtedly the greatest performance in his career.In conclusion The Matrix is a masterpiece everyone should see. It is one of the most thought provoking, inventive, pioneering, influential and stylish movies of all time and it's also full of philosophical and religious allegories waiting for interpretation. Immortal for its contribution to cinema and pop culture, its brilliant combination of inventive visual effects, excellent vision and exquisite action easily makes it one of the best, most influential and most entertaining movies ever made.",
                    "data": "2018-04-10"
                },
                {
                    "avaliacao": null,
                    "texto": "The Matrix...when I first heard about it, I expected just another sci-fi action thriller.  Good and filled with insane stunts, but not terribly intelligent.Boy, was I wrong.  Oh, the stunts are there in spades, all right, and yes, they are awesome.  And the special effects are absolutely amazing (even if similar ones have been used in other movies as a result- and not explained as well).But the movie has plot as well.  It has characters that I cared about.  From Keanu Reeves' excellent portrayal of Neo, the man trying to come to grips with his own identity, to Lawrence Fishburne's mysterious Morpheus, and even the creepy Agents, everyone does a stellar job of making their characters more than just the usual action \"hero that kicks butt\" and \"cannon fodder\" roles.  I cared about each and every one of the heroes, and hated the villains with a passion.  It has a plot, and it has a meaning...and lo and behold, a plot does help the fight scenes!  Just try it, if you haven't seen the movie before.  Watch one of the fight scenes.  Then watch the whole movie.  There's a big difference in the feeling and excitement of the scenes- sure, they're great as standalones, but the whole thing put together is an experience unlike just about everything else that's come to the theaters.  Think about it next time you're watching one of the more brainless action flicks...think how much better it COULD be.All I can say is WATCH THIS MOVIE.  If you haven't, you're missing out on one of the best films of all time.  It isn't just special effects, folks.",
                    "data": "2001-03-02"
                },
                {
                    "avaliacao": 10.0,
                    "texto": null,
                    "data": "2021-03-13"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This movie is so well written that you can't even prove this movie is wrong about our world. This movie mades you think that our world can be just a reflection, a fake world. It's not just about the war between AI and humanity. It's more about questioning the reality.And years later the idea is never gets old. This is the movie that you should respect if someone says \"I think this is the greatest movie of all time.\" because it has somethings unique, not special it's just unique.It's beyond all the Science-Fiction movies. Normally Sci-Fi movies mades you think \"Can this subject of the movie be real someday?\" and actually only some of them made you think that way. This one mades you think \"I can't deny, this could be our reality. We can never be sure.\"Besides making one of the greatest Fictional Universes, this movie also achieves so much more.And not only that, this movie is also achieves something great in Action. It has the most iconic action scenes. Action director is so great. Revolutionary VFX and SFX, amazing Set Decoration and more.",
                    "data": "2023-03-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "20 years after its release, and several years since I last saw it, some reflections on the experience of rewatching The Matrix. In no particular order ...1) It still look great. I mean, this is one amazing, stylish looking phone. Very little about the look of the film has dated - the mobile phones, obviously, Neo's computer, and very briefly a couple of visual effects creak. But otherwise, this looks as amazing at it did on release. It's sumptuous.2) I think I was one of the many who misjudged Keanu Reeves all those yeas ago. I made easy jokes about his vacant stare and apparent intelligent. From this vantage point we can see he's been in a good number of successful, intelligent films. It's also become clear that within the industry he as a reputation as decent, hardworking man who is a pleasure to work with.3) It's apparent again how literate and cine-literate the film is. I knew this 20 years ago, but since then I've seen a lot more films and read a lot more books, and this time around I especially loved the way the film nods its head to other film genres and influences. I noticed a lot of Peckinpah, and did I see a nod to Kurosawa there too? And I was reminded that for an English Literature graduate like me, this is a goldmine of quotes, allusions and references.4) Seen 20 years on, its influence on cinema since is clear. There's a lot we could talk about here, but I was especially struck by how indebted a director like Christopher Nolan is (keeper of the flame of intelligent blockbusters), especially with Inception.5) I'd forgotten that the narrative ostensibly maintains uncertainty about Neo's identity until just before the end. I'm not sure this really works - anyone who's read many books or ever done an anagram will not find that the most suspenseful part of the narrative.6) Despite a run time of 2 and a quarter hours, it never flags and attention never wonders. The film fizzes with kinetic energy and the time flies by. It's a lean film, without a wasted moment.7) The film is, of course, packed with religious allusions. When I wrote a chapter on this for my BA Theology dissertation, I said I thought the film was neo-Bhuddist (forgive the pun, please), and I stand by that on rewatching. Of course, there's lots of allusions to Christian and other theology, and The Matrix spawned some really bad reading of film by Christians which has never really stopped. When will some Christians learn to read a film/book etc with integrity and understanding of what the film is trying to do? It's a spiritually confused mish-mash of a film - but still a gloriously entertaining one.8) All these years later, it turns out The Matrix was somewhat prophetic about the role technology would play in our lives. Humans permanently plugged in to networks? Different layers of reality that are somehow more real than what we think of as real? The Wachowskis saw all that and more coming 20 years ago. Artists are the weather vane of society; we really should learn to pay attention to them.9) Bottom line. I still bloody love this film. I'm trying to work out if I have the requisite strength to revisit the sequels....",
                    "data": "2019-02-21"
                },
                {
                    "avaliacao": 10.0,
                    "texto": null,
                    "data": "2015-07-29"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The Wachowski brothers really did excel themselves with this movie. It's a brilliant movie on a number of different levels - the directing is excellent, the camera work is great, the visuals are stunning, the kung-fu is A+, acting is executed with style and conviction, and the plot is truly inspired. It's really hard to use enough superlatives on this movie!It'd be a 10/10, except for the ending. Having Neo do what he does at the end really lets it down, in my opinion. However, there's a couple of sequels on the way, so let's see what the Wachowskis can do to make up for it.Other than that, (and like I said above) the movie is operating on so many different levels that each time you watch it, you pick up something new... this isn't by accident, either. The Wachowski brothers had the actors read a number of definitive works (Simulation & Simulcra was one I believe) in modern literature and psychology, and applied liberal dashings of aspects of the major religions to provide the best sci-fi movie of the decade, if not ever.I'm yet to meet somebody who hasn't enjoyed it. It's my favourite movie to watch on a good cinema system, too.",
                    "data": "2002-04-22"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "'The Matrix' may not be one of the very greatest examples of its genre (like '2001', 'Metropolis', 'Blade Runner', 'Back to the Future', 'Star Wars Original Trilogy', 'Alien' and 'Aliens'), but that it is revolutionary in how its visuals and use of sound broke boundaries like had never been done before cannot be denied.It is not a film to be seen if people want character depth or relationship depth, with the forced and underdeveloped love subplot between Neo and Trinity being 'The Matrix's' sole weak spot. This ended up not being that huge a problem for me because everything else is so well executed.Particularly striking about 'The Matrix' is its production values. Simply put, the film looks amazing in its audacious production design, dazzling special effects that are some of the most ultra-cool and imaginative to exist, super slick editing and often jaw dropping cinematography. So much more than a film with ground-breaking special effects and use of camera work that broke boundaries.Use of sound was also striking, and how the pulsating and hypnotic music score was used. Andy and Larry Wachowski direct adeptly, while the script is an intelligent mix of complex and well-explored themes, mysticism, philosophy and even Lewis Carroll and the story is often invigorating and intensely taut with a smart concept brilliantly done.Action is superbly shot and edited, and the way it is choreographed is relentlessly intense and breathless in its energy, Kung Fu has rarely been more vertigo-inducing (despite how this sounds, this is not a bad thing as it added hugely to the intensity and paranoia of the story's atmosphere) on film.Keanu Reeves is in one of his best and most iconic roles and has never looked cooler, certainly has not looked this comfortable for a while before then. Carrie Anne Moss is strong. Even better are an imposingly charismatic Laurence Fishburne (also in one of his best roles), an amusing Joe Pantoliano and a deliciously wicked Hugo Weaving.Summing up, not one of the best of the genre but a mile-stone nonetheless and a great one. Followed by two sequels, both nowhere near in the same ball-park. 9/10 Bethany Cox",
                    "data": "2017-02-19"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Truly a masterpiece in every way! If it wasn't for Fight Club this would my favorite; I've been on the fence about it. The Matrix along with They Live have the best metaphors about life/society, most of which a lot of the population aren't woke to!For example the entire speech Morpheus says \"The Matrix is everywhere. It is all around us. Even now, in this very room. You can see it when you look out your window or when you turn on your television. You can feel it when you go to work... when you go to church... when you pay your taxes. It is the world that has been pulled over your eyes to blind you from the truth. That you are a slave, Like everyone else you were born into bondage. Into a prison that you cannot taste or see or touch. A prison for your mind.\" Among other brilliant quotes like when he talks about what the world has become, then mentions we have become this referring to a battery. So many genius lines I could list that I won't.The effects, stunts, lighting, sounds, and tone are outstandingly spot on! They really did train for the fight sequences for months I've seen all the special features plus more. Yes this is a sci-fi film, but I see it as a documentary as well. We're all slaves that take the blue pill throughout many things it's just hard to realize that. I also love what someone else said, it's a benchmark for sci-fi to come, that is very true and it's the last of its kind; movies aren't made like this anymore!A lot of people worked hard to make this film what it is. I respect that; I've always wanted to work on film just haven't had a way for many reasons. If you've read this far or even at all thanks and sorry! I usually don't leave a review this long, just thought it was worth it for this one. Check out my others if you're interested for now 10 out of 10 phenomenal movie in many ways!",
                    "data": "2019-03-30"
                },
                {
                    "avaliacao": 6.0,
                    "texto": null,
                    "data": "2017-05-29"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Matrix was a good movie for 1990 but comparing to new series on 2020 its just not 8.7.And\nGlorified martial arts movie masquerading as a science-fiction thriller, this blockbuster hit struck a nerve with the public, though it isn't as brainy (or as deep) as one might be led to believe. Keanu Reeves is typically one-note as a computer-hacking loner who finds his life may not be reality--and that an alternate reality introduced to him by guru Laurence Fishburne could destroy him. Written and directed by the Wachowski brothers, who seem to enjoy a twisting story--though at the expense of logic (forget credibility). A more engaging leading man might have made the technical asides easier to wade through, although most audiences didn't seem to mind. Followed by \"The Matrix Reloaded\" and \"The Matrix Revolutions\", both in 2003.",
                    "data": "2022-03-26"
                },
                {
                    "avaliacao": null,
                    "texto": "The first 45 minutes of this film had me very excited. It is so rare that I will go to the theater and be presented with something which is both original and intelligent. It managed to hang in there throughout, though the ending was too formulaic. In addition, the voice-over at the very end reminded me of the final scene in Saving Private Ryan. It almost ruins a fantastic film.The only other objection I can come up with is that the you must know, you must be type philosophy being handed out was just a tad hokey. I must pleasantly admit though, since I don't get to admit this very often, that The Matrix is worth seeing despite these things.The visuals are extremely impressive, particularly the \"white room,\" the baby harvester, the training scene with the \"red woman,\" the Reeves interrogation scene... I have to agree with some of the previous comments that the plot idea won't seem overly original to a fan of Philip K Dick, but then what is original after you've read him? The Matrix has more original things to say than two months worth of standard Hollywood fare. I have a great deal of respect for a film which will have someone say \"they're turning humans into this\" and hold up a battery. A plot which looks at man as machine will get a thumbs up from me just for trying.I feel some hope for the future of movie-making in America to be able to recommend this film.",
                    "data": "1999-04-01"
                }
            ]
        },
        {
            "url": "https://letterboxd.com/film/the-matrix/",
            "titulo": "The Matrix",
            "generos": [
                "Science Fiction",
                "Action"
            ],
            "data de lançamento nos cinemas": "1999-05-21",
            "classificacao indicativa": null,
            "sinopse": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
            "duracao": "02:16:00",
            "diretor": "Lana Wachowski, Lilly Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Gloria Foster",
                "Joe Pantoliano",
                "Marcus Chong",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Paul Goddard",
                "Robert Taylor",
                "David Aston",
                "Marc Aden Gray",
                "Ada Nicodemou",
                "Deni Gordon",
                "Rowan Witt",
                "Eleanor Witt",
                "Tamara Brown",
                "Janaya Pender",
                "Adryn White",
                "Natalie Tjen",
                "Bill Young",
                "David O'Connor",
                "Jeremy Ball",
                "Fiona Johnson",
                "Harry Lawrence",
                "Steve Dodd",
                "Luke Quinton",
                "Lawrence Woodward",
                "Michael Butcher",
                "Bernard Ledger",
                "Chris Pattinson",
                "Robert Simper",
                "Nigel Harbach"
            ],
            "media_crit": null,
            "reviews_crit": [],
            "media_usr": "8.34",
            "reviews_usr": [
                {
                    "avaliacao": 8.0,
                    "texto": "neo being woken up by a kiss officially makes him a disney princess, right?",
                    "data": "2021-08-19"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "When he jumps out to save Morpheus who isn’t gonna make it, and catches him then they reveal the chain he’s attached to, then the helicopter’s fuselage is shot, then trinity has to land them on the rooftop, then Neo rolls to a stop and realizes the woman he loves is stuck on the crashing helicopter and immediately shores up his strength on the cable, then trinity holds the cable and shoots its bearings, then jumps and the helicopter hits…",
                    "data": "2019-12-22T22:36:32.837Z"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "i can also do a backflip",
                    "data": "2021-12-07"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "funny how the color green didn’t even exist until this masterpiece was released in 1999",
                    "data": "2019-11-06"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Taking the red pill up my ass to shock Morpheus",
                    "data": "2021-09-19"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Me and the boys calling each other by our gamertags in real life",
                    "data": "2020-07-29"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "BITCH I'M 20 YEARS LATE SHOOK",
                    "data": "2019-08-17"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "team blue pill all the way baby, we LOVE living in denial ladies",
                    "data": "2019-03-31"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "trinity: dodge this me, prolapsing: god is a woman",
                    "data": "2017-08-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Holy fuck. Fuck me for not seeing this the day it came out. I mean I was only 2 years old, but that's just not a good enough excuse.",
                    "data": "2016-04-14"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "when i say this film is ahead of its time i mean it was 1 year before linkin park",
                    "data": "2019-07-19"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "thinking about how morpheus’ glasses don’t have arms",
                    "data": "2021-11-05"
                }
            ]
        },
        {
            "url": "https://letterboxd.com/film/the-matrix-reloaded/",
            "titulo": "The Matrix Reloaded",
            "generos": [
                "Thriller",
                "Science Fiction",
                "Action",
                "Adventure"
            ],
            "data de lançamento nos cinemas": "2003-05-23",
            "classificacao indicativa": null,
            "sinopse": "The Resistance builds in numbers as humans are freed from the Matrix and brought to the city of Zion. Neo discovers his superpowers, including the ability to see the code inside the Matrix. With machine sentinels digging to Zion in 72 hours, Neo, Morpheus and Trinity must find the Keymaker to ultimately reach the Source.",
            "duracao": "02:18:00",
            "diretor": "Lana Wachowski, Lilly Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Jada Pinkett Smith",
                "Gloria Foster",
                "Harold Perrineau",
                "Monica Bellucci",
                "Harry Lennix",
                "Lambert Wilson",
                "Randall Duk Kim",
                "Nona Gaye",
                "Anthony Zerbe",
                "Daniel Bernhardt",
                "Helmut Bakaitis",
                "David Kilde",
                "Matt McColm",
                "Collin Chou",
                "Neil Rayment",
                "Adrian Rayment",
                "Don Battee",
                "Valerie Berry",
                "Steve Bastoni",
                "Ian Bliss",
                "Liliana Bogatko",
                "Michael Budd",
                "Stoney Burke",
                "Kelly Butler",
                "Josephine Byrnes",
                "Noris Campos",
                "Paul Cotter",
                "Marlene Cummins",
                "Attila Davidhazy",
                "Montaño Rain",
                "Austin Galuppo",
                "Nicandro Thomas",
                "Essie Davis",
                "Terrell Dixon",
                "Nash Edgerton",
                "David Franklin",
                "Daryl Heath",
                "Roy Jones Jr.",
                "Malcolm Kennard",
                "Christopher Kirby",
                "Peter Lamb",
                "Nathaniel Lees",
                "Tony Lynch",
                "Robert Mammone",
                "Alima Ashton-Sheibu",
                "Joshua Mbakwe",
                "Chris Mitchell",
                "Ray Anthony",
                "Steve Morris",
                "Tory Mussett",
                "Rene Naufahu",
                "Robyn Nevin",
                "David Will No",
                "Genevieve O'Reilly",
                "Socratis Otto",
                "Rupert Reid",
                "Cornel West",
                "David Roberts",
                "Shane C. Rodrigo",
                "Nick Scoggin",
                "Kevin Scott",
                "Tahei Simpson",
                "Frankie Stevens",
                "Gina Torres",
                "Andrew Valli",
                "Andy Arness",
                "Steve Vella",
                "Clayton Watson",
                "Leigh Whannell",
                "Bernard White",
                "John Walton",
                "Scott McLean",
                "Anthony Brandon Wong",
                "Christine Anu",
                "Tiger Chen Hu",
                "Marcus Young",
                "David Leitch",
                "Lachy Hulme"
            ],
            "media_crit": null,
            "reviews_crit": [],
            "media_usr": "6.82",
            "reviews_usr": [
                {
                    "avaliacao": 8.0,
                    "texto": "in many ways this is monsters inc",
                    "data": "2021-12-16"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "The most telling scene on rewatch is that electronic rave montage; a sea of white, brown, and black bodies moving, sweating, grabbing each other, expressing a sense of kinetic freedom... Wachowski sisters, better than most, understand that a vital element of compelling action (that freeway set piece is still undoubtedly an all-timer) is truly understanding what our heroes are fighting for.",
                    "data": "2016-10-16"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "THERE’S LITERALLY MORE TO DISCOVER EVERY TIME",
                    "data": "2019-03-11"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "me and the boys having a gnostic rave in the hollow earth",
                    "data": "2021-09-12"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "i was lied to for many years this movie fucks",
                    "data": "2021-08-30"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "One of the most frustrating movies ever made.",
                    "data": "2019-03-30"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "No surprise from the Wachowskis that this is unflinchingly committed to being itself. Few major studio franchise sequels are so unabashedly personal and often frustratingly idiosyncratic. Yet at its very worst it's merely inelegant, the not-infrequently comic portent offset by sheer ambition and technical craft. Speaking of which, it's so easy to forget just how much of this is practical. Fine, set aside the dated digital doubling in the Burly Brawl fight; the remainder of the sequence is damn near…",
                    "data": "2014-04-12"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "keanu reeves, you're breathtaking",
                    "data": "2019-08-18"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "a flash mob consisting of 100 hugo weavings",
                    "data": "2019-04-03"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "The Matrix is so well paced and lean and The Matrix Reloaded is like \"how's tank and dozer's sister's marriage doing?\"",
                    "data": "2021-11-27"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "when people said to me, \"The Matrix Reloaded is the one with the twins,\" I didn't realize those were the twins. has there ever been a bad Wachowskis setpiece? plenty to like here: I laughed out loud at the dominoes (bowling pins?) foley when Neo knocks over all the Smiths. it's cool that this Matrix movie introduces the concept of \"France\"",
                    "data": "2021-12-11"
                }
            ]
        },
        {
            "url": "https://letterboxd.com/film/the-matrix-resurrections/",
            "titulo": "The Matrix Resurrections",
            "generos": [
                "Adventure",
                "Science Fiction",
                "Action"
            ],
            "data de lançamento nos cinemas": "2021-12-22",
            "classificacao indicativa": null,
            "sinopse": "Plagued by strange memories, Neo's life takes an unexpected turn when he finds himself back inside the Matrix.",
            "duracao": "02:27:00",
            "diretor": "Lana Wachowski",
            "cast": [
                "Keanu Reeves",
                "Carrie-Anne Moss",
                "Yahya Abdul-Mateen II",
                "Jonathan Groff",
                "Jessica Henwick",
                "Neil Patrick Harris",
                "Jada Pinkett Smith",
                "Priyanka Chopra Jonas",
                "Christina Ricci",
                "Lambert Wilson",
                "Andrew Lewis Caldwell",
                "Toby Onwumere",
                "Max Riemelt",
                "Joshua Grothe",
                "Brian J. Smith",
                "Eréndira Ibarra",
                "Michael X. Sommers",
                "L. Trey Wilson",
                "Mumbi Maina",
                "Max Mauff",
                "Purab Kohli",
                "Freema Agyeman",
                "Sabrina Strehl",
                "Andrew Rothney",
                "Cooper Rivers",
                "Esther Silex",
                "Frank Isom",
                "Leo Sheng",
                "Telma Hopkins",
                "John Gaeta",
                "Donald Mustard",
                "Kim Libreri",
                "Joe Mazza",
                "Chad Stahelski",
                "Julian Grey",
                "Gaige Chaturantabut",
                "Tiger Chen Hu",
                "Volkhart Buff",
                "Amadei Weiland",
                "Stephen Dunlevy",
                "Ellen Hollman",
                "Ian Pirie",
                "Nicolas de Pruyssenaere",
                "Felix Quinton",
                "Aaron Pina",
                "Dani Swan",
                "London Breed",
                "Steven Roy",
                "Mercy Malick",
                "Juval Dieziger",
                "James McTeigue",
                "Sarah McTeigue",
                "William W. Barbour",
                "Kenny Beers",
                "Thomas Dalby",
                "James D. Weston II",
                "Michael J. Gwynn",
                "Pablo Sanfrancisco"
            ],
            "media_crit": null,
            "reviews_crit": [],
            "media_usr": "5.36",
            "reviews_usr": [
                {
                    "avaliacao": 9.0,
                    "texto": "It’s fitting — maybe even fate — that “Spider-Man: No Way Home” should be the biggest and virtually only movie in the world on the week that “The Matrix Resurrections” is released. Both are mega-budget, meta sequels that feed on our collective familiarity with their respective franchises. One is a poison, the other its antidote.",
                    "data": "2021-12-21"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Nothing will ever approach the shock of the new the original gave us, but this is still a quintessential Wachowski huge swing, deeply idiosyncratic and defiant of expectation, cluttered but meticulously constructed and written to theme, and unabashedly dorky. Just like the last two sequels it'll probably be another decade before everyone realizes this is Actually Good.",
                    "data": "2021-12-15"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "I never would’ve guessed this was exactly what I wanted from a new Matrix movie in 2021 but wow I guess it is",
                    "data": "2021-12-22"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "a love story that feels like it was made by an actual human being! enjoyed this movie a lot",
                    "data": "2021-12-27"
                },
                {
                    "avaliacao": 2.0,
                    "texto": "Dude what the fuck is happening to cinema",
                    "data": "2021-11-13T12:31:19.523Z"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "never in doubt",
                    "data": "2021-12-15"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "73",
                    "data": "2021-12-22"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "did you know that the reason most detransitioners give for doing it isn't that they didn't want to be trans, or it wasn't right for them. it's actually because the people in their lives, the world around them, made it impossible to continue. ",
                    "data": "2021-12-22"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Among other things, a film about: the enraging state of IP-based filmmaking and the impossibility of an original artist getting a budget for anything other than a sequel, the residual pain & doubt even when you've attained your real self, late capitalism as a manufactured state of endless longing, and the important difference between victory and peace. Will have more thoughts later to let people go in as blind as possible (even if “spoilers” are less relevant here than any recent…",
                    "data": "2021-12-15"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "01010100 01001000 01000101 00100000 01001101 01000001 01010100 01010010 01001001 01011000 00100000 01010010 01000101 01010011 01010101 01010010 01010010 01000101 01000011 01010100 01001001 01001111 01001110 01010011 00100000 01100100 01100101 01100011 01101111 01101110 01110011 01110100 01110010 01110101 01100011 01110100 01110011 00100000 01110100 01101000 01100101 00100000 01101111 01110010 01101001 01100111 01101001 01101110 01100001 01101100 00100000 01110100 01110010 01101001 01101100 01101111 01100111 01111001 00100000 01110111 01101001 01110100 01101000 00100000 01100001 01101110 00100000 01100001 01101101 01100010 01101001 01110100 01101001 01101111 01110101 01110011 00101100 00100000 01101111 01100110…",
                    "data": "2021-12-15"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "\"Why does this story feel like a memory?\"",
                    "data": "2021-12-22"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/matrix",
            "titulo": "The Matrix",
            "generos": [
                "Sci-Fi",
                "Action",
                "Mystery",
                "Thriller"
            ],
            "data de lançamento nos cinemas": "1999-03-31",
            "classificacao indicativa": "R",
            "sinopse": "Neo believes that Morpheus, an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity, a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.",
            "duracao": "02:16:00",
            "diretor": "Lilly Wachowski, Lana Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Joe Pantoliano",
                "Gloria Foster",
                "Marcus Chong",
                "Paul Goddard",
                "Robert Taylor",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Rowan Witt"
            ],
            "media_crit": 7.9,
            "reviews_crit": [
                {
                    "avaliacao": 9.0,
                    "texto": "Making a great film that's a psychedelic, kung-fu-inspired meditation on the human condition is a tall order. The Matrix delivers on all that & more.",
                    "data": "2024-09-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "“The Matrix” is the AI prophecy and wake-up call the human race is in dire need of. Watching the 2024 re-release is highly recommended.",
                    "data": "2024-09-25"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "An amazing cocktail of martial arts, shootouts, philosophy, romance, fantasy, revolutionary visual effects and perfect casting. “The Matrix” surprised us 25 years ago, and it continues to surprise us in the Year of Our Lord 2024. Full review in Spanish.",
                    "data": "2024-09-21"
                },
                {
                    "avaliacao": null,
                    "texto": "The Wachowskis proceed to turn the world as we know it into a virtual reality landscape with a 20th century tech-noir look (lit with a sickly green hue, like the glow of an old IBM computer screen) and the physics of a video game.",
                    "data": "2023-09-09"
                },
                {
                    "avaliacao": null,
                    "texto": "A $60 million, high-tech assault on the senses and a pretentious insult to the mind.",
                    "data": "2023-07-15"
                },
                {
                    "avaliacao": null,
                    "texto": "A cyberpunk thriller that's so much fun to watch, it could single-handedly reboot the genre.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "The Wachowskis seem to be saying that while state-of-the-art effects speak for themselves, loud and clear, there's still room amid all the kicking and shooting and shouting for the carefully observed human emotion.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "Though The Matrix ultimately overdoses on gloom-and-doom grunge, over-elaborate cool and especially running time, it's just clever enough to enable [the Wachowskis] to nix the sophomore jinx following 1996's Bound.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "I know almost nothing of the intricate techniques that make The Matrix as eye-filling as it is brain-numbing, but I can tell you that... [its visuals] are wondrous to behold.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "If you're looking for a good spring fix of existentialist sci-fi, look no further than The Matrix -- then do everything you can to look deeper than the skin-tight surface.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Although it's sometimes too confounding for its own good and a little heavy on the Zen-inspired techno-babble, The Matrix is a consistently absorbing assault on the senses.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "There's more form than content in The Matrix, but Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Give [the Wachowskis] an A for effort and three A's for those effects. The Matrix is a dazzlingly original visual adventure.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 2.5,
                    "texto": "Casting the robotic Reeves as the hope of humanity may be this oppressively long, self-satisfied movie's funniest gag, but it doesn't really make the game any fun. It means we get stuck with the least interesting player.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The Matrix's pleasures are considerable, but they're all purely visceral, too, lacking the mythology that would have elevated the movie. The movie is best taken as the first entry in a brand-new genre: post-modern sci-fi pulp.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "How could filmmakers who are so skilled and imaginative lose themselves (and us) in what feels like a college stab at Aldous Huxley metaphysics?",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "A futuristic paranoia extravaganza, it would seem to have far more appeal to an artificial intelligence than it would to human beings and other carbon-based life forms.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "An interminable, sterile, exercise in cinematographic onanism.  [Full review in Spanish]",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "Like last year's Dark City, the effects and storyline of The Matrix plow through enough fresh territory to make it worth seeing.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "Visually, at least, The Matrix more than lives up to its billing. Writer-directors [the Wachowskis] seem to literally bring the screen to life with action scenes that define the word kinetic.",
                    "data": "2023-07-13"
                }
            ],
            "media_usr": 7.2,
            "reviews_usr": [
                {
                    "avaliacao": 10.0,
                    "texto": "Amazing movie if U like action movies and movies with crazy stories",
                    "data": "2025-11-12"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "amazing acting, action and visuals. It is a must see classic no matter what movies you like",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This movie was ahead of its time. A classic master piece with quality actors.",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Cool action movie.... although a bit flawed.....",
                    "data": "2025-11-06"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Fun and clever movie.",
                    "data": "2025-11-01"
                },
                {
                    "avaliacao": 1.0,
                    "texto": "Wish I could give this pretentious pile of crap Zero Stars.",
                    "data": "2025-10-31"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "One of the most iconic movies of my generation\n\nFor a movie made in the late ’90s, The Matrix has absolutely incredible production value. The visual effects and animation techniques were way ahead of their time — the slow-motion “bullet time” shots and slick fight choreography still hold up amazingly well today. It’s one of those films that completely changed the game for action and sci-fi movies.\n\nFrom start to finish, The Matrix keeps you on the edge of your seat. The story is mind-bending, the pacing is perfect, and the atmosphere pulls you deep into its futuristic world. It’s one of those rare movies that makes you think while still delivering nonstop entertainment.\n\nOverall, I’d give The Matrix a solid 4 stars. It’s stylish, thought-provoking, and packed with action — an iconic film that still feels fresh decades later.",
                    "data": "2025-10-28"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "OK, so it's a bit surf dude nonsensical, but it's a great idea and an even greater spectacle. It really doesn't make sense on any level but as long as you don't mind that, you can just enjoy the ride.",
                    "data": "2025-10-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This movie was built to mastery. There is so much brilliance that went into asking some very deep questions about life, creation and so many other spiritual mysteries. Extremely well done and highly enjoyable. This movie was so far ahead of its time that no other film series has been able to dig this deep on asking some very important questions. Very nice balance between story and integrating technical action scenes. Very well done. One of my very favorite movies of alll time",
                    "data": "2025-10-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "One of the greatest movies ever.",
                    "data": "2025-10-23"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Best AI Take Over + Action movie ever created. Just watch it if you haven't. There were so many industry standards set with this movie. If you don't like it, there's probably something wrong with you and you should see a professional about it. :)",
                    "data": "2025-10-21"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "One of the best movies ever made.",
                    "data": "2025-10-16"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "The Matrix is a science fiction film about Neo, a hacker who discovers that he is in a simulation, and joins a group a rebels to fight to save humanity. The movie has an interesting story, great acting, amazing visuals, and special effects that still hold up with today's standards. Overall, I would give it a 9.5, definitely one of the best films I've watched.",
                    "data": "2025-10-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "To be honest, one of the best sci-fi movies I've ever seen because it really go through the question of \"do we really live in the world we live in\", really thought-provoking  and well paced : everything isn't explained and laid out to you : you have to follow the storyline and understand by yourself (more immersive than usual Sci-fi movies).  It aged a bit, yeah, but still have impressive effects and CGI is really specific at this movie, a revolutionnary futuristic style with new ways of editing (at the time it was published). The music is also more original than usual with Rage Against The Machine and electro/grunge music that really goes well with the overall atmosphere. \n And surprisingly, the following movies are as good as this one (maybe less impressive because effects were less surprising) with a well-thought storyline and effects obviously.",
                    "data": "2025-10-09"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "so really good. and it's the best.",
                    "data": "2025-09-30"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "It was absolutely incredible on the big screen!!! I didn’t get to see it on its initial run, but I didn’t see the sequels.  This was a full circle moment and I’m so glad I got to experience as the director’s intended it to be.",
                    "data": "2025-09-28"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Greatest movie of my time",
                    "data": "2025-09-20"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The matrix is a Extremely important piece of cinema. It was shot pre 911. It had come just 2 years before star wars rebooted episode 1. Amd, It was badass. The whole comcelt was something I nyself truly thought up once. Completely differe t vision for the film. Bjt i still had this film in my mind. I gill this day in 2025 say its the best film rver. Msde handd down bh a mile. Watch this m ow!!!!!",
                    "data": "2025-09-18"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "The ai predict thing is kinda cool",
                    "data": "2025-09-07"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The Matrix is one of those movies that everyone should probably see. The cultural impact that this movie has had on the world (in both good and bad ways) is completely incomparable. There are people out there that think the undertones of spiritual and world views in this film are actually real. The action in this movie is amazing, and the story in peak. If you haven't seen this yet, now is the time.",
                    "data": "2025-08-30"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/replicant",
            "titulo": "Replicant",
            "generos": [
                "Action",
                "Mystery",
                "Thriller",
                "Sci-Fi"
            ],
            "data de lançamento nos cinemas": "2007-03-01",
            "classificacao indicativa": "R",
            "sinopse": "Detective Jake Riley (Michael Rooker) is on the trail of serial killer Edward \"The Torch\" Garrotte (Jean-Claude Van Damme), who murders mothers and sets them ablaze after they're dead. Nearing retirement, Riley is removed from the case but is soon contacted by a government agency that has created a clone of Garrotte using a secret technology. The replicant (also Van Damme) teams with Riley to help track down the killer, but despite the novel approach, Garrotte will be hard to stop.",
            "duracao": "01:37:00",
            "diretor": "Ringo Lam",
            "cast": [
                "Jean-Claude Van Damme",
                "Michael Rooker",
                "Catherine Dent",
                "Ian Robison",
                "Brandon James Olson",
                "Pam Hyatt",
                "Allan Gray",
                "Jayme Knox"
            ],
            "media_crit": 4.9,
            "reviews_crit": [
                {
                    "avaliacao": 4.0,
                    "texto": "The finale, drawn out and exceptionally bloodthirsty, is moderately satisfying – even if terribly unrealistic, which matches the nonsensical parting shots.",
                    "data": "2025-09-25"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The action sequences are well staged and credit where credit is due: The 40-year-old martial artist still has the physical goods, executing 180 splits and gymnastic stunts with the grace and apparent ease of someone much younger.",
                    "data": "2008-11-02"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "",
                    "data": "2005-10-09"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "",
                    "data": "2005-08-14"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "",
                    "data": "2005-05-06"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Slightly less awful than most of Van Damme's efforts.",
                    "data": "2005-04-03"
                },
                {
                    "avaliacao": 0.0,
                    "texto": "Low budget and low thought exploration of promising idea",
                    "data": "2004-09-16"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "Replicant doesn't even come close to some of Van Damme's better flicks (Timecop and Sudden Death), but it's certainly an improvement over what he's been up to lately.",
                    "data": "2003-05-07"
                },
                {
                    "avaliacao": null,
                    "texto": "I was surprised to find \"Replicant\" wasn't too bad at all.",
                    "data": "2002-09-24"
                },
                {
                    "avaliacao": 5.8,
                    "texto": "People looking for a movie that offers conversational debate on a controversial dilemma should look beyond this one-dimensional decoy.",
                    "data": "2001-12-08"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "The whole trying affair is irresistibly dopey. Kinetic, too.",
                    "data": "2001-10-19"
                }
            ],
            "media_usr": 5.8,
            "reviews_usr": [
                {
                    "avaliacao": 1.0,
                    "texto": "Filme mais ou menos, o roteiro é fraco, as cenas são mais ou menos, a história é fraca, o elenco é fraco, e ninguém ajuda a melhorar o filme, os personagens são fracos, e o filme deveria ter cenas bem melhores e relevantes, para fazer o filme ser bom",
                    "data": "2025-06-15"
                },
                {
                    "avaliacao": 1.0,
                    "texto": "What’s better than one van damme ? We already know, double impact showed us exactly what…. these toooze can do. Except one is a bingo. The road twitch brought him a coat after, he destroyed her place, and he never said one word to her. Phile.",
                    "data": "2025-04-18"
                },
                {
                    "avaliacao": 3.0,
                    "texto": "Do not waste your time, I can’t believe this got any good reviews at all, premise is pretty stupid, but the acting is worse.",
                    "data": "2025-03-08"
                },
                {
                    "avaliacao": 3.0,
                    "texto": "Not only was he a 'bad boy', it was a very bad film.",
                    "data": "2023-07-17"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "An unusual strong performance for Van Damm, I would say if the premise doesn't at least interest you, watch it for his performance alone.  Recommended for action fans",
                    "data": "2020-07-24"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "The action is cool and JCVD gives one of his best performances.",
                    "data": "2020-07-01"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Van Damme plays two very different roles and it comes together in a great movie.",
                    "data": "2018-10-23"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Another classic Jean Claude entry.",
                    "data": "2018-06-17"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "My 3rd fav Jean-Claude Van Damme film behind Bloodsport & Kickboxer. The tagline to this film is spot on. Michael Rooker's character has to work with a guy who looks practically identical to his own worst enemy, If that's not compelling... I don't know what is. So critics how is this bad? Because this is far more superior to Citizen Kane, The Dark Knight Rises & The Last Jedi combined. Criminally Underrated",
                    "data": "2018-03-25"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Ridiculous premise, but Van Damme is surprisingly convincing in his polar performances, and as always his fight scenes are kinetic and fun.",
                    "data": "2016-10-09"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "Okay, so the story has a hokey premise and failed fully explore some potentially thought-provoking themes. Still, I think Van Damme's performance as both the Torch and the Replicant is vastly underappreciated.",
                    "data": "2016-10-06"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "One of JCVD's better movies",
                    "data": "2016-01-13"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "This movie isn't all that great, but seeing VD fighting himself is always worth your time.",
                    "data": "2015-05-28"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "I see alot of negative reviews and I scratch my head why? Van Damme delivers an exceptional performance with an original plot, you see a new side to his acting in this one! Wish he made more like this! Michael Rooker also surprised me, very aggressive and gritty in this one!",
                    "data": "2014-11-24"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "A solid but unspectacular JCVD film that features an intriguing premise and a few fun fight scenes.",
                    "data": "2014-07-03"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Very disappointing, script is awful the fight scenes are just ok. Nothing new and quite pointless. \nVan Damme wasn't too bad though.",
                    "data": "2014-03-01"
                },
                {
                    "avaliacao": 3.0,
                    "texto": "*OFFICIAL BETTER THAN EXTREMELY LOUD AND INCREDIBLY CLOSE SEAL*\n\nDumb.",
                    "data": "2014-01-29"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Back in the early 2000 JCVD was trying a come back on the big sceen after years of dud and cocaine tabloids scandals. Here he portrays two different characters, the good & the bad one two twins one created to arrest the first one. It's quite ok as an action flick but it's nothing breathtaking. JCVD is pretty ok as usual too bad the film isn't trying to be more than just an honest B Movie...",
                    "data": "2014-01-14"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "1/1/2014: not too bad a movie. Some good action and JCVD did a good job acting.",
                    "data": "2014-01-01"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "(54%)\ndecent entry into Van-Damme's strait-to-video movies, with a genuinely good sci-fi premise, as well as decent action sequences that are solidly done, especially given the quite low budget. It may lack a little big budget sheen, but the two leads (Rooker and Van-Damme) give a \"can be bothered\" performance which is something you don't often see in this end of the film industry.",
                    "data": "2013-09-18"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/matrix_reloaded",
            "titulo": "The Matrix Reloaded",
            "generos": [
                "Sci-Fi",
                "Action"
            ],
            "data de lançamento nos cinemas": "2003-05-15",
            "classificacao indicativa": "R",
            "sinopse": "Freedom fighters Neo (Keanu Reeves), Trinity (Carrie-Anne Moss) and Morpheus (Laurence Fishburne) continue to lead the revolt against the Machine Army, unleashing their arsenal of extraordinary skills and weaponry against the systematic forces of repression and exploitation. In their quest to save the human race from extinction, they gain greater insight into the construct of The Matrix and Neo's pivotal role in the fate of mankind.",
            "duracao": "02:18:00",
            "diretor": "Lilly Wachowski, Lana Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Jada Pinkett Smith",
                "Gloria Foster",
                "Harold Perrineau",
                "Monica Bellucci",
                "Harry Lennix",
                "Lambert Wilson",
                "Randall Duk Kim",
                "Anthony Zerbe",
                "Helmut Bakaitis",
                "Neil Rayment",
                "Adrian Rayment"
            ],
            "media_crit": 6.9,
            "reviews_crit": [
                {
                    "avaliacao": 7.5,
                    "texto": "In a genre dominated by fan service, “requels” (see also, The Force Awakens), and movies devoid of philosophical dilemmas or subtext, The Matrix Reloaded feels like a unicorn. The Wachowskis made it as a personal statement.",
                    "data": "2025-05-05"
                },
                {
                    "avaliacao": null,
                    "texto": "They don't come up with anything new, but it's bigger, louder, and mighty impressive, even if the dialogue sounds more and more like a preprogrammed video game.",
                    "data": "2023-09-09"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The film entertains despite its structural shortcomings, as the Wachowskis have created a cinematic world that’s a pleasure to experience, even though it’s not as satisfying as its predecessor.",
                    "data": "2022-07-12"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "It’s more of a teenage fantasy than ever before, overflowing with stoic figures in black garb, machine guns, stabbing weapons, car chases, and seductive women, even if it’s difficult to discount the utterly mesmerizing, sustained highway chase sequence.",
                    "data": "2022-07-11"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "While not the all-guns-blazing 5-out-of-5 its predecessor was I still find The Matrix Reloaded a fun film, full of a fun sci-fi plot and plenty of crazy action sequences.",
                    "data": "2021-12-15"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "The sfx bombardment can't hide a lack of sense and substance.",
                    "data": "2019-01-04"
                },
                {
                    "avaliacao": null,
                    "texto": "The whole film may be more than a bit suspect cerebrally, with dime-store philosophy, potted mysticism and cut-price otherworldliness, but visually it gives full value as a virtuoso workout for your senses.",
                    "data": "2018-01-10"
                },
                {
                    "avaliacao": null,
                    "texto": "Indeed, if you loved the first Matrix and its mix of comic-book angst, martial arts, virtual reality, video-game punch-ups, pop philosophy, biblical subtext, romance, tragedy and pathos, then you won't be disappointed.",
                    "data": "2018-01-02"
                },
                {
                    "avaliacao": null,
                    "texto": "Though introducing some new ideas and characters, Matrix Reloaded is not as exciting as the 1999 original, suffering from problems that often inflict middle chapters of trilogies.",
                    "data": "2012-07-01"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Not one of the worst sequels that has ever been put in movie theaters, and not one of the most disappointing... but, is it ever a grind.",
                    "data": "2012-05-31"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Electrifying but still violent 2nd in trilogy.",
                    "data": "2010-12-28"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The encoded bloom is off the digital rose in The Matrix Reloaded. [Blu-ray]",
                    "data": "2010-09-08"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Offers some phenomenal action sequences that more than deliver on the jaw-dropping promise shown on the trailers.",
                    "data": "2010-01-09"
                },
                {
                    "avaliacao": null,
                    "texto": "The Wachowskis manage to surprise and amaze with some stunning machine special effects and great scenes that truly dazzle the mind.",
                    "data": "2009-04-29"
                },
                {
                    "avaliacao": null,
                    "texto": "Between the money scenes, we get characters standing at attention and burping prophecies and deep thoughts at each other.",
                    "data": "2008-03-11"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "...less a narrative than an advertisement for a cultural wave. It's all about discount Zen and black clothes, the commodification of sterile violence as Kabuki.",
                    "data": "2007-10-29"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "As a movie, its pacing is off, its characters are thin and its plot is...well, questionable at best. But as a science-fiction phenomenon, it is art.",
                    "data": "2007-07-14"
                },
                {
                    "avaliacao": null,
                    "texto": "If you're 14 or younger in age or sensibility, you may giggle at some of the bons mots.",
                    "data": "2007-06-08"
                },
                {
                    "avaliacao": null,
                    "texto": "Worryingly, the longer this movie goes on, the harder it is to care.",
                    "data": "2006-02-09"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "A smorgasbord of speed, noise, exhilaration, violence and unmitigated how-did-they-do-that glee, this might be the car chase to end all car chases - even with the supremely cheesy techno music.",
                    "data": "2005-12-13"
                }
            ],
            "media_usr": 7.4,
            "reviews_usr": [
                {
                    "avaliacao": 8.0,
                    "texto": "★★★★☆\n\nThe Matrix Reloaded is the wild, excessive, brain-melting middle chapter that dares to go bigger, weirder, and more philosophical than anyone thought possible—and somehow still rules.\n\nYes, it’s bloated. Yes, the Zion rave exists (and yes, it’s exactly as 2003 as you remember). Yes, the Architect scene is a word-salad philosophy exam that makes your head spin. But put all that aside and you’re left with one of the most audacious blockbusters ever made. The freeway chase is still the single greatest action sequence of the 2000s—14 minutes of pure, practical-stunt insanity that has never been topped. The Burly Brawl (100 Agent Smiths vs. Neo) was mind-blowing in 2003 and still looks cool as hell. The chateau fight with the Merovingian’s goons, the Keymaker run, Trinity’s fall… every set-piece is dialed to eleven.\n\nKeanu leans harder into god-mode Neo with that perfect quiet confidence, Carrie-Anne Moss makes Trinity’s love feel like the emotional anchor of the entire trilogy, and Hugo Weaving’s Agent Smith steals the movie every time he opens his mouth. The expanded mythology (the Oracle’s revelations, the Merovingian’s \"choice is an illusion\" monologue, the idea that this might be the sixth version of the Matrix) is deliciously complicated and rewards every rewatch.\n\nIt loses one star only because it’s the middle film syndrome incarnate: it asks a thousand questions, answers almost none, and ends on a cliffhanger that left theaters screaming in 2003. But that ambition is exactly why it’s brilliant.\n\nFour stars: one for the action that still slaps harder than 99 % of modern blockbusters, one for the batshit philosophy that treats its audience like adults, one for the style that drips off the screen, and one because every time \"Navras\" kicks in over the end credits I still get full-body chills.\n\nLoud, long, and gloriously extra.  \n8/10. There is no spoon… but there is a 14-minute freeway chase that will melt your face off. 🏍️💥🔥",
                    "data": "2025-11-17"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Not as good as the first film, but still an entertaining continuation of the story.",
                    "data": "2025-11-13"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Action packed and amazing character development. The only thing that hurt was that it ended on a cliff hanger. Time went by too fast.",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "This expands on (and in some way detracts from) the first film. It's certainly action packed, and these sequences are done very well, but the best bits are the thinking bits - conversations with Smith, the Oracle and the Architect. A worthy follow up.",
                    "data": "2025-11-07"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Four years after The Matrix, expectations were sky-high, but Matrix Reloaded struggled to recapture the original’s magic. While the Wachowskis delivered jaw-dropping action—especially the legendary highway chase—the film’s overstretched story, forced into two parts by the studio, loses focus amid too many characters and hollow philosophical monologues. Despite its ambition and stunning moments, Reloaded feels emotionally flat and weighed down by weak CGI and disconnected subplots. The result is a visually thrilling yet uneven sequel that entertains more than it truly captivates.",
                    "data": "2025-11-01"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Was good and went kinda fast",
                    "data": "2025-09-07"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "A great sequel to the first!",
                    "data": "2025-09-06"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "While The Matrix Reloaded might not be as history defining and culturally impactful as the original movie, it is still an incredible ride. The action scenes in this movie are absolutely stunning, and some of the best action for the time period that still holds up to modern action epics. The fight scene with Agent Smith(s) and the highway chase scene are impeccable. This film is still amazing and deserves more credit than it gets.",
                    "data": "2025-08-29"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "incredible sequel to the first movie. great car chases and really cool plot. but as i said ITS ONLY A LOVE STORY we dont need. more",
                    "data": "2025-08-23"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "Gets wayyy too much hate! Builds upon the first really well and ups the stakes. The action sequences, Zion and Neo's stuff is genuinely awesome. Bravo",
                    "data": "2025-08-20"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "A sequel that’s more style than substance — impressive in moments, but never gripping and riddled with some ordinary acting.",
                    "data": "2025-08-10"
                },
                {
                    "avaliacao": 2.0,
                    "texto": "Loved the first film in the series, but this one is terrible. Somewhere between the hokey screenwriting, terrible CGI, and way too long fight scenes, this film lost my suspension of disbelief. It just feels masturbatory.",
                    "data": "2025-08-02"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Neo upgraded to Ultra Instinct and somehow found time for romance and kung fu mid-air. Confused? Good. Welcome to Reloaded.",
                    "data": "2025-07-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Probably my least favorite in the trilogy but still the greatest.",
                    "data": "2025-07-20"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "A mostly solid sequel that has insane action sequences mixed in with some wooden sci-fi schmaltz. The Agent Smith Clone fight and highway chase scene were both awesome visual delights with great choreography. The Twins were great villains with cool \"ghost\" powers, but their screentime was so short+ Agent Smith infecting people with malware turning them into him was also a cool new way to escalate him as a threat.  I also liked the Oracle's discussion with Neo about destiny vs free will. Paralleled well with Neo's heart to heart with the Zion counselor about machine reliance and the meaning of control. Same goes for Neo's visually memorable confrontation with the Matrix's Architect with the hundreds of TVs in the background surrounded by a blank white void. My only major complaints are that the side characters from Zion are mostly corny/boring, the cave rave party was weird, the acting from Neo & Trinity is more stilted this time, and Trinity kind of devolves into a love interest and damsel near the end (but thankfully she still gets to be cool some of the time). But fortunately, these faults are way less tiresome than in Revolutions. And the cool action scenes and trippy philosophical visuals are more than enough to make up for it. It's not on the same level as the original, but it still has a lot going for it.",
                    "data": "2025-07-19"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Compared to the first film, this sequel's effects improved the action. It also features stronger acting, more engaging writing, and heightened suspense. The performances bring the characters to life in a way that keeps you invested in the story. However, like the original, I still don't consider it among the greatest films of all time. While they are certainly entertaining and enjoyable to watch, they lack the depth and artistry that typically define cinematic masterpieces. Overall, they're fun distractions but not films that will leave a lasting impact.",
                    "data": "2025-07-06"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This movie is indeed a worthy sequel",
                    "data": "2025-06-22"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "Very exciting action sequences, the story isn't really expanded upon in this one, but there's a hell of a lot more action scenes which I don't think is a bad tradeoff at all. 9/10",
                    "data": "2025-06-21"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "It starts strong and the fight scenes with a fully realized Neo are awesome, but it isn't enough to save this convoluted, inconsistent movie. I was so ready to say it was a victim of expectations, but then came to 10-minute dialogue scene capped by the rain code going into the v---na of a woman eating a modded piece of pie, the so-out-of-place-it-is-confusing dance/clothed orgy scene, and a few other jaw-droppingly bad scenes. The movie plays with too many \"big ideas\" to be comprehensible, even for someone one just watched the first movie and is really trying to follow along. But hey, they added a sweet car chase scene and it is the Matrix, so it is watchable.",
                    "data": "2025-05-23"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "I really loved the Matrix, and the sequel is brilliant as well. Truly innovative action sequences.",
                    "data": "2025-05-13"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/matrix_revolutions",
            "titulo": "The Matrix Revolutions",
            "generos": [
                "Sci-Fi",
                "Action"
            ],
            "data de lançamento nos cinemas": "2003-11-05",
            "classificacao indicativa": "R",
            "sinopse": "In a dystopia overrun by robots, Neo (Keanu Reeves), mankind's greatest hope, is trapped in a limbo world. Meanwhile, the majority of the planet's population remains in a state of suspended virtual reality. The few humans who are cognizant of the grim realities of the world desperately try to hold off their mechanical enemies long enough for Neo to escape and save the day, but things turn disastrous when all-powerful computer program Agent Smith (Hugo Weaving) arrives in the flesh.",
            "duracao": "02:10:00",
            "diretor": "Lilly Wachowski, Lana Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Jada Pinkett Smith",
                "Mary Alice",
                "Harold Perrineau",
                "Monica Bellucci",
                "Harry Lennix",
                "Lambert Wilson",
                "Nona Gaye",
                "Anthony Zerbe",
                "David Roberts",
                "Helmut Bakaitis",
                "Ian Bliss",
                "Collin Chou",
                "Essie Davis",
                "Bruce Spence",
                "Clayton Watson",
                "Lachy Hulme",
                "Nathaniel Lees",
                "Anthony Brandon Wong"
            ],
            "media_crit": 5.6,
            "reviews_crit": [
                {
                    "avaliacao": null,
                    "texto": "The Wachowskis may have something in their theory that the world is simply a complex operating system humans are simply virtual programs.... Their dialogue feels written by a computer program, and for that matter acted by a collection of CGI figures.",
                    "data": "2023-09-09"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "Perhaps it’s wrong and narrow-minded to hope that the Wachowskis would only live up to their original film, but their brand of mythology expansion narrows the possibilities and limits the viewer’s enjoyment of this universe.",
                    "data": "2022-07-12"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Just as much as the last entry was a piece of a story, this one is a fragment, telling so little of the yarn that it’s the least complex and most inessential of the series, save for the fact that it finally wraps up character loose ends.",
                    "data": "2022-07-11"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "There are things to like in the opening moments and the final showdown but the rest is either dull or visually unappealing CG bullet-fest scenes... or both, I guess.",
                    "data": "2021-12-22"
                },
                {
                    "avaliacao": null,
                    "texto": "One only trusts that some of those who made vast and overextended claims for the first part of the trilogy have been awakened to reality by this latest nonsense, with any luck by the sound of their own howls of laughter.",
                    "data": "2021-02-15"
                },
                {
                    "avaliacao": null,
                    "texto": "Billed as the final chapter, the [Wachowskis] cop out and leave hints of a potential fourth film. Here's a suggestion: Dump the franchise, because this series has clearly overstayed its welcome.",
                    "data": "2019-11-15"
                },
                {
                    "avaliacao": null,
                    "texto": "The original Matrix was full of dizzying surprises. But it's turned out that the Wachowskis didn't have many more tricks up their sleeves.",
                    "data": "2018-03-12"
                },
                {
                    "avaliacao": null,
                    "texto": "There's great storytelling - some of Hollywood's best ever. The story takes jaw-dropping turns.",
                    "data": "2018-01-04"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "The Wachowski Brothers kept true to their original story.",
                    "data": "2016-01-12"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "Averages out to be a mildly better film than The Matrix Reloaded, mostly on account of being neither as good nor as bad in its peaks and valleys.",
                    "data": "2012-05-31"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Finale with same heavy violence, weaker script.",
                    "data": "2010-12-28"
                },
                {
                    "avaliacao": null,
                    "texto": "Ah, the Wachowski's were one trick ponies after all.",
                    "data": "2009-04-29"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "",
                    "data": "2008-08-07"
                },
                {
                    "avaliacao": null,
                    "texto": "Some of this stuff is just cheesy in the same way it's been cheesy in dozens of cheaper, less cultish films.",
                    "data": "2008-03-11"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "",
                    "data": "2007-07-14"
                },
                {
                    "avaliacao": 3.75,
                    "texto": "It's amazing how such a brilliant opening film can devolve into nothing but uninteresting fight scenes and unnecessary visual effects.",
                    "data": "2006-08-08"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Not in my memory has a film been filled with such a succession of ejaculatory FX shots that cover any semblance of story in goo.",
                    "data": "2005-12-06"
                },
                {
                    "avaliacao": 3.0,
                    "texto": "",
                    "data": "2005-12-06"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "",
                    "data": "2005-07-05"
                },
                {
                    "avaliacao": null,
                    "texto": "Zzzzzz.",
                    "data": "2005-05-04"
                }
            ],
            "media_usr": 7.0,
            "reviews_usr": [
                {
                    "avaliacao": 5.0,
                    "texto": "★★½☆☆\n\nThe Matrix Revolutions is the exhausting, rain-soaked finale that takes everything bold about Reloaded and mostly drowns it in overlong battles, pretentious monologues, and a desperate attempt to tie up every loose thread with a neon-colored bow.\n\nIt starts strong: the Trainman sequence is pure nightmare fuel, the Merovingian’s club still drips decadent menace, and Neo’s real-world blindness glowing with golden code is a haunting visual. But once the machines start drilling into Zion, the film turns into a 40-minute war movie that feels like Michael Bay crashed the party—endless sentinels, APU mechs, and explosions that stop being exciting and start feeling numbing. The climactic Neo-Smith supermatch in the pouring rain has a handful of iconic shots (that crater punch, the sky turning green), but it goes on forever and lacks the razor-sharp choreography of the first two films.\n\nThe philosophy gets clunkier (\"The power of the One extends beyond the Matrix…\"), Trinity’s death is drawn-out and saccharine, and the final peace treaty between humans and machines lands with all the emotional weight of a PowerPoint slide. Hugo Weaving is still having the time of his life as Super-Smith, and Keanu sells Neo’s quiet sacrifice beautifully, but everyone else feels like they’re just waiting for the credits.\n\nTwo and a half stars: one for the handful of jaw-dropping visuals and moments of genuine pathos, one for the sheer audacity of ending a groundbreaking trilogy on its own weird terms, and half a star because, despite everything, I still tear up when the Oracle watches that sunrise.\n\nIt’s messy, overstays its welcome by a solid half-hour, and never quite earns its \"full circle\" ending.  \n5/10. The journey was legendary. The destination? A soggy shrug in the rain. ☔💾",
                    "data": "2025-11-17"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "When I first saw this back when it came out, I was a little disappointed as it felt less Matrix and more robot wars with very little plot development. Watching the garbage that is Resurrections though, has made me appreciate it more because at least it stayed true to the formula.",
                    "data": "2025-11-13"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Beautiful movie. Action packed but different type of action from the first two movies. Character development is awesome, I loved seeing every character grow into something meaningful.",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "Sorry, this is a poor finish. Way too long and the action sequences become boring. The film makes no sense whatsoever, so you feel you don't get any closure; it's just nonsense.\nEven Agent Smith (the best thing in the film by far) gets a sloppy ending. He deserves better.",
                    "data": "2025-11-07"
                },
                {
                    "avaliacao": 1.0,
                    "texto": "Paw patrol is more conceptually, visually and intellectually interesting than this movie\n\nWhat an absolute waste of time and resources. Unfathomable that this movie was allowed to be made in the name of the first Matrix move\n\nThere’s a total of maybe 15 minutes of dialogue. The rest is just cocomelon for adults; flashing lights, gunshots, yelling.\n\nReads like a 12 year olds fan fiction follow up, if no adult ever touched the script\n\nChatGPT could write a more interesting script. \n\nDo not waste 2,5 hours of your life on this. Again, an insult to the matrix and to your intellect",
                    "data": "2025-11-01"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "Matrix Revolutions delivers a long and disappointing conclusion to the trilogy, replacing the intelligence and originality of the first film with overuse of CGI and bloated action sequences. The pacing suffers, with a dull first hour of repetitive dialogue and a final act that arrives too late. The story picks up where Reloaded left off, following Neo trapped in limbo, Morpheus and Trinity negotiating with the Merovingian, and a freewheeling Agent Smith preparing his invasion. The climactic battle for Zion, though visually impressive, is weakened by obvious digital effects, and human character development remains minimal. While the film offers spectacle, it fails to provide the emotional and philosophical payoff the trilogy promised, highlighting the pitfalls of splitting one story into two films.",
                    "data": "2025-11-01"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "The script is pretty messy",
                    "data": "2025-09-07"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Loved this. Such an epic trilogy that has aged so well. 33% from critics is CRIMINAL. Agent Smith's dialogue here was superb",
                    "data": "2025-08-23"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "A flashy but hollow wrap-up that leaves the trilogy limping over the finish line.",
                    "data": "2025-08-10"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Felt like my brain was unplugged from the Matrix… and left in airplane mode. Still, robots go boom. Respect.",
                    "data": "2025-07-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Greatest trilogy. Fantastic ending. Does it get any better?",
                    "data": "2025-07-20"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "A disappointing series finale that feels rushed, bloated, and boring. The acting has gotten increasingly unintentionally funny with its main leads underreact to everything, while its side characters act even cornier (I swear every human captain's one trait is screaming like a psycho). At times it feels more like star trek or Terminator or aliens than the matrix with so much of the movie taking place with the sentinel battle in the real world instead of the matrix and less focus on the main trio. Trinity and Morpheus in particular get shafted hard. Trinity barely puts up a fight against the weird traitor with a puny scalpel (that somehow killed the other lady while he was unguarded) like a scared horror movie lead, while Morpheus barely says a word while everyone around him calls the shots and bosses everyone around. He barely even gets to fight outside of the dance club scene. Agent Smith possession reveal is kind of cool but also kind of dumb. Neo had a little more to do, but he's gone for a good 20 minutes during the Zion battle and he looks really goofy when he starts wearing a blindfold for nearly the entire second half of the movie during supposedly serious moments (including when Trinity gets unceremoniously fridged in a scene that just drags on). As for positives, the Sentinel fight scenes were fun and the final resolution is decent. The climax was decent, but kind of a letter down compared to the first two films. The movie also gets let down by corny dialogue, awkward titled performances, bad CGI background for the final city battle, too many characters that I don't care about, super obvious Jesus symbolism, lack of action SO MUCH exposition. It's not awful, but it could've been a hell of a lot better as the conclusion for the otherwise epic trilogy.",
                    "data": "2025-07-14"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "I don't know why everyone hates this movie so much but it's a definite must watch great acting and a really fun plot so don't listen to all the bad reviews just watch it and you will not regret",
                    "data": "2025-07-12"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "I mean its alright but definitely they could have made better finale movie if they had not rushed to release this movie after 6 months.",
                    "data": "2025-07-12"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "I believe releasing this six months after Reloaded was a mistake. It doesn't give the audience a chance to breathe. Despite that error, this movie plays it safe with its ending by copying a lot from other films like Return of the Jedi, The Two Towers, and Starship Troopers. We've seen this style and formula before, but now there's just more CGI.",
                    "data": "2025-07-08"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "I can comfortably say that this is the worst of the matrix movies so far, I still have yet to watch the 4th one, but the reason I've come to this conclusion is because there is almost no action at all which is what made the first two movies so exciting, and whenever there was action it felt underwhelming like not too much effort was put into it, this isn't a bad movie by any means but it feels like a bit of a let down based on the expectations we were left with from the previous movies. 6.5/10",
                    "data": "2025-06-29"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "It is worthy as a third movie and still a great movie after all these years",
                    "data": "2025-06-22"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "While offering finality, it is not satisfying or clear. I think the Wachowskis tried to fit in too many ideas that they lost the clear plotline the first movie had.",
                    "data": "2025-05-23"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "They didn't even bring it full circle??? They set it up to end everything and then Nothing happens. Spoilers⬇️\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThey set the machine city as the end all to destroy the Matrix then Neo randomly decides to fight Smith and make peace with the machine?? Even though Neo knows the Matrix cycle??? It would've made sense if The matrix goes, Smith goes but no, The matrix is never broken and everyone died for basically nothing.",
                    "data": "2025-05-16"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Rated R for Brief Sexual Content and Sci-Fi Violence!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! The USA grossed over $139,300,000.00!!!!!!!!!!!!!!!!!!!!",
                    "data": "2025-05-13"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/district_b13",
            "titulo": "District B13",
            "generos": [
                "Action",
                "Sci-Fi",
                "Mystery",
                "Thriller"
            ],
            "data de lançamento nos cinemas": "2006-06-02",
            "classificacao indicativa": "R",
            "sinopse": "In 21st-century Paris, a member (Cyril Raffaelli) of an elite police squad must enter a crime-ridden ghetto to defuse a bomb that has fallen into the hands of Taha (Larbi Naceri), a powerful hoodlum. The cop joins forces with a civilian (David Belle) who must rescue his sister (Dany Verissimo) from the same criminal who holds the bomb.",
            "duracao": "01:25:00",
            "diretor": "Pierre Morel",
            "cast": [
                "Cyril Raffaelli",
                "David Belle",
                "Tony D'Amario",
                "Bibi Naceri",
                "Dany Verissimo",
                "François Chattot",
                "Nicolas Woirion",
                "Patrick Olivier",
                "Samir Guesmi",
                "Jérôme Gadner"
            ],
            "media_crit": 7.0,
            "reviews_crit": [
                {
                    "avaliacao": 7.5,
                    "texto": "Comparable to Jackie Chan in his heyday, these actors have the charisma, humor, and ability to advance themselves from stuntmen to stars, and they advance this movie from another dull actioner to must-see entertainment.",
                    "data": "2023-08-22"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "By returning to true action instead of CGI gimmicks or fake stunts, Morel has crafted a film that is electrifying to watch.",
                    "data": "2020-09-06"
                },
                {
                    "avaliacao": null,
                    "texto": "Urban ills are pretty much the same worldwide. But it's the very Frenchness of the film that makes it amusant. Unlike a typical American actioner, the villain is not a megalomaniacal genius, nor a corporate overlord; it's the civil servants. . .",
                    "data": "2017-08-23"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "When Belle is in motion, the movie excels.",
                    "data": "2013-10-06"
                },
                {
                    "avaliacao": null,
                    "texto": "This action film from Luc Besson's B-movie factory is one of his best.",
                    "data": "2010-02-05"
                },
                {
                    "avaliacao": null,
                    "texto": "Comes off more like a theme park show than an actual film, it's there to deliver stunts and never an actual story.",
                    "data": "2009-04-29"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "",
                    "data": "2007-07-14"
                },
                {
                    "avaliacao": null,
                    "texto": "Both smart and direct, District B13 is the kind of lean, mean action film most of America's working directors only wish they could pull off.",
                    "data": "2007-07-03"
                },
                {
                    "avaliacao": null,
                    "texto": "A message-based actioner that's fast, dumb fun.",
                    "data": "2007-06-06"
                },
                {
                    "avaliacao": null,
                    "texto": "I was delighted by the balletic and acrobatic stunts, some of which evoke Tarzan.",
                    "data": "2007-06-06"
                },
                {
                    "avaliacao": null,
                    "texto": "Nifty action flick influenced by Hong Kong cinema that includes a critique of French racism against immigrant community.",
                    "data": "2007-01-02"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "O roteiro quase inexistente é uma mera desculpa para que o filme apresente ao espectador diversas seqüências de ação absolutamente sensacionais criadas a partir do parkour.",
                    "data": "2006-12-20"
                },
                {
                    "avaliacao": null,
                    "texto": "There's something refreshing about an action film that actually gives a damn about more than explosions.",
                    "data": "2006-11-20"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Genre fans will get a kick from the martial-arts action, and that's all District B13 needs to do.",
                    "data": "2006-10-27"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "In his feature directing debut, cinematographer Pierre Morel has delivered an adrenaline-packed picture that sold its brains to the devil in exchange for spectacular fight and chase scenes.",
                    "data": "2006-10-09"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The highly stylized result feels barren of both texture and imagination.",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "For a film that's so light on its feet, \"B13\" seems rooted in what's really happening on the ground.",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "If there's a sequel...I'm there!",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": null,
                    "texto": "District 13 features several plot twists that can only be described as silly, but it's still a hugely entertaining film. Turn off your brain and enjoy.",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "A 90-minute feature simply showing [David] Belle's stunts with no frills would be great; unfortunately, they only account for about 10 minutes - the rest of the time, Belle is called upon to act.",
                    "data": "2006-07-08"
                }
            ],
            "media_usr": 7.6,
            "reviews_usr": [
                {
                    "avaliacao": 7.0,
                    "texto": "What is there to like about this movie? Well, the plot is pretty good, even though I'd have much more trouble suspending my disbelief if it would not have been French. In the wake of all the ruckus in France, this movie feels pretty realistic as a social commentary.\n\nThe stunts (Parkour) are amazing. Smooth, fluid motion and crisp, no-bullshit camera-work makes it a real treat to the eye. The fighting scenes are cool too, and they at least partially real (for unreal, watch Hard Target or any other Van Damme movie. For real, watch Heat) and not as repetitive and drawn-out as the usual ones.\n\nThe whole ghetto atmosphere works really well. Concrete and poverty works fime as scenery. Dialouge seemed good too from what I got from the subtitles.\n\nBut the subtitle was to fast for me to keep up with the movie.",
                    "data": "2025-07-25"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "GOATED CINEMA for real man",
                    "data": "2024-12-18"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "In the near future, the French government has isolated a crime filled ghetto.   However, there are still good but tough persons in there.  When one's sister gets kidnapped, he will risk his life to get her back.\n\nBelle is the founder and leading pioneer of Parkour.  His impressive skills are on full display in this film as well as those of Raffaelli, a karate and wushu practitioner.   \n\nThis is a high octane thriller, full of action.  The story is standard stuff and the acting okay.  But rating it as an action film I'd give it an 8/10.\n\nRecommended",
                    "data": "2023-12-26"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Minha opinião: Esta é a1ª versão, creio que seja um filme francês. 10 anos depois #Hollywood entra e lança sua versão com Paul Walker. As 2 versões São realizadas com David Belle que é um dos criadores do #parkour o esporte que o pessoal fica saltando pela cidade fazendo acrobacias, outras línguas também falam que @Jackiechan seja o grande inspirador para o nascimento desta modalidade, tanto que vendo os filmes dele da década de 80 e 90 vemos muito disso. É um filme cheio de adrenalina que não deixa você respirar do inicio ao fim. Uma boa atuação de Belle e Cyrill, rolou uma boa coordenação entre eles. Um filme que o presidente da França pede para que eles resgatem e desarme uma bomba que esta no Bairro 13. E para essa missão Cyrill é o rsponsavel. Para isso ele deve se disfarçar  e fazer uma aliança com Belle para entrar no Bairro 13 e encontrar a bomba que esta nas mãos do líder das quadrilhas Larbi. E para essa missão eles dão muita porrada, pulos, tiros e tudo que você imaginar. Um filme que te prende na poltrona. O remaker foi bom também.\nRoteiro e enredo são bons. Fizeram bem o trabalho ao estilo feijão com arroz e deu certo. Com um certo exagero, mas nada que desmereça o filme e lembrarmos que é um filme francês.\nVale apena assistir? Sim\nNota: 7",
                    "data": "2023-03-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Best of Movies/TV Series Collection",
                    "data": "2022-12-19"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "It's a pretty fun action movie when you get past the many plot holes. It also features the best parkour scenes I've ever seen in 🎬.",
                    "data": "2022-05-28"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "French action revenge film full of parkour, shoot-outs, ridiculous dialogues, and social/political commentary. I've heard about this movie for years and I don't regret watching it, but it's not for everyone.",
                    "data": "2021-04-22"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Cool parkour, cool fights, interesting script ... What also can desire ?!",
                    "data": "2020-12-13"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Great action, a fun twist and some stunts that defy belief.  It is a blast.",
                    "data": "2020-06-25"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Best parkour I have seen in any movie.",
                    "data": "2020-06-10"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "nice movie. it's worth seeing",
                    "data": "2019-11-09"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "This movie was really something else , I don't know quite what I just saw, I have watched action films from the east for years, and have been contuinusly intrigued and impressed with their inventiveness, the action stunt work is flawless and utterly amazing, these guys are insane in the best possible way, and you just cant take your eyes off them. I feel so excited after this film. So for this being something different, I give \" District B 13\" a C.",
                    "data": "2018-12-05"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Great movie action packed and thrilling tent it that is if you either like reading or you can understand French !! I can understand it so it was entertaining for me ! Cette film est un film amusante avec beaucoup d’action ! Ces violent alors ces pas bon pour les enfants!",
                    "data": "2018-07-29"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "fun foreign action flick. interesting premise and some cool fighting (2 viewings)",
                    "data": "2017-07-26"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "This and the Raid have set the standard for the modern action movie.",
                    "data": "2016-01-09"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "this movie has over the top action with awesome parkour stunt. people who want a short entertaining movie here is one to add on your list",
                    "data": "2015-12-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Brick Mansions fell quite a bit short compared to the original... the film truly was bad ass.",
                    "data": "2015-08-24"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "No-stop action, excellent fighting scenes and the parkour scenes are fantastic, story a bit simplistic but in overall a good film.",
                    "data": "2015-05-16"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "\"District 13\" is pretty much what you expect from a dystopian French action film.  The plot is interesting, the characters are pretty standard, but the thing that makes this film special is the use of parkour in its action sequences.  Parkour (aka \"extreme running\") has seen various waves of popularity since its conception in the late 80's but this film has been a window to the extreme sport for the next generation.  The film stars David Belle, the founder of parkour, as a vigilante who tries to cleanse his Parisian suburb of gang violence.  I enjoyed the story, but not nearly as much as I enjoyed watching Belle get chased around buildings and over rooftops by various bad guys.  Naturally, he ends up being paired up with Cyril Raffaelli (another insanely awesome parkour guy) so that they can get chased around together.  Bibi Naceri plays a pretty despicable bad guy and Dany Verissimo provides the damsel in distress.  A lot of the story is predictable and far-fetched, but it's worth it for the action sequences.  \"District 13\" isn't an amazing film, but it is an important preservation of parkour with unbelievable stunts that were filmed without wires or CGI.",
                    "data": "2015-04-20"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "Luc Besson Presents This Fast & Fun Action Flick Which Showcases Some Great Parkour Action. Starring David Belle (Creator Of Free Running) And Stuntman Cyril Raffaelli, this thriller is based in a near future where the most dangerous district in Paris is closed of from the rest of the city. Government officials have however hatched a plot to destroy this part of the city. To make it look like if they are trying to save lives though, they send an ace but naive cop undercover to seemingly disarm the bomb. A basic plot which allows for some nicely choreographed free running stunts to be performed, completely without wires and CGI, this is one film that's worth a viewing for it's different styled stunts, and was the original film to use these types of stunts.",
                    "data": "2015-02-04"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/terminator_2_judgment_day",
            "titulo": "Terminator 2: Judgment Day",
            "generos": [
                "Sci-Fi",
                "Action",
                "Mystery",
                "Thriller"
            ],
            "data de lançamento nos cinemas": "1991-07-03",
            "classificacao indicativa": "R",
            "sinopse": "In this sequel set eleven years after \"The Terminator,\" young John Connor (Edward Furlong), the key to civilization's victory over a future robot uprising, is the target of the shape-shifting T-1000 (Robert Patrick), a Terminator sent from the future to kill him. Another Terminator, the revamped T-800 (Arnold Schwarzenegger), has been sent back to protect the boy. As John and his mother (Linda Hamilton) go on the run with the T-800, the boy forms an unexpected bond with the robot.",
            "duracao": "02:16:00",
            "diretor": "James Cameron",
            "cast": [
                "Arnold Schwarzenegger",
                "Linda Hamilton",
                "Edward Furlong",
                "Robert Patrick",
                "Earl Boen",
                "Joe Morton",
                "S. Epatha Merkerson",
                "Castulo Guerra",
                "Danny Cooksey",
                "Jenette Goldstein",
                "Xander Berkeley"
            ],
            "media_crit": 8.7,
            "reviews_crit": [
                {
                    "avaliacao": null,
                    "texto": "One heck of a ride.",
                    "data": "2025-09-23"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Here, she’s modified and trained until she’s a hard-edged, no-nonsense force willing to do anything to protect her son and the people of earth from the nuclear holocaust that is impending.",
                    "data": "2025-07-06"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "James Cameron's critically and commercially acclaimed sci-fi blockbuster is still an almost-perfect sequel, 33 years after its release.",
                    "data": "2024-11-22"
                },
                {
                    "avaliacao": null,
                    "texto": "Terminator 2 was the perfect sequel as it gave bigger and better action sequences and chases and also changed things around to get the story going in a new direction",
                    "data": "2024-11-15"
                },
                {
                    "avaliacao": null,
                    "texto": "Like a relentless T-800 on a mission, this film continues to dominate as the greatest action movie ever made. Nearly 25 years later, it remains a high-octane adrenaline rush that’s guaranteed to have grown men weeping by the third act.",
                    "data": "2024-08-12"
                },
                {
                    "avaliacao": 8.75,
                    "texto": "[Cameron's] showmanship is legendary, his capacity for orchestrating mayhem unparalleled. And Terminator 2: Judgment Day is a prime example.",
                    "data": "2024-03-07"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "There is not a single rift under its metal shell and, after so many years, it still retains the groundbreaking spirit with the science fiction journey of the machine that learns the value of human empathy. [Full review in Spanish]",
                    "data": "2024-02-09"
                },
                {
                    "avaliacao": null,
                    "texto": "One of the best franchise sequels ever made.",
                    "data": "2023-09-19"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "Bigger, bolder and slicker, T2 is one of the greatest sci-fi/action films of all time. [Full review in Spanish]",
                    "data": "2023-07-10"
                },
                {
                    "avaliacao": 3.75,
                    "texto": "The movie amounts to one long, long chase scene, and damned if the American public isn't lapping it up as if it were something special.",
                    "data": "2023-05-09"
                },
                {
                    "avaliacao": null,
                    "texto": "Aside from technological hubris, it's nothing out of this world.  [Full review in Spanish]",
                    "data": "2023-01-26"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Amazing things happen in Terminator 2, things you've never seen in movies -- things you didn't know the movies could do.",
                    "data": "2021-08-17"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Its legacy still holds up today, thanks to all of those elements- the plot, the effects, the action, and that performance from its leading man. (30th anniversary)",
                    "data": "2021-07-16"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "While bigger isn't always better, writer/director James Cameron's follow-up is genuinely bigger and better in nearly every way.",
                    "data": "2020-09-24"
                },
                {
                    "avaliacao": null,
                    "texto": "James Cameron's update of his sci-fi action classic is a great night at the movies. Just don't expect it to change your mind about 3D.",
                    "data": "2019-04-16"
                },
                {
                    "avaliacao": null,
                    "texto": "Inarguably one of the greatest sequels ever made, Terminator 2 builds itself upon a few key ideas that upend the audience's expectations and work like gangbusters with industry-altering technological execution.",
                    "data": "2018-11-02"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "No matter how bad the sequels get they can't undo the greatness of Terminator 2. This is a movie that will live forever.",
                    "data": "2018-10-31"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Cameron's vision makes the engine go and shows why he is one of the best blockbuster directors ever.",
                    "data": "2018-10-10"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Terminator 2 is genuinely reverential towards Arnold, gazing raptly upon his physical form and elevating his lack of affect to something like a Platonic ideal of masculinity.",
                    "data": "2018-07-25"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "T2 truly attains the test of time with a fabulous story connected with smart and effective special effects that complement the story.",
                    "data": "2018-06-22"
                }
            ],
            "media_usr": 9.0,
            "reviews_usr": [
                {
                    "avaliacao": 9.0,
                    "texto": "A great sequel to our classic franchise, but it doesn’t keep up with the tone from the first movie. 9.5/10",
                    "data": "2025-11-17"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Terminator 2 sets itself a level apart from other sequels by not only ramping up the action, but also the subject matter.  There is so much about this film that gives writer/director James Cameron a feather in his cap from the ground breaking special effects that still hold up 35 years later, to the unlikely emotional bond between a human and machine that is powerful enough to bring the audience to tears.  Terminator 2 is not only the best film of 1991 but one of the greatest action films ever made.",
                    "data": "2025-11-09"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "one of the best action movies of all time",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "This is one of those stellar classic action movies and it was the best action movie of the 1990s. Way ahead of its time! Ground breaking special effects, a relentless and threateningly powerful villain, humorous and awesome moments from Arny, and entertaining action set pieces and sequences that looked convincingly real! Plus great acting from Edward Furlong at such a young age!",
                    "data": "2025-10-31"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "The original was better in the 80s than they make 90s sequel… then he came back once again in Terminator.",
                    "data": "2025-10-23"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "When the sequel is even better than the first one.",
                    "data": "2025-10-16"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Best Terminator movie, period. This is the one that all others are judged on,  and it's a high bar.",
                    "data": "2025-10-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Sequels have a reputation of not matching up to the movie to which they are a sequel, and that reputation is usually well deserved (especially nowadays when an original movie is flogged to death with endless sequels) but this is one of the few that is  better than the original - which was brilliant. I'm put off many 21st century movies by the OTT cgi special effects. I think the '80's and 90's movies had the special effects balance just right.",
                    "data": "2025-10-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "In my opinion: This is the greatest action movie of all time. And the greatest movie sequel of all time.",
                    "data": "2025-10-15"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "For being the sequel to the 1984 blockbuster hit- this movie has a lot to offer and does it well. Even though this was filmed in 1991- James Cameron and crew, Arnold Schwarzenegger, Linda Hamilton, Robert Patrick, Edward Furlong and others made this movie work well. Great plot and story line, plenty of action, the pacing never lets up and this movie even spawned a couple of games on the Sega Genesis gaming system- in which I own a Sega Genesis 3 system and I have played T2: The Arcade Game quite a bit in the past.\n4.5 out of 5 stars- I highly recommend this film. It has everything going for it and it is a blast.",
                    "data": "2025-10-14"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Undoubtedly the best sequel of all time. Approves and builds upon the original in every possible way. Also... possibly the best ACTION film ever made.",
                    "data": "2025-10-09"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "A really great sequel to one of the best films of all time.",
                    "data": "2025-10-05"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This is one of the greatest movies of all time, period. It has everything for every moviegoer. Action, drama, comedy, and the feels. It never stops delivering. I've seen this movies over a dozen times and I still feel every emotion James Cameron wanted me to feel. Study this Hollywood, moviegoers are not that complicated.",
                    "data": "2025-09-29"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "My favorite movie of all time, no notes",
                    "data": "2025-09-21"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "WOW! The best word that describes this movie is \"wow\"! Not only to say that this is the best Action movie of all time, this is probably one of the greatest movies ever made . The people in my country watched this film when there where limited VHS cassettes at all. And again, my favorite Director did an timeless epic-masterpiece. Yes, an epic. Every scene in this movie is beyond the perfection. The timeless plot. Groundbreaking effects. Unforgettable \"Hasta la vista, baby.\" .\n\nPerfect direction for a sci-fix action film. When the action starts, you're in for the ride of your life. There never be the same movie like T2. What else I can say about this film? A Must see for everyone.",
                    "data": "2025-09-13"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Best 80s action movie out there",
                    "data": "2025-09-09"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Terminator 2: Judgment Day (1991) is a much more in-depth version than the first film, this one has several elements that include a lot of CGI. The action scenes are very good.",
                    "data": "2025-09-06"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "Absolute cinema. When I first watched this movie, I had done so in English without ever having watched the first installment, and yet, I knew almost everything about the characters, plot and previous storyline. Very rarely can you pick up on a series half-way through and still have the ability to understand everything that is going on, I love it. Additionally, the character development is extraordinary, John is played by a wonderful child actor, Sarah and the T-800 are familiar faces with not too dissimilar vibes (aside from the T-800 being reprogrammed, of course) and the T-1000 is so ominous in their lack of emotion and relentless desire to pursue John. Overall it has an eerie aroma to it, with a gorgeous amount of boom and action to give it the kick it needs to still be an action movie. You can't hate this film, would watch a million times if I could.",
                    "data": "2025-09-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Terminator 2: Judgment Day is a rare sequel that surpasses the original, blending groundbreaking visual effects with a gripping story. James Cameron introduces morphing technology to cinema, delivering thrilling action sequences while reshaping Sarah Connor into a fierce warrior rather than a victim. The film balances spectacle with emotion, particularly in the touching bond between John Connor and the T-800, who becomes a protective father figure. More than three decades later, it remains a defining masterpiece of science fiction and action.",
                    "data": "2025-08-23"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Awesome sci fi movie. The effects, acting, story... everything. Chef's kiss.",
                    "data": "2025-08-17"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/district_b13",
            "titulo": "District B13",
            "generos": [
                "Action",
                "Sci-Fi",
                "Mystery",
                "Thriller"
            ],
            "data de lançamento nos cinemas": "2006-06-02",
            "classificacao indicativa": "R",
            "sinopse": "In 21st-century Paris, a member (Cyril Raffaelli) of an elite police squad must enter a crime-ridden ghetto to defuse a bomb that has fallen into the hands of Taha (Larbi Naceri), a powerful hoodlum. The cop joins forces with a civilian (David Belle) who must rescue his sister (Dany Verissimo) from the same criminal who holds the bomb.",
            "duracao": "01:25:00",
            "diretor": "Pierre Morel",
            "cast": [
                "Cyril Raffaelli",
                "David Belle",
                "Tony D'Amario",
                "Bibi Naceri",
                "Dany Verissimo",
                "François Chattot",
                "Nicolas Woirion",
                "Patrick Olivier",
                "Samir Guesmi",
                "Jérôme Gadner"
            ],
            "media_crit": 7.0,
            "reviews_crit": [
                {
                    "avaliacao": 7.5,
                    "texto": "Comparable to Jackie Chan in his heyday, these actors have the charisma, humor, and ability to advance themselves from stuntmen to stars, and they advance this movie from another dull actioner to must-see entertainment.",
                    "data": "2023-08-22"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "By returning to true action instead of CGI gimmicks or fake stunts, Morel has crafted a film that is electrifying to watch.",
                    "data": "2020-09-06"
                },
                {
                    "avaliacao": null,
                    "texto": "Urban ills are pretty much the same worldwide. But it's the very Frenchness of the film that makes it amusant. Unlike a typical American actioner, the villain is not a megalomaniacal genius, nor a corporate overlord; it's the civil servants. . .",
                    "data": "2017-08-23"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "When Belle is in motion, the movie excels.",
                    "data": "2013-10-06"
                },
                {
                    "avaliacao": null,
                    "texto": "This action film from Luc Besson's B-movie factory is one of his best.",
                    "data": "2010-02-05"
                },
                {
                    "avaliacao": null,
                    "texto": "Comes off more like a theme park show than an actual film, it's there to deliver stunts and never an actual story.",
                    "data": "2009-04-29"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "",
                    "data": "2007-07-14"
                },
                {
                    "avaliacao": null,
                    "texto": "Both smart and direct, District B13 is the kind of lean, mean action film most of America's working directors only wish they could pull off.",
                    "data": "2007-07-03"
                },
                {
                    "avaliacao": null,
                    "texto": "A message-based actioner that's fast, dumb fun.",
                    "data": "2007-06-06"
                },
                {
                    "avaliacao": null,
                    "texto": "I was delighted by the balletic and acrobatic stunts, some of which evoke Tarzan.",
                    "data": "2007-06-06"
                },
                {
                    "avaliacao": null,
                    "texto": "Nifty action flick influenced by Hong Kong cinema that includes a critique of French racism against immigrant community.",
                    "data": "2007-01-02"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "O roteiro quase inexistente é uma mera desculpa para que o filme apresente ao espectador diversas seqüências de ação absolutamente sensacionais criadas a partir do parkour.",
                    "data": "2006-12-20"
                },
                {
                    "avaliacao": null,
                    "texto": "There's something refreshing about an action film that actually gives a damn about more than explosions.",
                    "data": "2006-11-20"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Genre fans will get a kick from the martial-arts action, and that's all District B13 needs to do.",
                    "data": "2006-10-27"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "In his feature directing debut, cinematographer Pierre Morel has delivered an adrenaline-packed picture that sold its brains to the devil in exchange for spectacular fight and chase scenes.",
                    "data": "2006-10-09"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The highly stylized result feels barren of both texture and imagination.",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "For a film that's so light on its feet, \"B13\" seems rooted in what's really happening on the ground.",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "If there's a sequel...I'm there!",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": null,
                    "texto": "District 13 features several plot twists that can only be described as silly, but it's still a hugely entertaining film. Turn off your brain and enjoy.",
                    "data": "2006-07-14"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "A 90-minute feature simply showing [David] Belle's stunts with no frills would be great; unfortunately, they only account for about 10 minutes - the rest of the time, Belle is called upon to act.",
                    "data": "2006-07-08"
                }
            ],
            "media_usr": 7.6,
            "reviews_usr": [
                {
                    "avaliacao": 7.0,
                    "texto": "What is there to like about this movie? Well, the plot is pretty good, even though I'd have much more trouble suspending my disbelief if it would not have been French. In the wake of all the ruckus in France, this movie feels pretty realistic as a social commentary.\n\nThe stunts (Parkour) are amazing. Smooth, fluid motion and crisp, no-bullshit camera-work makes it a real treat to the eye. The fighting scenes are cool too, and they at least partially real (for unreal, watch Hard Target or any other Van Damme movie. For real, watch Heat) and not as repetitive and drawn-out as the usual ones.\n\nThe whole ghetto atmosphere works really well. Concrete and poverty works fime as scenery. Dialouge seemed good too from what I got from the subtitles.\n\nBut the subtitle was to fast for me to keep up with the movie.",
                    "data": "2025-07-25"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "GOATED CINEMA for real man",
                    "data": "2024-12-18"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "In the near future, the French government has isolated a crime filled ghetto.   However, there are still good but tough persons in there.  When one's sister gets kidnapped, he will risk his life to get her back.\n\nBelle is the founder and leading pioneer of Parkour.  His impressive skills are on full display in this film as well as those of Raffaelli, a karate and wushu practitioner.   \n\nThis is a high octane thriller, full of action.  The story is standard stuff and the acting okay.  But rating it as an action film I'd give it an 8/10.\n\nRecommended",
                    "data": "2023-12-26"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Minha opinião: Esta é a1ª versão, creio que seja um filme francês. 10 anos depois #Hollywood entra e lança sua versão com Paul Walker. As 2 versões São realizadas com David Belle que é um dos criadores do #parkour o esporte que o pessoal fica saltando pela cidade fazendo acrobacias, outras línguas também falam que @Jackiechan seja o grande inspirador para o nascimento desta modalidade, tanto que vendo os filmes dele da década de 80 e 90 vemos muito disso. É um filme cheio de adrenalina que não deixa você respirar do inicio ao fim. Uma boa atuação de Belle e Cyrill, rolou uma boa coordenação entre eles. Um filme que o presidente da França pede para que eles resgatem e desarme uma bomba que esta no Bairro 13. E para essa missão Cyrill é o rsponsavel. Para isso ele deve se disfarçar  e fazer uma aliança com Belle para entrar no Bairro 13 e encontrar a bomba que esta nas mãos do líder das quadrilhas Larbi. E para essa missão eles dão muita porrada, pulos, tiros e tudo que você imaginar. Um filme que te prende na poltrona. O remaker foi bom também.\nRoteiro e enredo são bons. Fizeram bem o trabalho ao estilo feijão com arroz e deu certo. Com um certo exagero, mas nada que desmereça o filme e lembrarmos que é um filme francês.\nVale apena assistir? Sim\nNota: 7",
                    "data": "2023-03-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Best of Movies/TV Series Collection",
                    "data": "2022-12-19"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "It's a pretty fun action movie when you get past the many plot holes. It also features the best parkour scenes I've ever seen in 🎬.",
                    "data": "2022-05-28"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "French action revenge film full of parkour, shoot-outs, ridiculous dialogues, and social/political commentary. I've heard about this movie for years and I don't regret watching it, but it's not for everyone.",
                    "data": "2021-04-22"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Cool parkour, cool fights, interesting script ... What also can desire ?!",
                    "data": "2020-12-13"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Great action, a fun twist and some stunts that defy belief.  It is a blast.",
                    "data": "2020-06-25"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Best parkour I have seen in any movie.",
                    "data": "2020-06-10"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "nice movie. it's worth seeing",
                    "data": "2019-11-09"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "This movie was really something else , I don't know quite what I just saw, I have watched action films from the east for years, and have been contuinusly intrigued and impressed with their inventiveness, the action stunt work is flawless and utterly amazing, these guys are insane in the best possible way, and you just cant take your eyes off them. I feel so excited after this film. So for this being something different, I give \" District B 13\" a C.",
                    "data": "2018-12-05"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Great movie action packed and thrilling tent it that is if you either like reading or you can understand French !! I can understand it so it was entertaining for me ! Cette film est un film amusante avec beaucoup d’action ! Ces violent alors ces pas bon pour les enfants!",
                    "data": "2018-07-29"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "fun foreign action flick. interesting premise and some cool fighting (2 viewings)",
                    "data": "2017-07-26"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "This and the Raid have set the standard for the modern action movie.",
                    "data": "2016-01-09"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "this movie has over the top action with awesome parkour stunt. people who want a short entertaining movie here is one to add on your list",
                    "data": "2015-12-01"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Brick Mansions fell quite a bit short compared to the original... the film truly was bad ass.",
                    "data": "2015-08-24"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "No-stop action, excellent fighting scenes and the parkour scenes are fantastic, story a bit simplistic but in overall a good film.",
                    "data": "2015-05-16"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "\"District 13\" is pretty much what you expect from a dystopian French action film.  The plot is interesting, the characters are pretty standard, but the thing that makes this film special is the use of parkour in its action sequences.  Parkour (aka \"extreme running\") has seen various waves of popularity since its conception in the late 80's but this film has been a window to the extreme sport for the next generation.  The film stars David Belle, the founder of parkour, as a vigilante who tries to cleanse his Parisian suburb of gang violence.  I enjoyed the story, but not nearly as much as I enjoyed watching Belle get chased around buildings and over rooftops by various bad guys.  Naturally, he ends up being paired up with Cyril Raffaelli (another insanely awesome parkour guy) so that they can get chased around together.  Bibi Naceri plays a pretty despicable bad guy and Dany Verissimo provides the damsel in distress.  A lot of the story is predictable and far-fetched, but it's worth it for the action sequences.  \"District 13\" isn't an amazing film, but it is an important preservation of parkour with unbelievable stunts that were filmed without wires or CGI.",
                    "data": "2015-04-20"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "Luc Besson Presents This Fast & Fun Action Flick Which Showcases Some Great Parkour Action. Starring David Belle (Creator Of Free Running) And Stuntman Cyril Raffaelli, this thriller is based in a near future where the most dangerous district in Paris is closed of from the rest of the city. Government officials have however hatched a plot to destroy this part of the city. To make it look like if they are trying to save lives though, they send an ace but naive cop undercover to seemingly disarm the bomb. A basic plot which allows for some nicely choreographed free running stunts to be performed, completely without wires and CGI, this is one film that's worth a viewing for it's different styled stunts, and was the original film to use these types of stunts.",
                    "data": "2015-02-04"
                }
            ]
        },
        {
            "url": "https://www.rottentomatoes.com/m/matrix",
            "titulo": "The Matrix",
            "generos": [
                "Sci-Fi",
                "Action",
                "Mystery",
                "Thriller"
            ],
            "data de lançamento nos cinemas": "1999-03-31",
            "classificacao indicativa": "R",
            "sinopse": "Neo believes that Morpheus, an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity, a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.",
            "duracao": "02:16:00",
            "diretor": "Lilly Wachowski, Lana Wachowski",
            "cast": [
                "Keanu Reeves",
                "Laurence Fishburne",
                "Carrie-Anne Moss",
                "Hugo Weaving",
                "Joe Pantoliano",
                "Gloria Foster",
                "Marcus Chong",
                "Paul Goddard",
                "Robert Taylor",
                "Julian Arahanga",
                "Matt Doran",
                "Belinda McClory",
                "Anthony Ray Parker",
                "Rowan Witt"
            ],
            "media_crit": 7.9,
            "reviews_crit": [
                {
                    "avaliacao": 9.0,
                    "texto": "Making a great film that's a psychedelic, kung-fu-inspired meditation on the human condition is a tall order. The Matrix delivers on all that & more.",
                    "data": "2024-09-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "“The Matrix” is the AI prophecy and wake-up call the human race is in dire need of. Watching the 2024 re-release is highly recommended.",
                    "data": "2024-09-25"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "An amazing cocktail of martial arts, shootouts, philosophy, romance, fantasy, revolutionary visual effects and perfect casting. “The Matrix” surprised us 25 years ago, and it continues to surprise us in the Year of Our Lord 2024. Full review in Spanish.",
                    "data": "2024-09-21"
                },
                {
                    "avaliacao": null,
                    "texto": "The Wachowskis proceed to turn the world as we know it into a virtual reality landscape with a 20th century tech-noir look (lit with a sickly green hue, like the glow of an old IBM computer screen) and the physics of a video game.",
                    "data": "2023-09-09"
                },
                {
                    "avaliacao": null,
                    "texto": "A $60 million, high-tech assault on the senses and a pretentious insult to the mind.",
                    "data": "2023-07-15"
                },
                {
                    "avaliacao": null,
                    "texto": "A cyberpunk thriller that's so much fun to watch, it could single-handedly reboot the genre.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "The Wachowskis seem to be saying that while state-of-the-art effects speak for themselves, loud and clear, there's still room amid all the kicking and shooting and shouting for the carefully observed human emotion.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "Though The Matrix ultimately overdoses on gloom-and-doom grunge, over-elaborate cool and especially running time, it's just clever enough to enable [the Wachowskis] to nix the sophomore jinx following 1996's Bound.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "I know almost nothing of the intricate techniques that make The Matrix as eye-filling as it is brain-numbing, but I can tell you that... [its visuals] are wondrous to behold.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.0,
                    "texto": "If you're looking for a good spring fix of existentialist sci-fi, look no further than The Matrix -- then do everything you can to look deeper than the skin-tight surface.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Although it's sometimes too confounding for its own good and a little heavy on the Zen-inspired techno-babble, The Matrix is a consistently absorbing assault on the senses.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "There's more form than content in The Matrix, but Bill Pope's swooping, noir-inflected cinematography is wonderfully complemented by Owen Paterson's inventive production design, a great soundtrack and the best fight choreography this side of Hong Kong.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 7.5,
                    "texto": "Give [the Wachowskis] an A for effort and three A's for those effects. The Matrix is a dazzlingly original visual adventure.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 2.5,
                    "texto": "Casting the robotic Reeves as the hope of humanity may be this oppressively long, self-satisfied movie's funniest gag, but it doesn't really make the game any fun. It means we get stuck with the least interesting player.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "The Matrix's pleasures are considerable, but they're all purely visceral, too, lacking the mythology that would have elevated the movie. The movie is best taken as the first entry in a brand-new genre: post-modern sci-fi pulp.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "How could filmmakers who are so skilled and imaginative lose themselves (and us) in what feels like a college stab at Aldous Huxley metaphysics?",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 4.0,
                    "texto": "A futuristic paranoia extravaganza, it would seem to have far more appeal to an artificial intelligence than it would to human beings and other carbon-based life forms.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 5.0,
                    "texto": "An interminable, sterile, exercise in cinematographic onanism.  [Full review in Spanish]",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": null,
                    "texto": "Like last year's Dark City, the effects and storyline of The Matrix plow through enough fresh territory to make it worth seeing.",
                    "data": "2023-07-13"
                },
                {
                    "avaliacao": 6.25,
                    "texto": "Visually, at least, The Matrix more than lives up to its billing. Writer-directors [the Wachowskis] seem to literally bring the screen to life with action scenes that define the word kinetic.",
                    "data": "2023-07-13"
                }
            ],
            "media_usr": 7.2,
            "reviews_usr": [
                {
                    "avaliacao": 10.0,
                    "texto": "Amazing movie if U like action movies and movies with crazy stories",
                    "data": "2025-11-12"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "amazing acting, action and visuals. It is a must see classic no matter what movies you like",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This movie was ahead of its time. A classic master piece with quality actors.",
                    "data": "2025-11-08"
                },
                {
                    "avaliacao": 7.0,
                    "texto": "Cool action movie.... although a bit flawed.....",
                    "data": "2025-11-06"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "Fun and clever movie.",
                    "data": "2025-11-01"
                },
                {
                    "avaliacao": 1.0,
                    "texto": "Wish I could give this pretentious pile of crap Zero Stars.",
                    "data": "2025-10-31"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "One of the most iconic movies of my generation\n\nFor a movie made in the late ’90s, The Matrix has absolutely incredible production value. The visual effects and animation techniques were way ahead of their time — the slow-motion “bullet time” shots and slick fight choreography still hold up amazingly well today. It’s one of those films that completely changed the game for action and sci-fi movies.\n\nFrom start to finish, The Matrix keeps you on the edge of your seat. The story is mind-bending, the pacing is perfect, and the atmosphere pulls you deep into its futuristic world. It’s one of those rare movies that makes you think while still delivering nonstop entertainment.\n\nOverall, I’d give The Matrix a solid 4 stars. It’s stylish, thought-provoking, and packed with action — an iconic film that still feels fresh decades later.",
                    "data": "2025-10-28"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "OK, so it's a bit surf dude nonsensical, but it's a great idea and an even greater spectacle. It really doesn't make sense on any level but as long as you don't mind that, you can just enjoy the ride.",
                    "data": "2025-10-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "This movie was built to mastery. There is so much brilliance that went into asking some very deep questions about life, creation and so many other spiritual mysteries. Extremely well done and highly enjoyable. This movie was so far ahead of its time that no other film series has been able to dig this deep on asking some very important questions. Very nice balance between story and integrating technical action scenes. Very well done. One of my very favorite movies of alll time",
                    "data": "2025-10-27"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "One of the greatest movies ever.",
                    "data": "2025-10-23"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Best AI Take Over + Action movie ever created. Just watch it if you haven't. There were so many industry standards set with this movie. If you don't like it, there's probably something wrong with you and you should see a professional about it. :)",
                    "data": "2025-10-21"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "One of the best movies ever made.",
                    "data": "2025-10-16"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "The Matrix is a science fiction film about Neo, a hacker who discovers that he is in a simulation, and joins a group a rebels to fight to save humanity. The movie has an interesting story, great acting, amazing visuals, and special effects that still hold up with today's standards. Overall, I would give it a 9.5, definitely one of the best films I've watched.",
                    "data": "2025-10-15"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "To be honest, one of the best sci-fi movies I've ever seen because it really go through the question of \"do we really live in the world we live in\", really thought-provoking  and well paced : everything isn't explained and laid out to you : you have to follow the storyline and understand by yourself (more immersive than usual Sci-fi movies).  It aged a bit, yeah, but still have impressive effects and CGI is really specific at this movie, a revolutionnary futuristic style with new ways of editing (at the time it was published). The music is also more original than usual with Rage Against The Machine and electro/grunge music that really goes well with the overall atmosphere. \n And surprisingly, the following movies are as good as this one (maybe less impressive because effects were less surprising) with a well-thought storyline and effects obviously.",
                    "data": "2025-10-09"
                },
                {
                    "avaliacao": 9.0,
                    "texto": "so really good. and it's the best.",
                    "data": "2025-09-30"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "It was absolutely incredible on the big screen!!! I didn’t get to see it on its initial run, but I didn’t see the sequels.  This was a full circle moment and I’m so glad I got to experience as the director’s intended it to be.",
                    "data": "2025-09-28"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "Greatest movie of my time",
                    "data": "2025-09-20"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The matrix is a Extremely important piece of cinema. It was shot pre 911. It had come just 2 years before star wars rebooted episode 1. Amd, It was badass. The whole comcelt was something I nyself truly thought up once. Completely differe t vision for the film. Bjt i still had this film in my mind. I gill this day in 2025 say its the best film rver. Msde handd down bh a mile. Watch this m ow!!!!!",
                    "data": "2025-09-18"
                },
                {
                    "avaliacao": 8.0,
                    "texto": "The ai predict thing is kinda cool",
                    "data": "2025-09-07"
                },
                {
                    "avaliacao": 10.0,
                    "texto": "The Matrix is one of those movies that everyone should probably see. The cultural impact that this movie has had on the world (in both good and bad ways) is completely incomparable. There are people out there that think the undertones of spiritual and world views in this film are actually real. The action in this movie is amazing, and the story in peak. If you haven't seen this yet, now is the time.",
                    "data": "2025-08-30"
                }
            ]
        }
    ]
}